
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>2.1 文化变革 · 迁移到云原生应用架构</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="Jimmy Song">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-toc-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search-plus/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-lightbox/lightbox.min.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="organizational-change.html" />
    
    
    <link rel="prev" href="changes-needed.html" />
    

    
        <link rel="shortcut icon" href='../images/favicon.ico' type="image/x-icon">
    
    
        <link rel="bookmark" href='../images/favicon.ico' type="image/x-icon">
    
    
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"repo":"rootsongjc/migrating-to-cloud-native-application-architectures","types":["star"],"size":"small"};
    </script>

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://jimmysong.io" target="_blank" class="custom-link">回到首页</a>
        </li>
    
        
        <li>
            <a href="https://cloudnative.to" target="_blank" class="custom-link">云原生社区</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../chapter1/the-rise-of-cloud-native.html">
            
                <a href="../chapter1/the-rise-of-cloud-native.html">
            
                    
                    1. 云原生的崛起
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../chapter1/why-cloud-native-application-architectures.html">
            
                <a href="../chapter1/why-cloud-native-application-architectures.html">
            
                    
                    1.1 为何使用云原生应用架构？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="../chapter1/defining-cloud-native-architectures.html">
            
                <a href="../chapter1/defining-cloud-native-architectures.html">
            
                    
                    1.2 云原生架构的定义
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="../chapter1/summary.html">
            
                <a href="../chapter1/summary.html">
            
                    
                    1.3 本章小结
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="changes-needed.html">
            
                <a href="changes-needed.html">
            
                    
                    2. 在变革中前行
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.3.1" data-path="cultural-change.html">
            
                <a href="cultural-change.html">
            
                    
                    2.1 文化变革
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="organizational-change.html">
            
                <a href="organizational-change.html">
            
                    
                    2.2 组织变革
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="technical-change.html">
            
                <a href="technical-change.html">
            
                    
                    2.3 技术变革
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="summary.html">
            
                <a href="summary.html">
            
                    
                    2.4 本章小结
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../chapter3/migration-cookbook.html">
            
                <a href="../chapter3/migration-cookbook.html">
            
                    
                    3. 迁移指南
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="../chapter3/decomposition-recipes.html">
            
                <a href="../chapter3/decomposition-recipes.html">
            
                    
                    3.1 分解原架构
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="../chapter3/distributed-systems-recipes.html">
            
                <a href="../chapter3/distributed-systems-recipes.html">
            
                    
                    3.2 使用分布式系统
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="../chapter3/summary.html">
            
                <a href="../chapter3/summary.html">
            
                    
                    3.3 本章小结
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >2.1 文化变革</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div class="search-plus" id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <html><head></head><body><h1 id="&#x6587;&#x5316;&#x53D8;&#x9769;">&#x6587;&#x5316;&#x53D8;&#x9769;</h1>
<p>&#x4F01;&#x4E1A;IT&#x91C7;&#x7528;&#x4E91;&#x539F;&#x751F;&#x67B6;&#x6784;&#x6240;&#x9700;&#x7684;&#x53D8;&#x9769;&#x6839;&#x672C;&#x4E0D;&#x662F;&#x6280;&#x672F;&#x6027;&#x7684;&#xFF0C;&#x800C;&#x662F;&#x4F01;&#x4E1A;&#x6587;&#x5316;&#x548C;&#x7EC4;&#x7EC7;&#x7684;&#x53D8;&#x9769;&#xFF0C;&#x56F4;&#x7ED5;&#x6D88;&#x9664;&#x9020;&#x6210;&#x6D6A;&#x8D39;&#x7684;&#x7ED3;&#x6784;&#x3001;&#x6D41;&#x7A0B;&#x548C;&#x6D3B;&#x52A8;&#x3002; &#x5728;&#x672C;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x7814;&#x7A76;&#x5FC5;&#x8981;&#x7684;&#x6587;&#x5316;&#x8F6C;&#x53D8;&#x3002;</p>
<h2 id="&#x4ECE;&#x4FE1;&#x606F;&#x5B64;&#x5C9B;&#x5230;devops">&#x4ECE;&#x4FE1;&#x606F;&#x5B64;&#x5C9B;&#x5230;DevOps</h2>
<p>&#x4F01;&#x4E1A;IT&#x901A;&#x5E38;&#x88AB;&#x7EC4;&#x7EC7;&#x6210;&#x4EE5;&#x4E0B;&#x8BB8;&#x591A;&#x5B64;&#x5C9B;&#xFF1A;</p>
<ul>
<li>&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;</li>
<li>&#x8D28;&#x91CF;&#x4FDD;&#x8BC1;</li>
<li>&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;</li>
<li>&#x7CFB;&#x7EDF;&#x7BA1;&#x7406;</li>
<li>IT&#x8FD0;&#x8425;</li>
<li>&#x53D1;&#x5E03;&#x7BA1;&#x7406;</li>
<li>&#x9879;&#x76EE;&#x7BA1;&#x7406;</li>
</ul>
<p>&#x521B;&#x5EFA;&#x8FD9;&#x4E9B;&#x5B64;&#x5C9B;&#x662F;&#x4E3A;&#x4E86;&#x8BA9;&#x90A3;&#x4E9B;&#x4E86;&#x89E3;&#x7279;&#x5B9A;&#x9886;&#x57DF;&#x7684;&#x4EBA;&#x5458;&#x6765;&#x7BA1;&#x7406;&#x548C;&#x6307;&#x5BFC;&#x90A3;&#x4E9B;&#x6267;&#x884C;&#x8BE5;&#x4E13;&#x4E1A;&#x9886;&#x57DF;&#x5DE5;&#x4F5C;&#x7684;&#x4EBA;&#x5458;&#x3002; &#x8FD9;&#x4E9B;&#x5B64;&#x5C9B;&#x901A;&#x5E38;&#x5177;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x7BA1;&#x7406;&#x5C42;&#x6B21;&#xFF0C;&#x5DE5;&#x5177;&#x96C6;&#x3001;&#x6C9F;&#x901A;&#x98CE;&#x683C;&#x3001;&#x8BCD;&#x6C47;&#x8868;&#x548C;&#x6FC0;&#x52B1;&#x7ED3;&#x6784;&#x3002;&#x8FD9;&#x4E9B;&#x5DEE;&#x5F02;&#x542F;&#x53D1;&#x4E86;&#x4F01;&#x4E1A;IT&#x76EE;&#x6807;&#x7684;&#x4E0D;&#x540C;&#x8303;&#x5F0F;&#xFF0C;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x8FD9;&#x4E00;&#x76EE;&#x6807;&#x3002;</p>
<p>&#x4F46;&#x8FD9;&#x91CC;&#x9762;&#x5B58;&#x5728;&#x5F88;&#x591A;&#x77DB;&#x76FE;&#xFF0C;&#x4F8B;&#x5982;&#x5F00;&#x53D1;&#x548C;&#x8FD0;&#x7EF4;&#x5206;&#x522B;&#x5BF9;&#x8F6F;&#x4EF6;&#x53D8;&#x66F4;&#x6301;&#x6709;&#x7684;&#x89C2;&#x5FF5;&#x5C31;&#x662F;&#x4E2A;&#x7ECF;&#x5E38;&#x88AB;&#x63D0;&#x8D77;&#x7684;&#x4F8B;&#x5B50;&#x3002;&#x5F00;&#x53D1;&#x7684;&#x4EFB;&#x52A1;&#x901A;&#x5E38;&#x88AB;&#x89C6;&#x4E3A;&#x901A;&#x8FC7;&#x5F00;&#x53D1;&#x8F6F;&#x4EF6;&#x529F;&#x80FD;&#x4E3A;&#x7EC4;&#x7EC7;&#x63D0;&#x4F9B;&#x989D;&#x5916;&#x7684;&#x4EF7;&#x503C;&#x3002; &#x8FD9;&#x4E9B;&#x529F;&#x80FD;&#x672C;&#x8EAB;&#x5C31;&#x662F;&#x5411;IT&#x751F;&#x6001;&#x7CFB;&#x7EDF;&#x5F15;&#x5165;&#x53D8;&#x66F4;&#x3002; &#x6240;&#x4EE5;&#x5F00;&#x53D1;&#x7684;&#x4F7F;&#x547D;&#x53EF;&#x4EE5;&#x88AB;&#x63CF;&#x8FF0;&#x4E3A;&#x201C;&#x4EA4;&#x4ED8;&#x53D8;&#x5316;&#x201D;&#xFF0C;&#x800C;&#x4E14;&#x7ECF;&#x5E38;&#x6839;&#x636E;&#x6709;&#x591A;&#x5C11;&#x6B21;&#x53D8;&#x66F4;&#x6765;&#x8FDB;&#x884C;&#x6FC0;&#x52B1;&#x3002;</p>
<p>&#x76F8;&#x53CD;&#xFF0C;IT&#x8FD0;&#x8425;&#x7684;&#x4F7F;&#x547D;&#x53EF;&#x4EE5;&#x88AB;&#x63CF;&#x8FF0;&#x4E3A;&#x201C;&#x9632;&#x6B62;&#x53D8;&#x66F4;&#x201D;&#x3002; IT&#x8FD0;&#x8425;&#x901A;&#x5E38;&#x8D1F;&#x8D23;&#x7EF4;&#x62A4;IT&#x7CFB;&#x7EDF;&#x6240;&#x9700;&#x7684;&#x53EF;&#x7528;&#x6027;&#x3001;&#x5F39;&#x6027;&#x3001;&#x6027;&#x80FD;&#x548C;&#x8010;&#x7528;&#x6027;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4ED6;&#x4EEC;&#x7ECF;&#x5E38;&#x4EE5;&#x7EF4;&#x6301;&#x5173;&#x952E;&#x7EE9;&#x6548;&#x6307;&#x6807;&#xFF08;KPI&#xFF09;&#x6765;&#x8FDB;&#x884C;&#x6FC0;&#x52B1;&#xFF0C;&#x4F8B;&#x5982;&#x5E73;&#x5747;&#x6545;&#x969C;&#x95F4;&#x9694;&#x65F6;&#x95F4;&#xFF08;MTBF&#xFF09;&#x548C;&#x5E73;&#x5747;&#x6062;&#x590D;&#x65F6;&#x95F4;&#xFF08;MTTR&#xFF09;&#x3002;&#x4E0E;&#x8FD9;&#x4E9B;&#x63AA;&#x65BD;&#x76F8;&#x5173;&#x7684;&#x4E3B;&#x8981;&#x98CE;&#x9669;&#x56E0;&#x7D20;&#x4E4B;&#x4E00;&#x662F;&#x5728;&#x7CFB;&#x7EDF;&#x4E2D;&#x5F15;&#x5165;&#x4EFB;&#x4F55;&#x7C7B;&#x578B;&#x7684;&#x53D8;&#x66F4;&#x3002; &#x90A3;&#x4E48;&#xFF0C;&#x4E0D;&#x662F;&#x8BBE;&#x6CD5;&#x5C06;&#x5F00;&#x53D1;&#x671F;&#x671B;&#x7684;&#x53D8;&#x66F4;&#x5B89;&#x5168;&#x5730;&#x5F15;&#x5165;IT&#x751F;&#x6001;&#x7CFB;&#x7EDF;&#xFF0C;&#x800C;&#x662F;&#x901A;&#x8FC7;&#x5C06;&#x6D41;&#x7A0B;&#x653E;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x4F7F;&#x53D8;&#x66F4;&#x53D8;&#x5F97;&#x75DB;&#x82E6;&#xFF0C;&#x4ECE;&#x800C;&#x964D;&#x4F4E;&#x4E86;&#x53D8;&#x5316;&#x7387;&#x3002;</p>
<p>&#x8FD9;&#x4E9B;&#x4E0D;&#x540C;&#x7684;&#x8303;&#x5F0F;&#x663E;&#x7136;&#x5BFC;&#x81F4;&#x4E86;&#x8BB8;&#x591A;&#x989D;&#x5916;&#x7684;&#x5DE5;&#x4F5C;&#x3002;&#x9879;&#x76EE;&#x5DE5;&#x4F5C;&#x4E2D;&#x7684;&#x534F;&#x4F5C;&#x3001;&#x6C9F;&#x901A;&#x548C;&#x7B80;&#x5355;&#x7684;&#x4EA4;&#x63A5;&#x53D8;&#x5F97;&#x4E4F;&#x5473;&#x548C;&#x75DB;&#x82E6;&#xFF0C;&#x6700;&#x7CDF;&#x7CD5;&#x7684;&#x662F;&#x5BFC;&#x81F4;&#x7EDD;&#x5BF9;&#x6DF7;&#x4E71;&#xFF08;&#x751A;&#x81F3;&#x662F;&#x5371;&#x9669;&#x7684;&#xFF09;&#x3002; &#x4F01;&#x4E1A;IT&#x901A;&#x5E38;&#x901A;&#x8FC7;&#x521B;&#x5EFA;&#x57FA;&#x4E8E;&#x5355;&#x636E;&#x7684;&#x7CFB;&#x7EDF;&#x548C;&#x59D4;&#x5458;&#x4F1A;&#x4F1A;&#x8BAE;&#x9A71;&#x52A8;&#x7684;&#x590D;&#x6742;&#x6D41;&#x7A0B;&#x6765;&#x5C1D;&#x8BD5;&#x201C;&#x4FEE;&#x590D;&#x201D;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x3002;&#x4F01;&#x4E1A;IT&#x4EF7;&#x503C;&#x6D41;&#x5728;&#x6240;&#x6709;&#x975E;&#x589E;&#x503C;&#x6D6A;&#x8D39;&#x4E0B;&#x6B65;&#x5C65;&#x7792;&#x73CA;&#x3002;</p>
<p>&#x50CF;&#x8FD9;&#x6837;&#x7684;&#x73AF;&#x5883;&#x4E0E;&#x4E91;&#x539F;&#x751F;&#x7684;&#x901F;&#x5EA6;&#x601D;&#x60F3;&#x80CC;&#x9053;&#x800C;&#x9A70;&#x3002; &#x4E13;&#x4E1A;&#x7684;&#x4FE1;&#x606F;&#x5B64;&#x5C9B;&#x548C;&#x6D41;&#x7A0B;&#x5F80;&#x5F80;&#x662F;&#x7531;&#x521B;&#x9020;&#x5B89;&#x5168;&#x73AF;&#x5883;&#x7684;&#x613F;&#x671B;&#x6240;&#x9A71;&#x52A8;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x4ED6;&#x4EEC;&#x901A;&#x5E38;&#x63D0;&#x4F9B;&#x5F88;&#x5C11;&#x7684;&#x9644;&#x52A0;&#x5B89;&#x5168;&#x6027;&#xFF0C;&#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F1A;&#x4F7F;&#x4E8B;&#x60C5;&#x53D8;&#x5F97;&#x66F4;&#x7CDF;&#xFF01;</p>
<p>&#x5728;&#x5176;&#x6838;&#x5FC3;&#x4E0A;&#xFF0C;DevOps&#x4EE3;&#x8868;&#x7740;&#x8FD9;&#x6837;&#x4E00;&#x79CD;&#x601D;&#x60F3;&#xFF0C;&#x5373;&#x5C06;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x5B64;&#x5C9B;&#x6784;&#x5EFA;&#x6210;&#x5171;&#x4EAB;&#x7684;&#x5DE5;&#x5177;&#x96C6;&#x3001;&#x8BCD;&#x6C47;&#x8868;&#x548C;&#x6C9F;&#x901A;&#x7ED3;&#x6784;&#xFF0C;&#x4EE5;&#x670D;&#x52A1;&#x4E8E;&#x4E13;&#x6CE8;&#x4E8E;&#x5355;&#x4E00;&#x76EE;&#x6807;&#x7684;&#x6587;&#x5316;&#xFF1A;&#x5FEB;&#x901F;&#x3001;&#x5B89;&#x5168;&#x5F97;&#x4EA4;&#x4ED8;&#x4EF7;&#x503C;&#x3002; &#x7136;&#x540E;&#x521B;&#x5EFA;&#x6FC0;&#x52B1;&#x7ED3;&#x6784;&#xFF0C;&#x5F3A;&#x5236;&#x548C;&#x5956;&#x52B1;&#x9886;&#x5BFC;&#x7EC4;&#x7EC7;&#x671D;&#x7740;&#x8FD9;&#x4E00;&#x76EE;&#x6807;&#x8FC8;&#x8FDB;&#x7684;&#x884C;&#x4E3A;&#x3002; &#x5B98;&#x50DA;&#x4E3B;&#x4E49;&#x548C;&#x6D41;&#x7A0B;&#x88AB;&#x4FE1;&#x4EFB;&#x548C;&#x8D23;&#x4EFB;&#x6240;&#x53D6;&#x4EE3;&#x3002;</p>
<p>&#x5728;&#x8FD9;&#x4E2A;&#x65B0;&#x7684;&#x4E16;&#x754C;&#x4E2D;&#xFF0C;&#x5F00;&#x53D1;&#x548C;IT&#x8FD0;&#x8425;&#x90E8;&#x95E8;&#x5411;&#x5171;&#x540C;&#x7684;&#x76F4;&#x63A5;&#x9886;&#x5BFC;&#x8005;&#x6C47;&#x62A5;&#xFF0C;&#x5E76;&#x8FDB;&#x884C;&#x5408;&#x4F5C;&#xFF0C;&#x5BFB;&#x627E;&#x80FD;&#x591F;&#x6301;&#x7EED;&#x63D0;&#x4F9B;&#x4EF7;&#x503C;&#x5E76;&#x83B7;&#x5F97;&#x671F;&#x671B;&#x7684;&#x53EF;&#x7528;&#x6027;&#x3001;&#x5F39;&#x6027;&#x3001;&#x6027;&#x80FD;&#x548C;&#x8010;&#x4E45;&#x6027;&#x6C34;&#x5E73;&#x7684;&#x5B9E;&#x8DF5;&#x3002;&#x4ECA;&#x5929;&#xFF0C;&#x8FD9;&#x4E9B;&#x5BF9;&#x80CC;&#x666F;&#x654F;&#x611F;&#x7684;&#x505A;&#x6CD5;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x5730;&#x5305;&#x62EC;&#x91C7;&#x7528;&#x4E91;&#x539F;&#x751F;&#x5E94;&#x7528;&#x67B6;&#x6784;&#xFF0C;&#x63D0;&#x4F9B;&#x5B8C;&#x6210;&#x7EC4;&#x7EC7;&#x7684;&#x65B0;&#x7684;&#x5171;&#x540C;&#x76EE;&#x6807;&#x6240;&#x9700;&#x7684;&#x6280;&#x672F;&#x652F;&#x6301;&#x3002;</p>
<h2 id="&#x4ECE;&#x95F4;&#x65AD;&#x5747;&#x8861;&#x5230;&#x6301;&#x7EED;&#x4EA4;&#x4ED8;">&#x4ECE;&#x95F4;&#x65AD;&#x5747;&#x8861;&#x5230;&#x6301;&#x7EED;&#x4EA4;&#x4ED8;</h2>
<p>&#x4F01;&#x4E1A;&#x7ECF;&#x5E38;&#x91C7;&#x7528;&#x654F;&#x6377;&#x6D41;&#x7A0B;&#xFF0C;&#x5982;Scrum&#xFF0C;&#x4F46;&#x662F;&#x53EA;&#x80FD;&#x4F5C;&#x4E3A;&#x5F00;&#x53D1;&#x56E2;&#x961F;&#x5185;&#x90E8;&#x7684;&#x672C;&#x5730;&#x4F18;&#x5316;&#x3002;</p>
<p>&#x5728;&#x8FD9;&#x4E2A;&#x884C;&#x4E1A;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5B9E;&#x9645;&#x4E0A;&#x5DF2;&#x7ECF;&#x6210;&#x529F;&#x5730;&#x5C06;&#x4E2A;&#x522B;&#x5F00;&#x53D1;&#x56E2;&#x961F;&#x8F6C;&#x53D8;&#x4E3A;&#x66F4;&#x7075;&#x6D3B;&#x7684;&#x5DE5;&#x4F5C;&#x65B9;&#x5F0F;&#x3002; &#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x5F00;&#x59CB;&#x9879;&#x76EE;&#xFF0C;&#x64B0;&#x5199;&#x7528;&#x6237;&#x6545;&#x4E8B;&#xFF0C;&#x5E76;&#x6267;&#x884C;&#x654F;&#x6377;&#x5F00;&#x53D1;&#x7684;&#x6240;&#x6709;&#x4F8B;&#x7A0B;&#xFF0C;&#x5982;&#x8FED;&#x4EE3;&#x8BA1;&#x5212;&#x4F1A;&#x8BAE;&#xFF0C;&#x65E5;&#x5E38;&#x7AD9;&#x4F1A;&#xFF0C;&#x56DE;&#x987E;&#x548C;&#x5BA2;&#x6237;&#x5C55;&#x793A;demo&#x3002; &#x6211;&#x4EEC;&#x4E2D;&#x7684;&#x5192;&#x9669;&#x8005;&#x751A;&#x81F3;&#x53EF;&#x80FD;&#x4F1A;&#x5192;&#x9669;&#x8FDB;&#x884C;&#x5DE5;&#x7A0B;&#x5B9E;&#x8DF5;&#xFF0C;&#x5982;&#x7ED3;&#x5BF9;&#x7F16;&#x7A0B;&#x548C;&#x6D4B;&#x8BD5;&#x9A71;&#x52A8;&#x5F00;&#x53D1;&#x3002;&#x6301;&#x7EED;&#x96C6;&#x6210;&#xFF0C;&#x8FD9;&#x5728;&#x4EE5;&#x524D;&#x662F;&#x4E00;&#x4E2A;&#x76F8;&#x5F53;&#x6FC0;&#x8FDB;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x73B0;&#x5728;&#x5DF2;&#x7ECF;&#x6210;&#x4E3A;&#x4F01;&#x4E1A;&#x8F6F;&#x4EF6;&#x8BCD;&#x5178;&#x7684;&#x6807;&#x51C6;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x6211;&#x5DF2;&#x7ECF;&#x662F;&#x51E0;&#x4E2A;&#x4F01;&#x4E1A;&#x8F6F;&#x4EF6;&#x56E2;&#x961F;&#x4E2D;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x5E76;&#x5EFA;&#x7ACB;&#x4E86;&#x9AD8;&#x5EA6;&#x4F18;&#x5316;&#x7684;&#x201C;&#x6545;&#x4E8B;&#x5230;&#x6F14;&#x793A;&#x201D;&#x5468;&#x671F;&#xFF0C;&#x6BCF;&#x4E2A;&#x5F00;&#x53D1;&#x8FED;&#x4EE3;&#x7684;&#x7ED3;&#x679C;&#x5728;&#x5BA2;&#x6237;&#x6F14;&#x793A;&#x671F;&#x95F4;&#x88AB;&#x70ED;&#x70C8;&#x63A5;&#x53D7;&#x3002;</p>
<p>&#x4F46;&#x662F;&#xFF0C;&#x8FD9;&#x4E9B;&#x56E2;&#x961F;&#x4F1A;&#x9047;&#x5230;&#x53EF;&#x6015;&#x7684;&#x95EE;&#x9898;&#xFF1A;&#x6211;&#x4EEC;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x53EF;&#x4EE5;&#x5728;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x4E2D;&#x770B;&#x5230;&#x8FD9;&#x4E9B;&#x529F;&#x80FD;&#xFF1F;</p>
<p>&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x6211;&#x4EEC;&#x5F88;&#x96BE;&#x56DE;&#x7B54;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x8FEB;&#x4F7F;&#x6211;&#x4EEC;&#x8003;&#x8651;&#x81EA;&#x5DF1;&#x65E0;&#x6CD5;&#x63A7;&#x5236;&#x7684;&#x529B;&#x91CF;&#xFF1A;</p>
<ul>
<li>&#x6211;&#x4EEC;&#x9700;&#x8981;&#x591A;&#x957F;&#x65F6;&#x95F4;&#x624D;&#x80FD;&#x6D4F;&#x89C8;&#x72EC;&#x7ACB;&#x7684;&#x8D28;&#x91CF;&#x4FDD;&#x8BC1;&#x6D41;&#x7A0B;&#xFF1F;</li>
<li>&#x6211;&#x4EEC;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x53EF;&#x4EE5;&#x52A0;&#x5165;&#x751F;&#x4EA7;&#x53D1;&#x5E03;&#x7684;&#x884C;&#x5217;&#x4E2D;&#xFF1F;</li>
<li>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8BA9;IT&#x8FD0;&#x8425;&#x53CA;&#x65F6;&#x4E3A;&#x6211;&#x4EEC;&#x63D0;&#x4F9B;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x5417;&#xFF1F;</li>
</ul>
<p>&#x5728;&#x8FD9;&#x4E00;&#x70B9;&#x4E0A;&#xFF0C;&#x6211;&#x4EEC;&#x610F;&#x8BC6;&#x5230;&#x81EA;&#x5DF1;&#x5DF2;&#x7ECF;&#x9677;&#x5165;&#x4E86;&#x6234;&#x7EF4;&#xB7;&#x97E6;&#x65AF;&#x7279;&#x54C8;&#x65AF;&#xFF08;Dave Westhas&#xFF09;&#x6240;&#x8BF4;&#x7684;scrum&#x7011;&#x5E03;&#x4E2D;&#x4E86;&#x3002; &#x6211;&#x4EEC;&#x7684;&#x56E2;&#x961F;&#x5DF2;&#x7ECF;&#x5F00;&#x59CB;&#x63A5;&#x53D7;&#x654F;&#x6377;&#x539F;&#x5219;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x7684;&#x7EC4;&#x7EC7;&#x5374;&#x6CA1;&#x6709;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x4E0D;&#x662F;&#x6BCF;&#x6B21;&#x8FED;&#x4EE3;&#x4EA7;&#x751F;&#x4E00;&#x6B21;&#x751F;&#x4EA7;&#x90E8;&#x7F72;&#xFF08;&#x8FD9;&#x662F;&#x654F;&#x6377;&#x5BA3;&#x8A00;&#x7684;&#x539F;&#x59CB;&#x51FA;&#x53D1;&#x70B9;&#xFF09;&#xFF0C;&#x4EE3;&#x7801;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x6279;&#x91CF;&#x53C2;&#x4E0E;&#x4E00;&#x4E2A;&#x66F4;&#x4F20;&#x7EDF;&#x7684;&#x4E0B;&#x6E38;&#x53D1;&#x5E03;&#x5468;&#x671F;&#x3002;</p>
<p>&#x8FD9;&#x79CD;&#x64CD;&#x4F5C;&#x98CE;&#x683C;&#x4EA7;&#x751F;&#x76F4;&#x63A5;&#x7684;&#x540E;&#x679C;&#x3002;&#x6211;&#x4EEC;&#x4E0D;&#x662F;&#x6BCF;&#x6B21;&#x8FED;&#x4EE3;&#x90FD;&#x5C06;&#x4EF7;&#x503C;&#x4EA4;&#x4ED8;&#x7ED9;&#x5BA2;&#x6237;&#xFF0C;&#x5E76;&#x5C06;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x53CD;&#x9988;&#x56DE;&#x5230;&#x5F00;&#x53D1;&#x56E2;&#x961F;&#xFF0C;&#x6211;&#x4EEC;&#x7EE7;&#x7EED;&#x4FDD;&#x6301;&#x201C;&#x95F4;&#x65AD;&#x5747;&#x8861;&#x201D;&#x7684;&#x4EA4;&#x4ED8;&#x65B9;&#x5F0F;&#x3002; &#x95F4;&#x65AD;&#x5747;&#x8861;&#x5B9E;&#x9645;&#x4E0A;&#x4E27;&#x5931;&#x4E86;&#x654F;&#x6377;&#x4EA4;&#x4ED8;&#x7684;&#x4E24;&#x4E2A;&#x4E3B;&#x8981;&#x4F18;&#x70B9;&#xFF1A;</p>
<ul>
<li>&#x5BA2;&#x6237;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x51E0;&#x5468;&#x7684;&#x65F6;&#x95F4;&#x624D;&#x80FD;&#x770B;&#x5230;&#x8F6F;&#x4EF6;&#x5E26;&#x6765;&#x7684;&#x65B0;&#x4EF7;&#x503C;&#x3002; &#x4ED6;&#x4EEC;&#x8BA4;&#x4E3A;&#xFF0C;&#x8FD9;&#x79CD;&#x65B0;&#x7684;&#x654F;&#x6377;&#x5DE5;&#x4F5C;&#x65B9;&#x5F0F;&#x53EA;&#x662F;&#x201C;&#x50CF;&#x5F80;&#x5E38;&#x4E00;&#x6837;&#x201D;&#xFF0C;&#x4E0D;&#x4F1A;&#x589E;&#x5F3A;&#x5BF9;&#x5F00;&#x53D1;&#x56E2;&#x961F;&#x7684;&#x4FE1;&#x4EFB;&#x3002; &#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x6CA1;&#x6709;&#x770B;&#x5230;&#x53EF;&#x9760;&#x7684;&#x4EA4;&#x4ED8;&#x8282;&#x594F;&#xFF0C;&#x4ED6;&#x4EEC;&#x56DE;&#x5230;&#x4E86;&#x4EE5;&#x524D;&#x7684;&#x5957;&#x8DEF;&#x5C06;&#x5C3D;&#x53EF;&#x80FD;&#x591A;&#x7684;&#x8981;&#x6C42;&#x5C3D;&#x53EF;&#x80FD;&#x591A;&#x5730;&#x5806;&#x653E;&#x5230;&#x53D1;&#x5E03;&#x7248;&#x4E0A;&#x3002; &#x4E3A;&#x4EC0;&#x4E48;&#xFF1F; &#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x5BF9;&#x8F6F;&#x4EF6;&#x80FD;&#x591F;&#x5F88;&#x5FEB;&#x53D1;&#x5E03;&#x6CA1;&#x6709;&#x4FE1;&#x5FC3;&#xFF0C;&#x4ED6;&#x4EEC;&#x5E0C;&#x671B;&#x5C3D;&#x53EF;&#x80FD;&#x591A;&#x7684;&#x4EF7;&#x503C;&#x88AB;&#x5305;&#x62EC;&#x5728;&#x6700;&#x7EC8;&#x4EA4;&#x4ED8;&#x65F6;&#x3002;</li>
<li>&#x5F00;&#x53D1;&#x56E2;&#x961F;&#x53EF;&#x80FD;&#x4F1A;&#x597D;&#x51E0;&#x5468;&#x90FD;&#x6CA1;&#x6709;&#x5F97;&#x5230;&#x771F;&#x6B63;&#x7684;&#x53CD;&#x9988;&#x3002;&#x867D;&#x7136;&#x6F14;&#x793A;&#x5F88;&#x68D2;&#xFF0C;&#x4F46;&#x4EFB;&#x4F55;&#x7ECF;&#x9A8C;&#x4E30;&#x5BCC;&#x7684;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x90FD;&#x77E5;&#x9053;&#xFF0C;&#x53EA;&#x6709;&#x771F;&#x5B9E;&#x7528;&#x6237;&#x53C2;&#x4E0E;&#x5230;&#x8F6F;&#x4EF6;&#x4E4B;&#x4E2D;&#x624D;&#x80FD;&#x83B7;&#x5F97;&#x6700;&#x4F73;&#x53CD;&#x9988;&#x3002;&#x8FD9;&#x4E9B;&#x53CD;&#x9988;&#x80FD;&#x591F;&#x5E2E;&#x52A9;&#x8F6F;&#x4EF6;&#x4FEE;&#x6B63;&#xFF0C;&#x4F7F;&#x56E2;&#x961F;&#x53BB;&#x505A;&#x6B63;&#x786E;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x53CD;&#x9988;&#x63A8;&#x8FDF;&#x540E;&#xFF0C;&#x9519;&#x8BEF;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x53EA;&#x80FD;&#x589E;&#x52A0;&#xFF0C;&#x5E76;&#x5E26;&#x6765;&#x6602;&#x8D35;&#x7684;&#x8FD4;&#x5DE5;&#x3002;</li>
</ul>
<p>&#x83B7;&#x5F97;&#x4E91;&#x539F;&#x751F;&#x5E94;&#x7528;&#x67B6;&#x6784;&#x7684;&#x597D;&#x5904;&#x9700;&#x8981;&#x6211;&#x4EEC;&#x8F6C;&#x53D8;&#x4E3A;&#x6301;&#x7EED;&#x4EA4;&#x4ED8;&#x3002; &#x6211;&#x4EEC;&#x62E5;&#x62B1;&#x7AEF;&#x5230;&#x7AEF;&#x62E5;&#x62B1;&#x4EF7;&#x503C;&#x7684;&#x539F;&#x5219;&#xFF0C;&#x800C;&#x4E0D;&#x662F;Water Scrum Fall&#x7EC4;&#x7EC7;&#x9A71;&#x52A8;&#x7684;&#x95F4;&#x65AD;&#x5E73;&#x8861;&#x3002;&#x8BBE;&#x60F3;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x751F;&#x547D;&#x5468;&#x671F;&#x7684;&#x6A21;&#x578B;&#x662F;&#x7531;Mary&#x548C;Tom Poppendieck&#x5728;&#x300A;&#x5B9E;&#x65BD;&#x7CBE;&#x76CA;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#xFF08;Addison-Wesley&#xFF09;&#x300B;&#x4E00;&#x4E66;&#x4E2D;&#x63CF;&#x8FF0;&#x7684;&#x201C;&#x6982;&#x5FF5;&#x5230;&#x73B0;&#x91D1;&#x201D;&#x7684;&#x60F3;&#x6CD5;&#x4E2D;&#x63D0;&#x51FA;&#x6765;&#x7684;&#x3002; &#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x8003;&#x8651;&#x4E86;&#x6240;&#x6709;&#x5FC5;&#x8981;&#x7684;&#x6D3B;&#x52A8;&#xFF0C;&#x5C06;&#x4E1A;&#x52A1;&#x60F3;&#x6CD5;&#x4ECE;&#x6982;&#x5FF5;&#x4F20;&#x9012;&#x5230;&#x521B;&#x9020;&#x5229;&#x6DA6;&#x7684;&#x89D2;&#x5EA6;&#xFF0C;&#x5E76;&#x6784;&#x5EFA;&#x53EF;&#x4EE5;&#x4F7F;&#x4EBA;&#x4EEC;&#x548C;&#x8FC7;&#x7A0B;&#x8FBE;&#x5230;&#x6700;&#x4F73;&#x76EE;&#x6807;&#x7684;&#x4EF7;&#x503C;&#x6D41;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x6280;&#x672F;&#x4E0A;&#x652F;&#x6301;&#x8FD9;&#x79CD;&#x4F7F;&#x7528;&#x8FDE;&#x7EED;&#x4EA4;&#x4ED8;&#x7684;&#x5DE5;&#x7A0B;&#x5B9E;&#x8DF5;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x6BCF;&#x6B21;&#x8FED;&#x4EE3;&#xFF08;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x6B21;&#x6BCF;&#x4E2A;&#x6E90;&#x4EE3;&#x7801;&#x63D0;&#x4EA4;&#xFF01;&#xFF09;&#x90FD;&#x88AB;&#x8BC1;&#x660E;&#x53EF;&#x4EE5;&#x4EE5;&#x81EA;&#x52A8;&#x5316;&#x7684;&#x65B9;&#x5F0F;&#x90E8;&#x7F72;&#x3002; &#x6211;&#x4EEC;&#x6784;&#x5EFA;&#x90E8;&#x7F72;&#x6D41;&#x6C34;&#x7EBF;&#xFF0C;&#x53EF;&#x81EA;&#x52A8;&#x6267;&#x884C;&#x6BCF;&#x6B21;&#x6D4B;&#x8BD5;&#xFF0C;&#x5982;&#x679C;&#x8BE5;&#x6D4B;&#x8BD5;&#x5931;&#x8D25;&#xFF0C;&#x5C06;&#x4F1A;&#x963B;&#x6B62;&#x751F;&#x4EA7;&#x90E8;&#x7F72;&#x3002; &#x552F;&#x4E00;&#x5269;&#x4E0B;&#x7684;&#x51B3;&#x5B9A;&#x662F;&#x5546;&#x4E1A;&#x51B3;&#x7B56;&#xFF1A;&#x73B0;&#x5728;&#x90E8;&#x7F72;&#x53EF;&#x7528;&#x7684;&#x65B0;&#x529F;&#x80FD;&#x6709;&#x5F88;&#x597D;&#x7684;&#x4E1A;&#x52A1;&#x610F;&#x4E49;&#x5417;&#xFF1F; &#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x77E5;&#x9053;&#x5B83;&#x5DF2;&#x7ECF;&#x5982;&#x5E7F;&#x544A;&#x4E2D;&#x7684;&#x65B9;&#x5F0F;&#x5DE5;&#x4F5C;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x8981;&#x73B0;&#x5728;&#x5C31;&#x628A;&#x5B83;&#x4EEC;&#x4EA4;&#x7ED9;&#x5BA2;&#x6237;&#x5417;&#xFF1F; &#x56E0;&#x4E3A;&#x90E8;&#x7F72;&#x7BA1;&#x9053;&#x662F;&#x5B8C;&#x5168;&#x81EA;&#x52A8;&#x5316;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x4F01;&#x4E1A;&#x80FD;&#x591F;&#x901A;&#x8FC7;&#x70B9;&#x51FB;&#x6309;&#x94AE;&#x6765;&#x51B3;&#x5B9A;&#x662F;&#x5426;&#x91C7;&#x53D6;&#x884C;&#x52A8;&#x3002;</p>
<h2 id="&#x4ECE;&#x96C6;&#x4E2D;&#x6CBB;&#x7406;&#x5230;&#x5206;&#x6563;&#x81EA;&#x6CBB;">&#x4ECE;&#x96C6;&#x4E2D;&#x6CBB;&#x7406;&#x5230;&#x5206;&#x6563;&#x81EA;&#x6CBB;</h2>
<p>Waterscrumfall&#x6587;&#x5316;&#x4E2D;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x5DF2;&#x7ECF;&#x88AB;&#x7279;&#x522B;&#x63D0;&#x53CA;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5DF2;&#x7ECF;&#x88AB;&#x89C6;&#x4E3A;&#x4E91;&#x539F;&#x751F;&#x67B6;&#x6784;&#x91C7;&#x7EB3;&#x7684;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x3002;</p>
<p>&#x4F01;&#x4E1A;&#x901A;&#x5E38;&#x91C7;&#x7528;&#x56F4;&#x7ED5;&#x5E94;&#x7528;&#x67B6;&#x6784;&#x548C;&#x6570;&#x636E;&#x7BA1;&#x7406;&#x7684;&#x96C6;&#x4E2D;&#x6CBB;&#x7406;&#x7ED3;&#x6784;&#xFF0C;&#x8D1F;&#x8D23;&#x7EF4;&#x62A4;&#x6307;&#x5BFC;&#x65B9;&#x9488;&#x548C;&#x6807;&#x51C6;&#x7684;&#x59D4;&#x5458;&#x4F1A;&#xFF0C;&#x4EE5;&#x53CA;&#x6279;&#x51C6;&#x4E2A;&#x4EBA;&#x8BBE;&#x8BA1;&#x548C;&#x53D8;&#x66F4;&#x3002; &#x96C6;&#x4E2D;&#x6CBB;&#x7406;&#x65E8;&#x5728;&#x5E2E;&#x52A9;&#x89E3;&#x51B3;&#x4EE5;&#x4E0B;&#x51E0;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;</p>
<ul>
<li>&#x53EF;&#x4EE5;&#x9632;&#x6B62;&#x6280;&#x672F;&#x6808;&#x7684;&#x5927;&#x8303;&#x56F4;&#x4E0D;&#x4E00;&#x81F4;&#xFF0C;&#x964D;&#x4F4E;&#x7EC4;&#x7EC7;&#x7684;&#x6574;&#x4F53;&#x7EF4;&#x62A4;&#x8D1F;&#x62C5;&#x3002;</li>
<li>&#x53EF;&#x4EE5;&#x9632;&#x6B62;&#x67B6;&#x6784;&#x9009;&#x578B;&#x4E2D;&#x7684;&#x5927;&#x8303;&#x56F4;&#x4E0D;&#x4E00;&#x81F4;&#xFF0C;&#x4ECE;&#x800C;&#x5F62;&#x6210;&#x7EC4;&#x7EC7;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5F00;&#x53D1;&#x7684;&#x5171;&#x540C;&#x89C2;&#x70B9;&#x3002;</li>
<li>&#x6574;&#x4E2A;&#x7EC4;&#x7EC7;&#x53EF;&#x4EE5;&#x4E00;&#x81F4;&#x5730;&#x5904;&#x7406;&#x8DE8;&#x90E8;&#x95E8;&#x5173;&#x5207;&#xFF0C;&#x4F8B;&#x5982;&#x5408;&#x89C4;&#x6027;&#x3002;</li>
<li>&#x6570;&#x636E;&#x6240;&#x6709;&#x6743;&#x53EF;&#x7531;&#x5177;&#x6709;&#x5168;&#x5C40;&#x89C6;&#x91CE;&#x7684;&#x4EBA;&#x6765;&#x51B3;&#x5B9A;&#x3002;</li>
</ul>
<p>&#x4E4B;&#x6240;&#x4EE5;&#x521B;&#x9020;&#x8FD9;&#x4E9B;&#x7ED3;&#x6784;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x76F8;&#x4FE1;&#x5B83;&#x4EEC;&#x5C06;&#x6709;&#x52A9;&#x4E8E;&#x63D0;&#x9AD8;&#x8D28;&#x91CF;&#x3001;&#x964D;&#x4F4E;&#x6210;&#x672C;&#x6216;&#x4E24;&#x8005;&#x517C;&#x800C;&#x6709;&#x4E4B;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x8FD9;&#x4E9B;&#x7ED3;&#x6784;&#x5F88;&#x5C11;&#x80FD;&#x591F;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x63D0;&#x9AD8;&#x8D28;&#x91CF;&#x8282;&#x7EA6;&#x6210;&#x672C;&#xFF0C;&#x5E76;&#x4E14;&#x8FDB;&#x4E00;&#x6B65;&#x59A8;&#x788D;&#x4E86;&#x4E91;&#x539F;&#x751F;&#x5E94;&#x7528;&#x67B6;&#x6784;&#x5BFB;&#x6C42;&#x7684;&#x4EA4;&#x4ED8;&#x901F;&#x5EA6;&#x3002; &#x6B63;&#x5982;&#x5355;&#x4F53;&#x5E94;&#x7528;&#x67B6;&#x6784;&#x5BFC;&#x81F4;&#x4E86;&#x9650;&#x5236;&#x6280;&#x672F;&#x521B;&#x65B0;&#x901F;&#x5EA6;&#x7684;&#x74F6;&#x9888;&#x4E00;&#x6837;&#xFF0C;&#x5355;&#x4E00;&#x7684;&#x6CBB;&#x7406;&#x7ED3;&#x6784;&#x540C;&#x6837;&#x5982;&#x6B64;&#x3002;&#x67B6;&#x6784;&#x59D4;&#x5458;&#x4F1A;&#x7ECF;&#x5E38;&#x53EA;&#x4F1A;&#x5B9A;&#x671F;&#x53EC;&#x96C6;&#xFF0C;&#x5E76;&#x4E14;&#x7ECF;&#x5E38;&#x9700;&#x8981;&#x5F88;&#x957F;&#x7684;&#x7B49;&#x5F85;&#x65F6;&#x624D;&#x80FD;&#x53D1;&#x6325;&#x5DE5;&#x4F5C;&#x3002;&#x5373;&#x4F7F;&#x662F;&#x5F88;&#x5C0F;&#x7684;&#x6570;&#x636E;&#x6A21;&#x578B;&#x7684;&#x53D8;&#x5316;&#x2014;&#x2014;&#x53EF;&#x80FD;&#x5728;&#x51E0;&#x5206;&#x949F;&#x6216;&#x51E0;&#x4E2A;&#x5C0F;&#x65F6;&#x5185;&#x5B8C;&#x6210;&#x7684;&#x66F4;&#x6539;&#xFF0C;&#x5373;&#x5C06;&#x88AB;&#x59D4;&#x5458;&#x4F1A;&#x6279;&#x51C6;&#x7684;&#x53D8;&#x66F4;&#x2014;&#x2014;&#x5C06;&#x4F1A;&#x628A;&#x65F6;&#x95F4;&#x6D6A;&#x8D39;&#x5728;&#x4E00;&#x4E2A;&#x4E0D;&#x65AD;&#x589E;&#x957F;&#x7684;&#x5F85;&#x529E;&#x4E8B;&#x9879;&#x4E2D;&#x3002;</p>
<p>&#x91C7;&#x7528;&#x4E91;&#x539F;&#x751F;&#x5E94;&#x7528;&#x67B6;&#x6784;&#x65F6;&#x901A;&#x5E38;&#x90FD;&#x4F1A;&#x4E0E;&#x5206;&#x6563;&#x5F0F;&#x6CBB;&#x7406;&#x7ED3;&#x5408;&#x8D77;&#x6765;&#x3002;&#x5EFA;&#x7ACB;&#x4E91;&#x539F;&#x751F;&#x5E94;&#x7528;&#x7684;&#x56E2;&#x961F;&#x62E5;&#x6709;&#x4ED6;&#x4EEC;&#x8D1F;&#x8D23;&#x4EA4;&#x4ED8;&#x7684;&#x80FD;&#x529B;&#x7684;&#x6240;&#x6709;&#x65B9;&#x9762;&#x3002;&#x4ED6;&#x4EEC;&#x62E5;&#x6709;&#x548C;&#x7BA1;&#x7406;&#x6570;&#x636E;&#x3001;&#x6280;&#x672F;&#x6808;&#x3001;&#x5E94;&#x7528;&#x67B6;&#x6784;&#x3001;&#x6BCF;&#x4E2A;&#x7EC4;&#x4EF6;&#x8BBE;&#x8BA1;&#x548C;API&#x534F;&#x8BAE;&#x5E76;&#x5C06;&#x5B83;&#x4EEC;&#x4EA4;&#x4ED8;&#x7ED9;&#x7EC4;&#x7EC7;&#x7684;&#x5176;&#x4F59;&#x90E8;&#x5206;&#x3002;&#x5982;&#x679C;&#x9700;&#x8981;&#x5BF9;&#x67D0;&#x4E8B;&#x4F5C;&#x51FA;&#x51B3;&#x7B56;&#xFF0C;&#x5219;&#x7531;&#x56E2;&#x961F;&#x81EA;&#x4E3B;&#x5236;&#x5B9A;&#x548C;&#x6267;&#x884C;&#x3002;</p>
<p>&#x56E2;&#x961F;&#x4E2A;&#x4F53;&#x7684;&#x5206;&#x6563;&#x81EA;&#x6CBB;&#x548C;&#x81EA;&#x4E3B;&#x6027;&#x662F;&#x901A;&#x8FC7;&#x6700;&#x5C0F;&#x5316;&#x3001;&#x8F7B;&#x91CF;&#x7EA7;&#x7684;&#x7ED3;&#x6784;&#x8FDB;&#x884C;&#x5E73;&#x8861;&#x7684;&#xFF0C;&#x8FD9;&#x4E9B;&#x7ED3;&#x6784;&#x5728;&#x53EF;&#x72EC;&#x7ACB;&#x5F00;&#x53D1;&#x548C;&#x90E8;&#x7F72;&#x7684;&#x670D;&#x52A1;&#x4E4B;&#x95F4;&#x4F7F;&#x7528;&#x96C6;&#x6210;&#x6A21;&#x5F0F;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x4ED6;&#x4EEC;&#x66F4;&#x559C;&#x6B22;HTTP REST JSON API&#x800C;&#x4E0D;&#x662F;&#x4E0D;&#x540C;&#x98CE;&#x683C;&#x7684;RPC&#xFF09;&#x6765;&#x5B9E;&#x73B0;&#x3002;&#x8FD9;&#x4E9B;&#x7ED3;&#x6784;&#x901A;&#x5E38;&#x4F1A;&#x5728;&#x5E95;&#x5C42;&#x89E3;&#x51B3;&#x4EA4;&#x53C9;&#x95EE;&#x9898;&#xFF0C;&#x5982;&#x5BB9;&#x9519;&#x3002;&#x6FC0;&#x52B1;&#x56E2;&#x961F;&#x81EA;&#x5DF1;&#x8BBE;&#x6CD5;&#x89E3;&#x51B3;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x7136;&#x540E;&#x81EA;&#x53D1;&#x7EC4;&#x7EC7;&#x4E0E;&#x5176;&#x4ED6;&#x56E2;&#x961F;&#x4E00;&#x8D77;&#x5EFA;&#x7ACB;&#x5171;&#x540C;&#x7684;&#x6A21;&#x5F0F;&#x548C;&#x6846;&#x67B6;&#x3002;&#x968F;&#x7740;&#x6574;&#x4E2A;&#x7EC4;&#x7EC7;&#x4E2D;&#x7684;&#x6700;&#x4F18;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x51FA;&#x73B0;&#xFF0C;&#x8BE5;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x7684;&#x6240;&#x6709;&#x6743;&#x901A;&#x5E38;&#x88AB;&#x8F6C;&#x79FB;&#x5230;&#x4E91;&#x6846;&#x67B6;/&#x5DE5;&#x5177;&#x56E2;&#x961F;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x5D4C;&#x5165;&#x5230;&#x5E73;&#x53F0;&#x8FD0;&#x8425;&#x56E2;&#x961F;&#x4E2D;&#x4E5F;&#x53EF;&#x80FD;&#x4E0D;&#x4F1A;&#x3002;&#x5F53;&#x7EC4;&#x7EC7;&#x6B63;&#x5728;&#x56F4;&#x7ED5;&#x5BF9;&#x67B6;&#x6784;&#x5171;&#x8BC6;&#x8FDB;&#x884C;&#x6539;&#x9769;&#x65F6;&#xFF0C;&#x4E91;&#x6846;&#x67B6;/&#x5DE5;&#x5177;&#x56E2;&#x961F;&#x901A;&#x5E38;&#x4E5F;&#x5C06;&#x5F00;&#x521B;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002; </p>
<footer class="page-footer"><span class="copyright">Copyright &#xA9; 2017-2020 | Distributed under <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/deed.zh" target="_blank">CC BY 4.0</a> | <a href="https://jimmysong.io" target="_blank">jimmysong.io</a> all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification"> Updated at 
2019-10-13 20:17:10
</span></footer></body></html>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="changes-needed.html" class="navigation navigation-prev " aria-label="Previous page: 2. 在变革中前行">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="organizational-change.html" class="navigation navigation-next " aria-label="Next page: 2.2 组织变革">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"2.1 文化变革","level":"1.3.1","depth":2,"next":{"title":"2.2 组织变革","level":"1.3.2","depth":2,"path":"chapter2/organizational-change.md","ref":"chapter2/organizational-change.md","articles":[]},"previous":{"title":"2. 在变革中前行","level":"1.3","depth":1,"path":"chapter2/changes-needed.md","ref":"chapter2/changes-needed.md","articles":[{"title":"2.1 文化变革","level":"1.3.1","depth":2,"path":"chapter2/cultural-change.md","ref":"chapter2/cultural-change.md","articles":[]},{"title":"2.2 组织变革","level":"1.3.2","depth":2,"path":"chapter2/organizational-change.md","ref":"chapter2/organizational-change.md","articles":[]},{"title":"2.3 技术变革","level":"1.3.3","depth":2,"path":"chapter2/technical-change.md","ref":"chapter2/technical-change.md","articles":[]},{"title":"2.4 本章小结","level":"1.3.4","depth":2,"path":"chapter2/summary.md","ref":"chapter2/summary.md","articles":[]}]},"dir":"ltr"},"config":{"plugins":["github","codesnippet","splitter","page-toc-button","editlink","back-to-top-button","-lunr","-search","search-plus","github-buttons@2.1.0","favicon","tbfed-pagefooter@^0.0.1","3-ba","ga","lightbox"],"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright © 2017-2020 | Distributed under <a href=https://creativecommons.org/licenses/by-nc-sa/4.0/deed.zh>CC BY 4.0</a> | <a href=https://jimmysong.io>jimmysong.io</a>","modify_label":" Updated at ","modify_format":"YYYY-MM-DD HH:mm:ss"},"github":{"url":"https://github.com/rootsongjc/migrating-to-cloud-native-application-architectures"},"editlink":{"label":"编辑本页","multilingual":false,"base":"https://github.com/rootsongjc/migrating-to-cloud-native-application-architectures/tree/master/"},"splitter":{},"codesnippet":{},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"favicon":{"shortcut":"images/favicon.ico","bookmark":"images/favicon.ico"},"lightbox":{"jquery":true},"page-toc-button":{},"back-to-top-button":{},"github-buttons":{"repo":"rootsongjc/migrating-to-cloud-native-application-architectures","types":["star"],"size":"small"},"3-ba":{"configuration":"auto","token":"11f7d254cfa4e0ca44b175c66d379ecc"},"ga":{"configuration":"auto","token":"UA-93485976-1"},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"showLevel":false,"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"}},"search-plus":{}},"theme":"default","author":"Jimmy Song","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"迁移到云原生应用架构","language":"zh-hans","links":{"sidebar":{"回到首页":"https://jimmysong.io","云原生社区":"https://cloudnative.to"}},"gitbook":"*","description":"Migrating to Cloud Native Application Architectures 中文版"},"file":{"path":"chapter2/cultural-change.md","mtime":"2019-10-13T12:17:10.857Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-07-20T06:32:29.420Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-page-toc-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-editlink/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-plus/jquery.mark.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-plus/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-3-ba/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-ga/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lightbox/jquery.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lightbox/lightbox.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

