
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>2.2 组织变革 · 迁移到云原生应用架构</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="Jimmy Song">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-toc-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-image-captions/image-captions.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search-plus/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-lightbox/lightbox.min.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="technical-change.html" />
    
    
    <link rel="prev" href="cultural-change.html" />
    

    
        <link rel="shortcut icon" href='../images/favicon.ico' type="image/x-icon">
    
    
        <link rel="bookmark" href='../images/favicon.ico' type="image/x-icon">
    
    
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"repo":"rootsongjc/migrating-to-cloud-native-application-architectures","types":["star"],"size":"small"};
    </script>

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://jimmysong.io/posts/cloud-native-python" target="_blank" class="custom-link">Cloud Native Python（Python云原生） - 使用Python和React构建云原生应用</a>
        </li>
    
        
        <li>
            <a href="http://www.servicemesher.com" target="_blank" class="custom-link">ServiceMesher社区</a>
        </li>
    
        
        <li>
            <a href="https://github.com/alipay/sofa-mesh" target="_blank" class="custom-link">SOFAMesh - 基于Istio的大规模服务网格解决方案</a>
        </li>
    
        
        <li>
            <a href="https://jimmysong.io/posts/cloud-native-java" target="_blank" class="custom-link">Cloud Native Java（云原生Java）-  Spring Boot、Spring Cloud与Cloud Foundry弹性系统设计</a>
        </li>
    
        
        <li>
            <a href="https://github.com/alipay/sofa-mosn" target="_blank" class="custom-link">SOFAMosn - Golang版的高性能Service Mesh Sidecar代理</a>
        </li>
    
        
        <li>
            <a href="http://www.servicemesher.com/awesome-servicemesh" target="_blank" class="custom-link">Awesome Service Mesh</a>
        </li>
    
        
        <li>
            <a href="https://jimmysong.io/istio-handbook" target="_blank" class="custom-link">Istio Handbook - Istio服务网格进阶实战</a>
        </li>
    
        
        <li>
            <a href="https://jimmysong.io" target="_blank" class="custom-link">Jimmy Song</a>
        </li>
    
        
        <li>
            <a href="https://jimmysong.io/awesome-cloud-native" target="_blank" class="custom-link">Awesome Cloud Native</a>
        </li>
    
        
        <li>
            <a href="https://jimmysong.io/posts/cloud-native-go" target="_blank" class="custom-link">Cloud Native Go - 基于Go和React的web云原生应用构建指南</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../chapter1/the-rise-of-cloud-native.html">
            
                <a href="../chapter1/the-rise-of-cloud-native.html">
            
                    
                    1. 云原生的崛起
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../chapter1/why-cloud-native-application-architectures.html">
            
                <a href="../chapter1/why-cloud-native-application-architectures.html">
            
                    
                    1.1 为何使用云原生应用架构？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="../chapter1/defining-cloud-native-architectures.html">
            
                <a href="../chapter1/defining-cloud-native-architectures.html">
            
                    
                    1.2 云原生架构的定义
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="../chapter1/summary.html">
            
                <a href="../chapter1/summary.html">
            
                    
                    1.3 本章小结
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="changes-needed.html">
            
                <a href="changes-needed.html">
            
                    
                    2. 在变革中前行
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="cultural-change.html">
            
                <a href="cultural-change.html">
            
                    
                    2.1 文化变革
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3.2" data-path="organizational-change.html">
            
                <a href="organizational-change.html">
            
                    
                    2.2 组织变革
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="technical-change.html">
            
                <a href="technical-change.html">
            
                    
                    2.3 技术变革
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="summary.html">
            
                <a href="summary.html">
            
                    
                    2.4 本章小结
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../chapter3/migration-cookbook.html">
            
                <a href="../chapter3/migration-cookbook.html">
            
                    
                    3. 迁移指南
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="../chapter3/decomposition-recipes.html">
            
                <a href="../chapter3/decomposition-recipes.html">
            
                    
                    3.1 分解原架构
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="../chapter3/distributed-systems-recipes.html">
            
                <a href="../chapter3/distributed-systems-recipes.html">
            
                    
                    3.2 使用分布式系统
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="../chapter3/summary.html">
            
                <a href="../chapter3/summary.html">
            
                    
                    3.3 本章小结
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >2.2 组织变革</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div class="search-plus" id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <html><head></head><body><h1 id="&#x7EC4;&#x7EC7;&#x53D8;&#x9769;">&#x7EC4;&#x7EC7;&#x53D8;&#x9769;</h1>
<p>&#x5728;&#x672C;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x63A2;&#x8BA8;&#x91C7;&#x7528;&#x4E91;&#x539F;&#x751F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x67B6;&#x6784;&#x7684;&#x7EC4;&#x7EC7;&#x5728;&#x521B;&#x5EFA;&#x56E2;&#x961F;&#x65F6;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x7684;&#x53D8;&#x9769;&#x3002;&#x8FD9;&#x4E2A;&#x91CD;&#x7EC4;&#x80CC;&#x540E;&#x7684;&#x7406;&#x8BBA;&#x662F;&#x8457;&#x540D;&#x7684;&#x5EB7;&#x5A01;&#x5B9A;&#x5F8B;&#x3002;&#x6211;&#x4EEC;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x662F;&#x5728;&#x957F;&#x5468;&#x671F;&#x7684;&#x4EA7;&#x54C1;&#x5F00;&#x53D1;&#x4E2D;&#xFF0C;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x4E86;&#x5404;&#x65B9;&#x9762;&#x4E13;&#x4E1A;&#x5458;&#x5DE5;&#x7684;&#x56E2;&#x961F;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5C06;&#x4ED6;&#x4EEC;&#x5206;&#x79BB;&#x5728;&#x5355;&#x4E00;&#x7684;&#x56E2;&#x961F;&#x4E2D;&#xFF0C;&#x4F8B;&#x5982;&#x6D4B;&#x8BD5;&#x4EBA;&#x5458;&#x3002;</p>
<h2 id="&#x4E1A;&#x52A1;&#x80FD;&#x529B;&#x56E2;&#x961F;">&#x4E1A;&#x52A1;&#x80FD;&#x529B;&#x56E2;&#x961F;</h2>
<p>&#x8BBE;&#x8BA1;&#x7CFB;&#x7EDF;&#x7684;&#x7EC4;&#x7EC7;&#xFF0C;&#x6700;&#x7EC8;&#x4EA7;&#x751F;&#x7684;&#x8BBE;&#x8BA1;&#x7B49;&#x540C;&#x4E8E;&#x7EC4;&#x7EC7;&#x4E4B;&#x5185;&#x3001;&#x4E4B;&#x95F4;&#x7684;&#x6C9F;&#x901A;&#x7ED3;&#x6784;&#x3002;</p>
<p>&#x2014;Melvyn Conway</p>
<p>&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x8BA8;&#x8BBA;&#x4E86;&#x201C;&#x4ECE;&#x5B64;&#x5C9B;&#x5230;DevOps&#x201D;&#x5C06;IT&#x7EC4;&#x7EC7;&#x6210;&#x4E13;&#x95E8;&#x7684;&#x4FE1;&#x606F;&#x5B64;&#x5C9B;&#x7684;&#x505A;&#x6CD5;&#x3002;&#x6211;&#x4EEC;&#x5F88;&#x81EA;&#x7136;&#x5730;&#x521B;&#x9020;&#x4E86;&#x8FD9;&#x4E9B;&#x5B64;&#x5C9B;&#xFF0C;&#x5E76;&#x628A;&#x4E2A;&#x4F53;&#x653E;&#x5230;&#x4E0E;&#x8FD9;&#x4E9B;&#x5B64;&#x5C9B;&#x4E00;&#x81F4;&#x7684;&#x56E2;&#x961F;&#x4E2D;&#x3002;&#x4F46;&#x662F;&#x5F53;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x8F6F;&#x4EF6;&#x7684;&#x65F6;&#x5019;&#x4F1A;&#x600E;&#x4E48;&#x6837;&#xFF1F;</p>
<p>&#x4E00;&#x4E2A;&#x5F88;&#x5E38;&#x89C1;&#x7684;&#x505A;&#x6CD5;&#x662F;&#x6210;&#x7ACB;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x56E2;&#x961F;&#x3002;&#x8BE5;&#x56E2;&#x961F;&#x5411;&#x9879;&#x76EE;&#x7ECF;&#x7406;&#x6C47;&#x62A5;&#xFF0C;&#x7136;&#x540E;&#x9879;&#x76EE;&#x7ECF;&#x7406;&#x4E0E;&#x5404;&#x79CD;&#x5B64;&#x5C9B;&#x5408;&#x4F5C;&#xFF0C;&#x4E3A;&#x9879;&#x76EE;&#x6240;&#x9700;&#x7684;&#x5404;&#x4E2A;&#x4E13;&#x4E1A;&#x9886;&#x57DF;&#x5BFB;&#x6C42;&#x201C;&#x8D44;&#x6E90;&#x201D;&#x3002;&#x6B63;&#x5982;&#x5EB7;&#x5A01;&#x5B9A;&#x5F8B;&#x6240;&#x8A00;&#xFF0C;&#x8FD9;&#x4E9B;&#x56E2;&#x961F;&#x5C06;&#x5F88;&#x81EA;&#x7136;&#x5730;&#x5728;&#x7CFB;&#x7EDF;&#x4E2D;&#x6784;&#x7B51;&#x8D77;&#x5404;&#x79CD;&#x5B64;&#x5C9B;&#xFF0C;&#x6211;&#x4EEC;&#x6700;&#x7EC8;&#x5F97;&#x5230;&#x7684;&#x662F;&#x8054;&#x5408;&#x5404;&#x79CD;&#x5B64;&#x5C9B;&#x76F8;&#x5BF9;&#x5E94;&#x7684;&#x5B64;&#x7ACB;&#x6A21;&#x5757;&#x7684;&#x67B6;&#x6784;&#xFF1A;</p>
<ul>
<li>&#x6570;&#x636E;&#x8BBF;&#x95EE;&#x5C42;</li>
<li>&#x670D;&#x52A1;&#x5C42;</li>
<li>Web MVC&#x5C42;</li>
<li>&#x6D88;&#x606F;&#x5C42;</li>
<li>&#x7B49;&#x7B49;</li>
</ul>
<p>&#x8FD9;&#x4E9B;&#x5C42;&#x6B21;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x5C42;&#x90FD;&#x8DE8;&#x8D8A;&#x4E86;&#x591A;&#x4E2A;&#x4E1A;&#x52A1;&#x80FD;&#x529B;&#x9886;&#x57DF;&#xFF0C;&#x4F7F;&#x5F97;&#x5728;&#x5176;&#x4E4B;&#x4E0A;&#x7684;&#x521B;&#x65B0;&#x548C;&#x90E8;&#x7F72;&#x72EC;&#x7ACB;&#x4E8E;&#x5176;&#x4ED6;&#x4E1A;&#x52A1;&#x80FD;&#x529B;&#x7684;&#x65B0;&#x529F;&#x80FD;&#x53D8;&#x7684;&#x975E;&#x5E38;&#x56F0;&#x96BE;&#x3002;</p>
<p>&#x5BFB;&#x6C42;&#x8FC1;&#x79FB;&#x5230;&#x5C06;&#x4E1A;&#x52A1;&#x80FD;&#x529B;&#x5206;&#x79BB;&#x7684;&#x5FAE;&#x670D;&#x52A1;&#x7B49;&#x4E91;&#x539F;&#x751F;&#x67B6;&#x6784;&#x7684;&#x516C;&#x53F8;&#x7ECF;&#x5E38;&#x91C7;&#x7528;Thoughtworks&#x79F0;&#x4E4B;&#x4E3A;&#x7684;&#x201C;&#x9006;&#x5EB7;&#x5A01;&#x5B9A;&#x5F8B;&#x201D;&#x3002;&#x4ED6;&#x4EEC;&#x6CA1;&#x6709;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x4E0E;&#x5176;&#x7EC4;&#x7EC7;&#x7ED3;&#x6784;&#x56FE;&#x76F8;&#x5339;&#x914D;&#x7684;&#x67B6;&#x6784;&#xFF0C;&#x800C;&#x662F;&#x51B3;&#x5B9A;&#x4E86;&#x4ED6;&#x4EEC;&#x60F3;&#x8981;&#x7684;&#x67B6;&#x6784;&#xFF0C;&#x5E76;&#x91CD;&#x7EC4;&#x7EC4;&#x7EC7;&#x4EE5;&#x5339;&#x914D;&#x8BE5;&#x67B6;&#x6784;&#x3002;&#x5982;&#x679C;&#x4F60;&#x8FD9;&#x6837;&#x505A;&#x7684;&#x8BDD;&#xFF0C;&#x6839;&#x636E;&#x5EB7;&#x5A01;&#x5B9A;&#x5F8B;&#xFF0C;&#x60A8;&#x6240;&#x671F;&#x671B;&#x7684;&#x67B6;&#x6784;&#x7EC8;&#x5C06;&#x51FA;&#x73B0;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x4F5C;&#x4E3A;&#x8F6C;&#x5411;DevOps&#x6587;&#x5316;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x6211;&#x4EEC;&#x7EC4;&#x7EC7;&#x4E86;&#x8DE8;&#x804C;&#x80FD;&#x3001;&#x4E1A;&#x52A1;&#x80FD;&#x529B;&#x7684;&#x56E2;&#x961F;&#xFF0C;&#x5F00;&#x53D1;&#x7684;&#x662F;&#x4EA7;&#x54C1;&#x800C;&#x4E0D;&#x518D;&#x662F;&#x9879;&#x76EE;&#x3002;&#x5F00;&#x53D1;&#x4EA7;&#x54C1;&#x9700;&#x8981;&#x957F;&#x671F;&#x7684;&#x4ED8;&#x51FA;&#xFF0C;&#x76F4;&#x5230;&#x5B83;&#x4EEC;&#x4E0D;&#x518D;&#x4E3A;&#x4F01;&#x4E1A;&#x63D0;&#x4F9B;&#x4EF7;&#x503C;&#x4E3A;&#x6B62;&#x3002;&#xFF08;&#x76F4;&#x5230;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x4E0D;&#x518D;&#x8FD0;&#x884C;&#x5728;&#x751F;&#x4EA7;&#x4E0A;&#x4E3A;&#x6B62;&#xFF01;&#xFF09;&#x6784;&#x5EFA;&#x3001;&#x6D4B;&#x8BD5;&#x3001;&#x4EA4;&#x4ED8;&#x548C;&#x8FD0;&#x8425;&#x63D0;&#x4F9B;&#x4E1A;&#x52A1;&#x80FD;&#x529B;&#x7684;&#x670D;&#x52A1;&#x6240;&#x9700;&#x7684;&#x6240;&#x6709;&#x89D2;&#x8272;&#x90FD;&#x5B58;&#x5728;&#x4E8E;&#x4E00;&#x4E2A;&#x56E2;&#x961F;&#x4E2D;&#xFF0C;&#x8BE5;&#x56E2;&#x961F;&#x4E0D;&#x4F1A;&#x5411;&#x7EC4;&#x7EC7;&#x7684;&#x5176;&#x4ED6;&#x90E8;&#x5206;&#x4EA4;&#x63A5;&#x4EE3;&#x7801;&#x3002;&#x8FD9;&#x4E9B;&#x56E2;&#x961F;&#x901A;&#x5E38;&#x88AB;&#x7EC4;&#x7EC7;&#x4E3A;&#x201C;&#x53CC;&#x6BD4;&#x8428;&#x961F;&#x201D;&#xFF0C;&#x610F;&#x601D;&#x662F;&#x5982;&#x679C;&#x4E0D;&#x80FD;&#x7528;&#x4E24;&#x4E2A;&#x6BD4;&#x8428;&#x997C;&#x5582;&#x9971;&#xFF0C;&#x90A3;&#x5C31;&#x610F;&#x5473;&#x7740;&#x56E2;&#x961F;&#x89C4;&#x6A21;&#x592A;&#x5927;&#x4E86;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x5269;&#x4E0B;&#x7684;&#x5C31;&#x662F;&#x786E;&#x5B9A;&#x8981;&#x521B;&#x5EFA;&#x7684;&#x56E2;&#x961F;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x9075;&#x5FAA;&#x9006;&#x5EB7;&#x5A01;&#x5B9A;&#x5F8B;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4ECE;&#x7EC4;&#x7EC7;&#x7684;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x5F00;&#x59CB;&#xFF0C;&#x5E76;&#x5BFB;&#x6C42;&#x53EF;&#x4EE5;&#x5C01;&#x88C5;&#x5728;&#x6709;&#x9650;&#x73AF;&#x5883;&#x4E2D;&#x7684;&#x4E1A;&#x52A1;&#x80FD;&#x529B;&#x3002;&#x4E00;&#x65E6;&#x6211;&#x4EEC;&#x786E;&#x5B9A;&#x4E86;&#x8FD9;&#x4E9B;&#x80FD;&#x529B;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x4E3A;&#x8FD9;&#x4E9B;&#x4E1A;&#x52A1;&#x80FD;&#x529B;&#x7684;&#x6574;&#x4E2A;&#x751F;&#x547D;&#x5468;&#x671F;&#x8D1F;&#x8D23;&#x7684;&#x56E2;&#x961F;&#x3002; &#x4E1A;&#x52A1;&#x80FD;&#x529B;&#x56E2;&#x961F;&#x638C;&#x63E1;&#x5176;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4ECE;&#x5F00;&#x53D1;&#x5230;&#x8FD0;&#x8425;&#x7684;&#x6574;&#x4E2A;&#x751F;&#x547D;&#x5468;&#x671F;&#x3002;</p>
<h2 id="&#x5E73;&#x53F0;&#x8FD0;&#x8425;&#x56E2;&#x961F;">&#x5E73;&#x53F0;&#x8FD0;&#x8425;&#x56E2;&#x961F;</h2>
<p>&#x4E1A;&#x52A1;&#x80FD;&#x529B;&#x56E2;&#x961F;&#x9700;&#x8981;&#x4F9D;&#x8D56;&#x4E8E;&#x6211;&#x4EEC;&#x524D;&#x9762;&#x63D0;&#x5230;&#x7684;&#x201D;&#x81EA;&#x52A9;&#x654F;&#x6377;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x201C;&#x3002;</p>
<p>&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x6765;&#x63CF;&#x8FF0;&#x4E00;&#x79CD;&#x7279;&#x6B8A;&#x7684;&#x4E1A;&#x52A1;&#x80FD;&#x529B;&#x2014;&#x2014;&#x5F00;&#x53D1;&#x3001;&#x90E8;&#x7F72;&#x548C;&#x8FD0;&#x8425;&#x4E1A;&#x52A1;&#x7684;&#x80FD;&#x529B;&#x3002;&#x8FD9;&#x79CD;&#x80FD;&#x529B;&#x5E94;&#x8BE5;&#x662F;&#x5E73;&#x53F0;&#x8FD0;&#x8425;&#x56E2;&#x961F;&#x6240;&#x5177;&#x6709;&#x7684;&#x3002;</p>
<p>&#x5E73;&#x53F0;&#x8FD0;&#x8425;&#x56E2;&#x961F;&#x8FD0;&#x8425;&#x81EA;&#x52A9;&#x654F;&#x6377;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x5E73;&#x53F0;&#xFF0C;&#x5E76;&#x4EA4;&#x4ED8;&#x7ED9;&#x4E1A;&#x52A1;&#x80FD;&#x529B;&#x56E2;&#x961F;&#x4F7F;&#x7528;&#x3002;&#x8BE5;&#x56E2;&#x961F;&#x901A;&#x5E38;&#x5305;&#x62EC;&#x4F20;&#x7EDF;&#x7684;&#x7CFB;&#x7EDF;&#x3001;&#x7F51;&#x7EDC;&#x548C;&#x5B58;&#x50A8;&#x7BA1;&#x7406;&#x5458;&#x89D2;&#x8272;&#x3002;&#x5982;&#x679C;&#x516C;&#x53F8;&#x6B63;&#x5728;&#x8FD0;&#x8425;&#x4E91;&#x5E73;&#x53F0;&#xFF0C;&#x8BE5;&#x56E2;&#x961F;&#x4E5F;&#x5C06;&#x62E5;&#x6709;&#x7BA1;&#x7406;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x7684;&#x56E2;&#x961F;&#x6216;&#x4E0E;&#x4ED6;&#x4EEC;&#x7D27;&#x5BC6;&#x5408;&#x4F5C;&#xFF0C;&#x5E76;&#x4E86;&#x89E3;&#x63D0;&#x4F9B;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x5E73;&#x53F0;&#x6240;&#x9700;&#x7684;&#x786C;&#x4EF6;&#x80FD;&#x529B;&#x3002;</p>
<p>IT&#x8FD0;&#x8425;&#x4F20;&#x7EDF;&#x4E0A;&#x901A;&#x8FC7;&#x5404;&#x79CD;&#x57FA;&#x4E8E;&#x5355;&#x636E;&#x7684;&#x7CFB;&#x7EDF;&#x4E0E;&#x5BA2;&#x6237;&#x8FDB;&#x884C;&#x4E92;&#x52A8;&#x3002;&#x7531;&#x4E8E;&#x57FA;&#x4E8E;&#x5E73;&#x53F0;&#x64CD;&#x4F5C;&#x6D41;&#x6765;&#x8FD0;&#x884C;&#x81EA;&#x52A9;&#x670D;&#x52A1;&#x5E73;&#x53F0;&#xFF0C;&#x56E0;&#x6B64;&#x5FC5;&#x987B;&#x63D0;&#x4F9B;&#x4E0D;&#x540C;&#x5F62;&#x5F0F;&#x7684;&#x4EA4;&#x4E92;&#x65B9;&#x5F0F;&#x3002;&#x6B63;&#x5982;&#x4E1A;&#x52A1;&#x80FD;&#x529B;&#x56E2;&#x961F;&#x4E4B;&#x95F4;&#x901A;&#x8FC7;&#x5B9A;&#x4E49;&#x597D;&#x7684;API&#x534F;&#x8BAE;&#x76F8;&#x4E92;&#x534F;&#x4F5C;&#x4E00;&#x6837;&#xFF0C;&#x5E73;&#x53F0;&#x8FD0;&#x8425;&#x56E2;&#x961F;&#x4E5F;&#x4E3A;&#x8BE5;&#x5E73;&#x53F0;&#x63D0;&#x4F9B;&#x4E86;API&#x534F;&#x8BAE;&#x3002;&#x4E1A;&#x52A1;&#x80FD;&#x529B;&#x56E2;&#x961F;&#x4E0D;&#x518D;&#x9700;&#x8981;&#x6392;&#x961F;&#x7533;&#x8BF7;&#x5E94;&#x7528;&#x73AF;&#x5883;&#x548C;&#x6570;&#x636E;&#x670D;&#x52A1;&#xFF0C;&#x800C;&#x662F;&#x91C7;&#x7528;&#x66F4;&#x7CBE;&#x7B80;&#x7684;&#x65B9;&#x5F0F;&#x6784;&#x5EFA;&#x6309;&#x9700;&#x7533;&#x8BF7;&#x73AF;&#x5883;&#x548C;&#x670D;&#x52A1;&#x7684;&#x81EA;&#x52A8;&#x5316;&#x53D1;&#x5E03;&#x7BA1;&#x9053;&#x3002; </p>
<footer class="page-footer"><span class="copyright"><p><a href="https://jimmysong.io/about" target="_blank">&#x79C1;&#x4FE1;&#x6211;&#x83B7;&#x53D6;KubeCon China 2019&#x95E8;&#x7968;&#x6298;&#x6263;&#x7801;&#x548C;&#x62A5;&#x540D;SOFAStack Cloud Native Workshop</a></p><p><a href="https://gw.alipayobjects.com/mdn/site_comm/afts/img/A*HA0uRIfs6UIAAAAAAAAAAABjARQnAQ" data-lightbox="2fd927ee-fa64-4eca-8ed5-6bd72b573a3c" target="_blank">&#x70B9;&#x51FB;&#x5173;&#x6CE8;&#x3010;&#x4E91;&#x539F;&#x751F;&#x5E94;&#x7528;&#x67B6;&#x6784;&#x3011;&#x516C;&#x4F17;&#x53F7;&#x56DE;&#x590D;&#x3010;&#x52A0;&#x7FA4;&#x3011;&#x52A0;&#x5165;&#x5B66;&#x4E60;&#x7FA4;</a> | <a href="https://jimmysong.io/jobs/" target="_blank">&#x52A0;&#x5165;&#x8682;&#x8681;&#x91D1;&#x670D;&#x91D1;&#x878D;&#x79D1;&#x6280;&#xFF0C;&#x6784;&#x5EFA;&#x91D1;&#x878D;&#x7EA7;&#x4E91;&#x539F;&#x751F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;</a></p>Copyright &#xA9; <a href="https://jimmysong.io" target="_blank">jimmysong.io</a> 2017-2019 all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification"> Updated at 
2019-01-02 16:06:24
</span></footer></body></html>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="cultural-change.html" class="navigation navigation-prev " aria-label="Previous page: 2.1 文化变革">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="technical-change.html" class="navigation navigation-next " aria-label="Next page: 2.3 技术变革">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"2.2 组织变革","level":"1.3.2","depth":2,"next":{"title":"2.3 技术变革","level":"1.3.3","depth":2,"path":"chapter2/technical-change.md","ref":"chapter2/technical-change.md","articles":[]},"previous":{"title":"2.1 文化变革","level":"1.3.1","depth":2,"path":"chapter2/cultural-change.md","ref":"chapter2/cultural-change.md","articles":[]},"dir":"ltr"},"config":{"plugins":["github","codesnippet","splitter","page-toc-button","image-captions","editlink","back-to-top-button","-lunr","-search","search-plus","github-buttons@2.1.0","favicon","tbfed-pagefooter@^0.0.1","3-ba","ga","lightbox"],"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"<p><a href=https://jimmysong.io/about>私信我获取KubeCon China 2019门票折扣码和报名SOFAStack Cloud Native Workshop</a></p><p><a href=https://gw.alipayobjects.com/mdn/site_comm/afts/img/A*HA0uRIfs6UIAAAAAAAAAAABjARQnAQ data-lightbox=2fd927ee-fa64-4eca-8ed5-6bd72b573a3c>点击关注【云原生应用架构】公众号回复【加群】加入学习群</a> | <a href=https://jimmysong.io/jobs/>加入蚂蚁金服金融科技，构建金融级云原生基础设施</a></p>Copyright © <a href=https://jimmysong.io>jimmysong.io</a> 2017-2019","modify_label":" Updated at ","modify_format":"YYYY-MM-DD HH:mm:ss"},"github":{"url":"https://github.com/rootsongjc/migrating-to-cloud-native-application-architectures"},"editlink":{"label":"编辑本页","multilingual":false,"base":"https://github.com/rootsongjc/migrating-to-cloud-native-application-architectures/tree/master/"},"splitter":{},"codesnippet":{},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"favicon":{"shortcut":"images/favicon.ico","bookmark":"images/favicon.ico"},"lightbox":{"jquery":true},"page-toc-button":{},"back-to-top-button":{},"github-buttons":{"repo":"rootsongjc/migrating-to-cloud-native-application-architectures","types":["star"],"size":"small"},"3-ba":{"configuration":"auto","token":"11f7d254cfa4e0ca44b175c66d379ecc"},"ga":{"configuration":"auto","token":"UA-93485976-1"},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"showLevel":false,"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"}},"search-plus":{},"image-captions":{"caption":"图片 - _CAPTION_","variable_name":"_pictures"}},"theme":"default","author":"Jimmy Song","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{"_pictures":[{"backlink":"chapter3/distributed-systems-recipes.html#fig1.4.2.1","level":"1.4.2","list_caption":"Figure: Spring Cloud Config Server","alt":"Spring Cloud Config Server","nro":1,"url":"../images/figure-3-1.jpg","index":1,"caption_template":"图片 - _CAPTION_","label":"Spring Cloud Config Server","attributes":{},"skip":false,"key":"1.4.2.1"},{"backlink":"chapter3/distributed-systems-recipes.html#fig1.4.2.2","level":"1.4.2","list_caption":"Figure: Example 3-1","alt":"Example 3-1","nro":2,"url":"../images/example-3-1.jpg","index":2,"caption_template":"图片 - _CAPTION_","label":"Example 3-1","attributes":{},"skip":false,"key":"1.4.2.2"},{"backlink":"chapter3/distributed-systems-recipes.html#fig1.4.2.3","level":"1.4.2","list_caption":"Figure: Example 3-2","alt":"Example 3-2","nro":3,"url":"../images/example-3-2.jpg","index":3,"caption_template":"图片 - _CAPTION_","label":"Example 3-2","attributes":{},"skip":false,"key":"1.4.2.3"},{"backlink":"chapter3/distributed-systems-recipes.html#fig1.4.2.4","level":"1.4.2","list_caption":"Figure: Figure 3-3","alt":"Figure 3-3","nro":4,"url":"../images/figure-3-3.jpg","index":4,"caption_template":"图片 - _CAPTION_","label":"Figure 3-3","attributes":{},"skip":false,"key":"1.4.2.4"},{"backlink":"chapter3/distributed-systems-recipes.html#fig1.4.2.5","level":"1.4.2","list_caption":"Figure: Example 3-3","alt":"Example 3-3","nro":5,"url":"../images/example-3-3.jpg","index":5,"caption_template":"图片 - _CAPTION_","label":"Example 3-3","attributes":{},"skip":false,"key":"1.4.2.5"},{"backlink":"chapter3/distributed-systems-recipes.html#fig1.4.2.6","level":"1.4.2","list_caption":"Figure: example-3-4","alt":"example-3-4","nro":6,"url":"../images/example-3-4.jpg","index":6,"caption_template":"图片 - _CAPTION_","label":"example-3-4","attributes":{},"skip":false,"key":"1.4.2.6"},{"backlink":"chapter3/distributed-systems-recipes.html#fig1.4.2.7","level":"1.4.2","list_caption":"Figure: Figure 3-4","alt":"Figure 3-4","nro":7,"url":"../images/figure-3-4.jpg","index":7,"caption_template":"图片 - _CAPTION_","label":"Figure 3-4","attributes":{},"skip":false,"key":"1.4.2.7"},{"backlink":"chapter3/distributed-systems-recipes.html#fig1.4.2.8","level":"1.4.2","list_caption":"Figure: Example 3-5-1","alt":"Example 3-5-1","nro":8,"url":"../images/example-3-5-1.jpg","index":8,"caption_template":"图片 - _CAPTION_","label":"Example 3-5-1","attributes":{},"skip":false,"key":"1.4.2.8"},{"backlink":"chapter3/distributed-systems-recipes.html#fig1.4.2.9","level":"1.4.2","list_caption":"Figure: Example-3-5-2","alt":"Example-3-5-2","nro":9,"url":"../images/example-3-5-2.jpg","index":9,"caption_template":"图片 - _CAPTION_","label":"Example-3-5-2","attributes":{},"skip":false,"key":"1.4.2.9"},{"backlink":"chapter3/distributed-systems-recipes.html#fig1.4.2.10","level":"1.4.2","list_caption":"Figure: Example 3-6","alt":"Example 3-6","nro":10,"url":"../images/example-3-6.jpg","index":10,"caption_template":"图片 - _CAPTION_","label":"Example 3-6","attributes":{},"skip":false,"key":"1.4.2.10"},{"backlink":"chapter3/distributed-systems-recipes.html#fig1.4.2.11","level":"1.4.2","list_caption":"Figure: Figure 3-5","alt":"Figure 3-5","nro":11,"url":"../images/figure-3-5.jpg","index":11,"caption_template":"图片 - _CAPTION_","label":"Figure 3-5","attributes":{},"skip":false,"key":"1.4.2.11"},{"backlink":"chapter3/distributed-systems-recipes.html#fig1.4.2.12","level":"1.4.2","list_caption":"Figure: Example 3-7","alt":"Example 3-7","nro":12,"url":"../images/example-3-7.jpg","index":12,"caption_template":"图片 - _CAPTION_","label":"Example 3-7","attributes":{},"skip":false,"key":"1.4.2.12"},{"backlink":"chapter3/distributed-systems-recipes.html#fig1.4.2.13","level":"1.4.2","list_caption":"Figure: Example 3-8","alt":"Example 3-8","nro":13,"url":"../images/example-3-8.jpg","index":13,"caption_template":"图片 - _CAPTION_","label":"Example 3-8","attributes":{},"skip":false,"key":"1.4.2.13"},{"backlink":"chapter3/distributed-systems-recipes.html#fig1.4.2.14","level":"1.4.2","list_caption":"Figure: Figure 3-7","alt":"Figure 3-7","nro":14,"url":"../images/figure-3-7.jpg","index":14,"caption_template":"图片 - _CAPTION_","label":"Figure 3-7","attributes":{},"skip":false,"key":"1.4.2.14"},{"backlink":"chapter3/distributed-systems-recipes.html#fig1.4.2.15","level":"1.4.2","list_caption":"Figure: Example 3-9","alt":"Example 3-9","nro":15,"url":"../images/example-3-9.jpg","index":15,"caption_template":"图片 - _CAPTION_","label":"Example 3-9","attributes":{},"skip":false,"key":"1.4.2.15"},{"backlink":"chapter3/distributed-systems-recipes.html#fig1.4.2.16","level":"1.4.2","list_caption":"Figure: figure 3-10","alt":"figure 3-10","nro":16,"url":"../images/example-3-10.jpg","index":16,"caption_template":"图片 - _CAPTION_","label":"figure 3-10","attributes":{},"skip":false,"key":"1.4.2.16"}]},"title":"迁移到云原生应用架构","language":"zh-hans","links":{"sidebar":{"Cloud Native Python（Python云原生） - 使用Python和React构建云原生应用":"https://jimmysong.io/posts/cloud-native-python","ServiceMesher社区":"http://www.servicemesher.com","SOFAMesh - 基于Istio的大规模服务网格解决方案":"https://github.com/alipay/sofa-mesh","Cloud Native Java（云原生Java）-  Spring Boot、Spring Cloud与Cloud Foundry弹性系统设计":"https://jimmysong.io/posts/cloud-native-java","SOFAMosn - Golang版的高性能Service Mesh Sidecar代理":"https://github.com/alipay/sofa-mosn","Awesome Service Mesh":"http://www.servicemesher.com/awesome-servicemesh","Istio Handbook - Istio服务网格进阶实战":"https://jimmysong.io/istio-handbook","Jimmy Song":"https://jimmysong.io","Awesome Cloud Native":"https://jimmysong.io/awesome-cloud-native","Cloud Native Go - 基于Go和React的web云原生应用构建指南":"https://jimmysong.io/posts/cloud-native-go"}},"gitbook":"*","description":"Migrating to Cloud Native Application Architectures 中文版"},"file":{"path":"chapter2/organizational-change.md","mtime":"2019-01-02T08:06:24.059Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-05-06T09:01:00.082Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-page-toc-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-editlink/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-plus/jquery.mark.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-plus/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-3-ba/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-ga/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lightbox/jquery.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lightbox/lightbox.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

