
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>2.3 技术变革 · 迁移到云原生应用架构</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="Jimmy Song">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-toc-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-image-captions/image-captions.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search-plus/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-lightbox/lightbox.min.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="summary.html" />
    
    
    <link rel="prev" href="organizational-change.html" />
    

    
        <link rel="shortcut icon" href='../images/favicon.ico' type="image/x-icon">
    
    
        <link rel="bookmark" href='../images/favicon.ico' type="image/x-icon">
    
    
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"repo":"rootsongjc/migrating-to-cloud-native-application-architectures","types":["star"],"size":"small"};
    </script>

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://jimmysong.io/posts/cloud-native-python" target="_blank" class="custom-link">Cloud Native Python（Python云原生） - 使用Python和React构建云原生应用</a>
        </li>
    
        
        <li>
            <a href="http://www.servicemesher.com" target="_blank" class="custom-link">ServiceMesher社区</a>
        </li>
    
        
        <li>
            <a href="https://github.com/alipay/sofa-mesh" target="_blank" class="custom-link">SOFAMesh - 基于Istio的大规模服务网格解决方案</a>
        </li>
    
        
        <li>
            <a href="https://jimmysong.io/posts/cloud-native-java" target="_blank" class="custom-link">Cloud Native Java（云原生Java）-  Spring Boot、Spring Cloud与Cloud Foundry弹性系统设计</a>
        </li>
    
        
        <li>
            <a href="https://github.com/alipay/sofa-mosn" target="_blank" class="custom-link">SOFAMosn - Golang版的高性能Service Mesh Sidecar代理</a>
        </li>
    
        
        <li>
            <a href="http://www.servicemesher.com/awesome-servicemesh" target="_blank" class="custom-link">Awesome Service Mesh</a>
        </li>
    
        
        <li>
            <a href="https://jimmysong.io/istio-handbook" target="_blank" class="custom-link">Istio Handbook - Istio服务网格进阶实战</a>
        </li>
    
        
        <li>
            <a href="https://jimmysong.io" target="_blank" class="custom-link">Jimmy Song</a>
        </li>
    
        
        <li>
            <a href="https://jimmysong.io/awesome-cloud-native" target="_blank" class="custom-link">Awesome Cloud Native</a>
        </li>
    
        
        <li>
            <a href="https://jimmysong.io/posts/cloud-native-go" target="_blank" class="custom-link">Cloud Native Go - 基于Go和React的web云原生应用构建指南</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../chapter1/the-rise-of-cloud-native.html">
            
                <a href="../chapter1/the-rise-of-cloud-native.html">
            
                    
                    1. 云原生的崛起
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../chapter1/why-cloud-native-application-architectures.html">
            
                <a href="../chapter1/why-cloud-native-application-architectures.html">
            
                    
                    1.1 为何使用云原生应用架构？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="../chapter1/defining-cloud-native-architectures.html">
            
                <a href="../chapter1/defining-cloud-native-architectures.html">
            
                    
                    1.2 云原生架构的定义
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="../chapter1/summary.html">
            
                <a href="../chapter1/summary.html">
            
                    
                    1.3 本章小结
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="changes-needed.html">
            
                <a href="changes-needed.html">
            
                    
                    2. 在变革中前行
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="cultural-change.html">
            
                <a href="cultural-change.html">
            
                    
                    2.1 文化变革
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="organizational-change.html">
            
                <a href="organizational-change.html">
            
                    
                    2.2 组织变革
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3.3" data-path="technical-change.html">
            
                <a href="technical-change.html">
            
                    
                    2.3 技术变革
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="summary.html">
            
                <a href="summary.html">
            
                    
                    2.4 本章小结
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../chapter3/migration-cookbook.html">
            
                <a href="../chapter3/migration-cookbook.html">
            
                    
                    3. 迁移指南
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="../chapter3/decomposition-recipes.html">
            
                <a href="../chapter3/decomposition-recipes.html">
            
                    
                    3.1 分解原架构
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="../chapter3/distributed-systems-recipes.html">
            
                <a href="../chapter3/distributed-systems-recipes.html">
            
                    
                    3.2 使用分布式系统
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="../chapter3/summary.html">
            
                <a href="../chapter3/summary.html">
            
                    
                    3.3 本章小结
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >2.3 技术变革</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div class="search-plus" id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <html><head></head><body><h1 id="&#x6280;&#x672F;&#x53D8;&#x9769;">&#x6280;&#x672F;&#x53D8;&#x9769;</h1>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5C06;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#x8F6C;&#x79FB;&#x5230;&#x4E86;&#x4E91;&#x4E2D;&#x7684;DevOps&#x5E73;&#x53F0;&#x3002;</p>
<h2 id="&#x5206;&#x89E3;&#x5355;&#x4F53;&#x5E94;&#x7528;">&#x5206;&#x89E3;&#x5355;&#x4F53;&#x5E94;&#x7528;</h2>
<p>&#x4F20;&#x7EDF;&#x7684;n&#x5C42;&#x5355;&#x4F53;&#x5F0F;&#x5E94;&#x7528;&#x90E8;&#x7F72;&#x5230;&#x4E91;&#x4E2D;&#x540E;&#x5F88;&#x96BE;&#x7EF4;&#x62A4;&#xFF0C;</p>
<p>&#x4F20;&#x7EDF;&#x7684;n&#x5C42;&#xFF0C;&#x5355;&#x4F53;&#x5F0F;&#x4F01;&#x4E1A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5728;&#x90E8;&#x7F72;&#x5230;&#x4E91;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x4E2D;&#x540E;&#x5F88;&#x96BE;&#x826F;&#x597D;&#x8FD0;&#x884C;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x7ECF;&#x5E38;&#x5BF9;&#x4E91;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x65E0;&#x6CD5;&#x63D0;&#x4F9B;&#x7684;&#x90E8;&#x7F72;&#x73AF;&#x5883;&#x505A;&#x51FA;&#x4E0D;&#x53EF;&#x9760;&#x7684;&#x5047;&#x8BBE;&#x3002; &#x4F8B;&#x5982;&#x4EE5;&#x4E0B;&#x8981;&#x6C42;&#xFF1A;</p>
<ul>
<li>&#x53EF;&#x8BBF;&#x95EE;&#x5DF2;&#x6302;&#x8F7D;&#x7684;&#x5171;&#x4EAB;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;</li>
<li>P2P&#x5E94;&#x7528;&#x670D;&#x52A1;&#x5668;&#x96C6;&#x7FA4;</li>
<li>&#x5171;&#x4EAB;&#x5E93;</li>
<li>&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x4F4D;&#x4E8E;&#x5E38;&#x7528;&#x7684;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x76EE;&#x5F55;</li>
</ul>
<p>&#x5927;&#x591A;&#x6570;&#x8FD9;&#x4E9B;&#x5047;&#x8BBE;&#x90FD;&#x51FA;&#x4E8E;&#x8FD9;&#x6837;&#x7684;&#x4E8B;&#x5B9E;&#xFF1A;&#x5355;&#x4F53;&#x5E94;&#x7528;&#x901A;&#x5E38;&#x90FD;&#x90E8;&#x7F72;&#x5728;&#x957F;&#x671F;&#x8FD0;&#x884C;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x4E2D;&#xFF0C;&#x5E76;&#x4E0E;&#x5176;&#x7D27;&#x5BC6;&#x7ED3;&#x5408;&#x3002;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x5355;&#x4F53;&#x5E94;&#x7528;&#x5E76;&#x4E0D;&#x592A;&#x9002;&#x5408;&#x5F39;&#x6027;&#x548C;&#x77ED;&#x6682;&#xFF08;&#x975E;&#x957F;&#x671F;&#x652F;&#x6301;&#xFF09;&#x751F;&#x547D;&#x5468;&#x671F;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x5373;&#x4F7F;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x4E0D;&#x9700;&#x8981;&#x8FD9;&#x4E9B;&#x5047;&#x8BBE;&#x7684;&#x5355;&#x4F53;&#x5E94;&#x7528;&#xFF0C;&#x6211;&#x4EEC;&#x4F9D;&#x7136;&#x6709;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#x9700;&#x8981;&#x89E3;&#x51B3;&#xFF1A;</p>
<ul>
<li>&#x5355;&#x4F53;&#x5F0F;&#x5E94;&#x7528;&#x7684;&#x53D8;&#x66F4;&#x5468;&#x671F;&#x8026;&#x5408;&#xFF0C;&#x4F7F;&#x72EC;&#x7ACB;&#x4E1A;&#x52A1;&#x80FD;&#x529B;&#x65E0;&#x6CD5;&#x6309;&#x9700;&#x90E8;&#x7F72;&#xFF0C;&#x963B;&#x788D;&#x521B;&#x65B0;&#x901F;&#x5EA6;&#x3002;</li>
<li>&#x5D4C;&#x5165;&#x5230;&#x5355;&#x4F53;&#x5E94;&#x7528;&#x4E2D;&#x7684;&#x670D;&#x52A1;&#x4E0D;&#x80FD;&#x72EC;&#x7ACB;&#x4E8E;&#x5176;&#x4ED6;&#x670D;&#x52A1;&#x8FDB;&#x884C;&#x6269;&#x5C55;&#xFF0C;&#x56E0;&#x6B64;&#x8D1F;&#x8F7D;&#x66F4;&#x96BE;&#x4E8E;&#x4F18;&#x5316;&#x3002;</li>
<li>&#x65B0;&#x52A0;&#x5165;&#x7EC4;&#x7EC7;&#x7684;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5FC5;&#x987B;&#x9002;&#x5E94;&#x65B0;&#x7684;&#x56E2;&#x961F;&#xFF0C;&#x7ECF;&#x5E38;&#x5B66;&#x4E60;&#x65B0;&#x7684;&#x4E1A;&#x52A1;&#x9886;&#x57DF;&#xFF0C;&#x5E76;&#x4E14;&#x4E00;&#x6B21;&#x5C31;&#x719F;&#x6089;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x5927;&#x7684;&#x4EE3;&#x7801;&#x5E93;&#x3002; &#x8FD9;&#x6837;&#x4F1A;&#x589E;&#x52A0;3-6&#x4E2A;&#x6708;&#x7684;&#x9002;&#x5E94;&#x65F6;&#x95F4;&#xFF0C;&#x624D;&#x80FD;&#x5B9E;&#x73B0;&#x771F;&#x6B63;&#x7684;&#x751F;&#x4EA7;&#x529B;&#x3002;</li>
<li>&#x5C1D;&#x8BD5;&#x901A;&#x8FC7;&#x5806;&#x79EF;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x6765;&#x6269;&#x5927;&#x5F00;&#x53D1;&#x7EC4;&#x7EC7;&#xFF0C;&#x589E;&#x52A0;&#x4E86;&#x6602;&#x8D35;&#x7684;&#x6C9F;&#x901A;&#x548C;&#x534F;&#x8C03;&#x6210;&#x672C;&#x3002;</li>
<li>&#x6280;&#x672F;&#x6808;&#x9700;&#x8981;&#x957F;&#x671F;&#x627F;&#x8BFA;&#x3002;&#x5F15;&#x8FDB;&#x65B0;&#x6280;&#x672F;&#x88AB;&#x8BA4;&#x4E3A;&#x592A;&#x5192;&#x9669;&#x7684;&#x4E3E;&#x52A8;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x53EF;&#x80FD;&#x4F1A;&#x5BF9;&#x6574;&#x4F53;&#x4EA7;&#x751F;&#x4E0D;&#x5229;&#x5F71;&#x54CD;&#x3002;</li>
</ul>
<p>&#x7EC6;&#x5FC3;&#x7684;&#x8BFB;&#x8005;&#x4F1A;&#x6CE8;&#x610F;&#x5230;&#xFF0C;&#x8BE5;&#x5217;&#x8868;&#x6B63;&#x597D;&#x4E0E;&#x201C;&#x5FAE;&#x670D;&#x52A1;&#x201D;&#x7684;&#x5217;&#x8868;&#x76F8;&#x53CD;&#x3002;&#x5C06;&#x7EC4;&#x7EC7;&#x5206;&#x89E3;&#x4E3A;&#x4E1A;&#x52A1;&#x80FD;&#x529B;&#x56E2;&#x961F;&#x8FD8;&#x8981;&#x6C42;&#x6211;&#x4EEC;&#x5C06;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5206;&#x89E3;&#x6210;&#x5FAE;&#x670D;&#x52A1;&#x3002;&#x53EA;&#x6709;&#x8FD9;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x624D;&#x80FD;&#x4ECE;&#x4E91;&#x8BA1;&#x7B97;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x4E2D;&#x83B7;&#x5F97;&#x6700;&#x5927;&#x7684;&#x6536;&#x76CA;&#x3002;</p>
<h2 id="&#x5206;&#x89E3;&#x6570;&#x636E;">&#x5206;&#x89E3;&#x6570;&#x636E;</h2>
<p>&#x4EC5;&#x4EC5;&#x5C06;&#x5355;&#x4F53;&#x5E94;&#x7528;&#x5206;&#x89E3;&#x4E3A;&#x5FAE;&#x670D;&#x52A1;&#x8FD8;&#x662F;&#x8FDC;&#x8FDC;&#x4E0D;&#x591F;&#x7684;&#x3002;&#x6570;&#x636E;&#x6A21;&#x578B;&#x5FC5;&#x987B;&#x8981;&#x89E3;&#x8026;&#x3002;&#x5982;&#x679C;&#x4E1A;&#x52A1;&#x80FD;&#x529B;&#x56E2;&#x961F;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x81EA;&#x4E3B;&#x7684;&#xFF0C;&#x5374;&#x88AB;&#x8FEB;&#x901A;&#x8FC7;&#x5355;&#x4E00;&#x7684;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x8FDB;&#x884C;&#x534F;&#x4F5C;&#xFF0C;&#x90A3;&#x4E48;&#x5355;&#x4F53;&#x5E94;&#x7528;&#x5BF9;&#x521B;&#x65B0;&#x7684;&#x963B;&#x788D;&#x5C06;&#x4F9D;&#x7136;&#x5B58;&#x5728;&#x3002;</p>
<p>&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x4EA7;&#x54C1;&#x67B6;&#x6784;&#x5FC5;&#x987B;&#x4ECE;&#x6570;&#x636E;&#x5F00;&#x59CB;&#x7684;&#x8BF4;&#x6CD5;&#x662F;&#x6709;&#x4E89;&#x8BAE;&#x7684;&#x3002;&#x7531;Eric Evans&#xFF08;Addison-Wesley&#xFF09;&#x5728;&#x9886;&#x57DF;&#x9A71;&#x52A8;&#x8BBE;&#x8BA1;&#xFF08;DDD&#xFF09;&#x4E2D;&#x63D0;&#x51FA;&#x7684;&#x539F;&#x7406;&#x8BA4;&#x4E3A;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x6210;&#x529F;&#x5728;&#x5F88;&#x5927;&#x7A0B;&#x5EA6;&#x4E0A;&#x53D6;&#x51B3;&#x4E8E;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x7684;&#x8D28;&#x91CF;&#xFF08;&#x4EE5;&#x53CA;&#x652F;&#x6301;&#x5B83;&#x7684;&#x666E;&#x904D;&#x5B58;&#x5728;&#x7684;&#x8BED;&#x8A00;&#xFF09;&#x3002;&#x8981;&#x4F7F;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x6709;&#x6548;&#xFF0C;&#x8FD8;&#x5FC5;&#x987B;&#x5728;&#x5185;&#x90E8;&#x4E00;&#x81F4;&#x2014;&#x2014;&#x6211;&#x4EEC;&#x4E0D;&#x5E94;&#x8BE5;&#x5728;&#x540C;&#x4E00;&#x6A21;&#x578B;&#x5185;&#x7684;&#x4E00;&#x81F4;&#x5B9A;&#x4E49;&#x4E2D;&#x627E;&#x5230;&#x91CD;&#x590D;&#x5B9A;&#x4E49;&#x7684;&#x672F;&#x8BED;&#x6216;&#x6982;&#x5FF5;&#x3002;</p>
<p>&#x521B;&#x5EFA;&#x4E0D;&#x5177;&#x6709;&#x8FD9;&#x79CD;&#x4E0D;&#x4E00;&#x81F4;&#x7684;&#x8054;&#x5408;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x662F;&#x975E;&#x5E38;&#x56F0;&#x96BE;&#x548C;&#x6602;&#x8D35;&#x7684;&#xFF08;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x7684;&#xFF09;&#x3002;Evans&#x5C06;&#x4E1A;&#x52A1;&#x7684;&#x6574;&#x4F53;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x7684;&#x5185;&#x90E8;&#x4E00;&#x81F4;&#x6027;&#x5B50;&#x96C6;&#x79F0;&#x4E3A;&#x6709;&#x754C;&#x4E0A;&#x4E0B;&#x6587;&#x3002;</p>
<p>&#x6700;&#x8FD1;&#x4E0E;&#x822A;&#x7A7A;&#x516C;&#x53F8;&#x5BA2;&#x6237;&#x5408;&#x4F5C;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x4E86;&#x4ED6;&#x4EEC;&#x4E1A;&#x52A1;&#x7684;&#x6838;&#x5FC3;&#x6982;&#x5FF5;&#xFF0C;&#x81EA;&#x7136;&#x662F;&#x201C;&#x822A;&#x7A7A;&#x516C;&#x53F8;&#x9884;&#x8BA2;&#x201D;&#x7684;&#x8BDD;&#x9898;&#x3002;&#x8BE5;&#x96C6;&#x56E2;&#x53EF;&#x4EE5;&#x5728;&#x5176;&#x9884;&#x5B9A;&#x4E1A;&#x52A1;&#x4E2D;&#x5212;&#x5206;&#x5341;&#x4E03;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x903B;&#x8F91;&#x5B9A;&#x4E49;&#xFF0C;&#x51E0;&#x4E4E;&#x4E0D;&#x80FD;&#x5C06;&#x5B83;&#x4EEC;&#x8C03;&#x548C;&#x4E3A;&#x4E00;&#x4E2A;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x6BCF;&#x4E2A;&#x5B9A;&#x4E49;&#x7684;&#x6240;&#x6709;&#x7EC6;&#x5FAE;&#x5DEE;&#x522B;&#x90FD;&#x88AB;&#x4ED4;&#x7EC6;&#x5730;&#x63CF;&#x7ED8;&#x6210;&#x4E00;&#x4E2A;&#x4E2A;&#x5355;&#x4E00;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x8FD9;&#x5C06;&#x6210;&#x4E3A;&#x7EC4;&#x7EC7;&#x7684;&#x5DE8;&#x5927;&#x74F6;&#x9888;&#x3002;</p>
<p>&#x6709;&#x754C;&#x4E0A;&#x4E0B;&#x6587;&#x5141;&#x8BB8;&#x4F60;&#x5728;&#x6574;&#x4E2A;&#x7EC4;&#x7EC7;&#x4E2D;&#x4FDD;&#x6301;&#x5355;&#x4E00;&#x6982;&#x5FF5;&#x7684;&#x4E0D;&#x4E00;&#x81F4;&#x5B9A;&#x4E49;&#xFF0C;&#x53EA;&#x8981;&#x5B83;&#x4EEC;&#x5728;&#x6709;&#x754C;&#x4E0A;&#x4E0B;&#x6587;&#x4E2D;&#x4E00;&#x81F4;&#x5730;&#x5B9A;&#x4E49;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x9700;&#x8981;&#x786E;&#x5B9A;&#x53EF;&#x4EE5;&#x5728;&#x5185;&#x90E8;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#x7684;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x7684;&#x7EC6;&#x5206;&#x3002;&#x6211;&#x4EEC;&#x5728;&#x8FD9;&#x4E9B;&#x7EC6;&#x5206;&#x4E0A;&#x753B;&#x51FA;&#x56FA;&#x5B9A;&#x7684;&#x8FB9;&#x754C;&#xFF0C;&#x5212;&#x5206;&#x51FA;&#x6709;&#x754C;&#x4E0A;&#x4E0B;&#x6587;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;&#x4E1A;&#x52A1;&#x80FD;&#x529B;&#x56E2;&#x961F;&#x4E0E;&#x8FD9;&#x4E9B;&#x73AF;&#x5883;&#x76F8;&#x5339;&#x914D;&#xFF0C;&#x8FD9;&#x4E9B;&#x56E2;&#x961F;&#x5C06;&#x6784;&#x5EFA;&#x63D0;&#x4F9B;&#x8FD9;&#x4E9B;&#x529F;&#x80FD;&#x7684;&#x5FAE;&#x670D;&#x52A1;&#x3002;</p>
<p>&#x5FAE;&#x670D;&#x52A1;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x6709;&#x7528;&#x7684;&#x5B9A;&#x4E49;&#xFF0C;&#x7528;&#x4E8E;&#x5B9A;&#x4E49;12&#x56E0;&#x7D20;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5E94;&#x8BE5;&#x662F;&#x4EC0;&#x4E48;&#x3002;12&#x56E0;&#x7D20;&#x4E3B;&#x8981;&#x662F;&#x6280;&#x672F;&#x89C4;&#x8303;&#xFF0C;&#x800C;&#x5FAE;&#x670D;&#x52A1;&#x4E3B;&#x8981;&#x662F;&#x4E1A;&#x52A1;&#x89C4;&#x8303;&#x3002;&#x901A;&#x8FC7;&#x5B9A;&#x4E49;&#x6709;&#x754C;&#x4E0A;&#x4E0B;&#x6587;&#xFF0C;&#x4E3A;&#x4ED6;&#x4EEC;&#x5206;&#x914D;&#x4E00;&#x7EC4;&#x4E1A;&#x52A1;&#x80FD;&#x529B;&#xFF0C;&#x59D4;&#x6258;&#x80FD;&#x529B;&#x56E2;&#x961F;&#x5BF9;&#x8FD9;&#x4E9B;&#x4E1A;&#x52A1;&#x80FD;&#x529B;&#x8D1F;&#x8D23;&#xFF0C;&#x5E76;&#x5EFA;&#x7ACB;12&#x56E0;&#x7D20;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x8FD9;&#x4E9B;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x72EC;&#x7ACB;&#x90E8;&#x7F72;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E3A;&#x4E1A;&#x52A1;&#x80FD;&#x529B;&#x56E2;&#x961F;&#x7684;&#x8FD0;&#x7EF4;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x7EC4;&#x6709;&#x7528;&#x7684;&#x6280;&#x672F;&#x5DE5;&#x5177;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5C06;&#x6709;&#x754C;&#x4E0A;&#x4E0B;&#x6587;&#x4E0E;&#x6BCF;&#x4E2A;&#x670D;&#x52A1;&#x6A21;&#x5F0F;&#x7684;&#x6570;&#x636E;&#x5E93;&#x7ED3;&#x5408;&#xFF0C;&#x6BCF;&#x4E2A;&#x5FAE;&#x670D;&#x52A1;&#x5C01;&#x88C5;&#x3001;&#x7BA1;&#x7406;&#x548C;&#x4FDD;&#x62A4;&#x81EA;&#x5DF1;&#x7684;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x548C;&#x6301;&#x4E45;&#x5B58;&#x50A8;&#x3002;&#x5728;&#x6BCF;&#x4E2A;&#x670D;&#x52A1;&#x6A21;&#x5F0F;&#x7684;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#xFF0C;&#x53EA;&#x5141;&#x8BB8;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x670D;&#x52A1;&#x8BBF;&#x95EE;&#x903B;&#x8F91;&#x6570;&#x636E;&#x5B58;&#x50A8;&#xFF0C;&#x903B;&#x8F91;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x53EF;&#x80FD;&#x662F;&#x4EE5;&#x591A;&#x79DF;&#x6237;&#x96C6;&#x7FA4;&#x4E2D;&#x7684;&#x5355;&#x4E2A;schema&#x6216;&#x4E13;&#x7528;&#x7269;&#x7406;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x5B58;&#x5728;&#x3002;&#x5BF9;&#x8FD9;&#x4E9B;&#x6982;&#x5FF5;&#x7684;&#x4EFB;&#x4F55;&#x5916;&#x90E8;&#x8BBF;&#x95EE;&#x90FD;&#x662F;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x660E;&#x786E;&#x5B9A;&#x4E49;&#x7684;&#x4E1A;&#x52A1;&#x534F;&#x8BAE;&#x6765;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;&#x8BE5;&#x534F;&#x8BAE;&#x7684;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x4E3A;API&#xFF08;&#x901A;&#x5E38;&#x662F;REST&#xFF0C;&#x4F46;&#x53EF;&#x80FD;&#x662F;&#x4EFB;&#x4F55;&#x534F;&#x8BAE;&#xFF09;&#x3002;</p>
<p>&#x8FD9;&#x79CD;&#x5206;&#x89E3;&#x5141;&#x8BB8;&#x5E94;&#x7528;&#x62E5;&#x6709;&#x591A;&#x8BED;&#x8A00;&#x652F;&#x6301;&#x7684;&#x6301;&#x4E45;&#x6027;&#xFF0C;&#x6216;&#x8005;&#x57FA;&#x4E8E;&#x6570;&#x636E;&#x5F62;&#x6001;&#x548C;&#x8BFB;&#x5199;&#x8BBF;&#x95EE;&#x6A21;&#x5F0F;&#x9009;&#x62E9;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x6570;&#x636E;&#x5FC5;&#x987B;&#x7ECF;&#x5E38;&#x901A;&#x8FC7;&#x4E8B;&#x4EF6;&#x9A71;&#x52A8;&#x6280;&#x672F;&#x91CD;&#x65B0;&#x7EC4;&#x5408;&#xFF0C;&#x4EE5;&#x4FBF;&#x8BF7;&#x6C42;&#x4EA4;&#x53C9;&#x4E0A;&#x4E0B;&#x6587;&#x3002;&#x8BF8;&#x5982;&#x547D;&#x4EE4;&#x67E5;&#x8BE2;&#x8D23;&#x4EFB;&#x9694;&#x79BB;&#xFF08;CQRS&#xFF09;&#x548C;&#x4E8B;&#x4EF6;&#x6E90;&#xFF08;Event Sourcing&#xFF09;&#x4E4B;&#x7C7B;&#x7684;&#x6280;&#x672F;&#x901A;&#x5E38;&#x5728;&#x8DE8;&#x4E0A;&#x4E0B;&#x6587;&#x540C;&#x6B65;&#x7C7B;&#x4F3C;&#x6982;&#x5FF5;&#x65F6;&#x5F88;&#x6709;&#x5E2E;&#x52A9;&#xFF0C;&#x8FD9;&#x8D85;&#x51FA;&#x4E86;&#x672C;&#x6587;&#x7684;&#x8303;&#x56F4;&#x3002;</p>
<h2 id="&#x5BB9;&#x5668;&#x5316;">&#x5BB9;&#x5668;&#x5316;</h2>
<p>&#x5BB9;&#x5668;&#x955C;&#x50CF;&#xFF08;&#x4F8B;&#x5982;&#x901A;&#x8FC7;LXC&#x3001;Docker&#x6216;Rocket&#x9879;&#x76EE;&#x51C6;&#x5907;&#x7684;&#x955C;&#x50CF;&#xFF09;&#x6B63;&#x5728;&#x8FC5;&#x901F;&#x6210;&#x4E3A;&#x4E91;&#x539F;&#x751F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x67B6;&#x6784;&#x7684;&#x90E8;&#x7F72;&#x5355;&#x5143;&#x3002;&#x7136;&#x540E;&#x901A;&#x8FC7;&#x8BF8;&#x5982;Kubernetes&#x3001;Marathon&#x6216;Lattice&#x7B49;&#x5404;&#x79CD;&#x8C03;&#x5EA6;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x5B9E;&#x4F8B;&#x5316;&#x8FD9;&#x6837;&#x7684;&#x5BB9;&#x5668;&#x955C;&#x50CF;&#x3002;&#x4E9A;&#x9A6C;&#x900A;&#x548C;Google&#x7B49;&#x516C;&#x6709;&#x4E91;&#x4F9B;&#x5E94;&#x5546;&#x4E5F;&#x63D0;&#x4F9B;&#x4E00;&#x6D41;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x7528;&#x4E8E;&#x5BB9;&#x5668;&#x5316;&#x8C03;&#x5EA6;&#x548C;&#x90E8;&#x7F72;&#x3002;&#x5BB9;&#x5668;&#x5229;&#x7528;&#x73B0;&#x4EE3;&#x7684;Linux&#x5185;&#x6838;&#x539F;&#x8BED;&#xFF0C;&#x5982;&#x63A7;&#x5236;&#x7EC4;&#xFF08;cgroups&#xFF09;&#x548C;&#x547D;&#x540D;&#x7A7A;&#x95F4;&#x6765;&#x63D0;&#x4F9B;&#x7C7B;&#x4F3C;&#x7684;&#x8D44;&#x6E90;&#x5206;&#x914D;&#x548C;&#x9694;&#x79BB;&#x529F;&#x80FD;&#xFF0C;&#x8FD9;&#x4E9B;&#x529F;&#x80FD;&#x4E0E;&#x865A;&#x62DF;&#x673A;&#x63D0;&#x4F9B;&#x7684;&#x529F;&#x80FD;&#x76F8;&#x6BD4;&#xFF0C;&#x5177;&#x6709;&#x66F4;&#x5C11;&#x7684;&#x5F00;&#x9500;&#x548C;&#x66F4;&#x5F3A;&#x7684;&#x53EF;&#x79FB;&#x690D;&#x6027;&#x3002;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5C06;&#x9700;&#x8981;&#x5C06;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5305;&#x88C5;&#x6210;&#x5BB9;&#x5668;&#x955C;&#x50CF;&#xFF0C;&#x4EE5;&#x5145;&#x5206;&#x5229;&#x7528;&#x73B0;&#x4EE3;&#x4E91;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x7684;&#x529F;&#x80FD;&#x3002;</p>
<h2 id="&#x4ECE;&#x7BA1;&#x5F26;&#x4E50;&#x7F16;&#x6392;&#x5230;&#x821E;&#x8E48;&#x7F16;&#x821E;">&#x4ECE;&#x7BA1;&#x5F26;&#x4E50;&#x7F16;&#x6392;&#x5230;&#x821E;&#x8E48;&#x7F16;&#x821E;</h2>
<p>&#x4E0D;&#x4EC5;&#x4EC5;&#x670D;&#x52A1;&#x4EA4;&#x4ED8;&#x3001;&#x6570;&#x636E;&#x5EFA;&#x6A21;&#x548C;&#x6CBB;&#x7406;&#x5FC5;&#x987B;&#x5206;&#x6563;&#x5316;&#xFF0C;&#x670D;&#x52A1;&#x96C6;&#x6210;&#x4E5F;&#x662F;&#x5982;&#x6B64;&#x3002;&#x4F01;&#x4E1A;&#x670D;&#x52A1;&#x96C6;&#x6210;&#x4F20;&#x7EDF;&#x4E0A;&#x662F;&#x901A;&#x8FC7;&#x4F01;&#x4E1A;&#x670D;&#x52A1;&#x603B;&#x7EBF;&#xFF08;ESB&#xFF09;&#x5B9E;&#x73B0;&#x7684;&#x3002; ESB&#x6210;&#x4E3A;&#x7BA1;&#x7406;&#x670D;&#x52A1;&#x4E4B;&#x95F4;&#x4EA4;&#x4E92;&#x7684;&#x6240;&#x6709;&#x8DEF;&#x7531;&#x3001;&#x8F6C;&#x6362;&#x3001;&#x7B56;&#x7565;&#x3001;&#x5B89;&#x5168;&#x6027;&#x548C;&#x5176;&#x4ED6;&#x51B3;&#x7B56;&#x7684;&#x6240;&#x6709;&#x8005;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x5176;&#x79F0;&#x4E4B;&#x4E3A;&#x7F16;&#x6392;&#xFF0C;&#x7C7B;&#x4F3C;&#x4E8E;&#x5BFC;&#x6F14;&#xFF0C;&#x4ED6;&#x51B3;&#x5B9A;&#x4E86;&#x4E50;&#x56E2;&#x6F14;&#x51FA;&#x671F;&#x95F4;&#x6F14;&#x594F;&#x97F3;&#x4E50;&#x7684;&#x8FDB;&#x7A0B;&#x3002;ESB&#x548C;&#x7F16;&#x6392;&#x53EF;&#x4EE5;&#x4EA7;&#x751F;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x548C;&#x4EE4;&#x4EBA;&#x6109;&#x5FEB;&#x7684;&#x67B6;&#x6784;&#x56FE;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x7684;&#x7B80;&#x5355;&#x6027;&#x7D27;&#x7D27;&#x662F;&#x8868;&#x9762;&#x6027;&#x7684;&#x3002;&#x5728;ESB&#x4E2D;&#x9690;&#x85CF;&#x7684;&#x662F;&#x590D;&#x6742;&#x7684;&#x7F51;&#x7EDC;&#x3002;&#x7BA1;&#x7406;&#x8FD9;&#x79CD;&#x590D;&#x6742;&#x6027;&#x6210;&#x4E3A;&#x5168;&#x804C;&#x804C;&#x4E1A;&#xFF0C;&#x4ECE;&#x4E8B;&#x8FD9;&#x4E2A;&#x5DE5;&#x4F5C;&#x6210;&#x4E3A;&#x5E94;&#x7528;&#x5F00;&#x53D1;&#x56E2;&#x961F;&#x7684;&#x6301;&#x7EED;&#x74F6;&#x9888;&#x3002;&#x6B63;&#x5982;&#x6211;&#x4EEC;&#x5728;&#x8054;&#x5408;&#x6570;&#x636E;&#x6A21;&#x578B;&#x6240;&#x770B;&#x5230;&#x7684;&#xFF0C;&#x50CF;ESB&#x8FD9;&#x6837;&#x7684;&#x8054;&#x5408;&#x96C6;&#x6210;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x6210;&#x4E3A;&#x963B;&#x788D;&#x5E45;&#x5EA6;&#x7684;&#x5DE8;&#x5927;&#x96BE;&#x9898;&#x3002;</p>
<p>&#x8BF8;&#x5982;&#x5FAE;&#x670D;&#x52A1;&#x8FD9;&#x6837;&#x7684;&#x4E91;&#x539F;&#x751F;&#x67B6;&#x6784;&#x66F4;&#x503E;&#x5411;&#x4E8E;&#x559C;&#x6B22;&#x821E;&#x8E48;&#xFF0C;&#x5B83;&#x4EEC;&#x7C7B;&#x4F3C;&#x4E8E;&#x82AD;&#x857E;&#x821E;&#x4E2D;&#x7684;&#x821E;&#x8005;&#x3002;&#x5B83;&#x4EEC;&#x5C06;&#x5FC3;&#x667A;&#x653E;&#x7F6E;&#x5728;&#x7AEF;&#x70B9;&#x4E0A;&#xFF0C;&#x7C7B;&#x4F3C;&#x4E8E;Unix&#x67B6;&#x6784;&#x4E2D;&#x7684;&#x865A;&#x62DF;&#x7BA1;&#x9053;&#x548C;&#x667A;&#x80FD;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x653E;&#x5728;&#x96C6;&#x6210;&#x673A;&#x5236;&#x4E2D;&#x3002;&#x5F53;&#x821E;&#x53F0;&#x4E0A;&#x7684;&#x60C5;&#x51B5;&#x4E0E;&#x539F;&#x6765;&#x7684;&#x8BA1;&#x5212;&#x6709;&#x6240;&#x4E0D;&#x540C;&#x65F6;&#xFF0C;&#x6CA1;&#x6709;&#x5BFC;&#x6F14;&#x544A;&#x8BC9;&#x821E;&#x8005;&#x8BE5;&#x600E;&#x4E48;&#x505A;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x4ED6;&#x4EEC;&#x53EA;&#x662F;&#x9002;&#x5E94;&#x3002;&#x540C;&#x6837;&#xFF0C;&#x670D;&#x52A1;&#x901A;&#x8FC7;&#x5BA2;&#x6237;&#x7AEF;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x548C;&#x65AD;&#x8DEF;&#x5668;&#x7B49;&#x6A21;&#x5F0F;&#xFF0C;&#x9002;&#x5E94;&#x73AF;&#x5883;&#x4E2D;&#x4E0D;&#x65AD;&#x53D8;&#x5316;&#x7684;&#x5404;&#x79CD;&#x60C5;&#x51B5;&#x3002;</p>
<p>&#x867D;&#x7136;&#x67B6;&#x6784;&#x56FE;&#x770B;&#x8D77;&#x6765;&#x50CF;&#x4E00;&#x4E2A;&#x7F20;&#x6742;&#x7684;&#x7F51;&#x7EDC;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x7684;&#x590D;&#x6742;&#x6027;&#x5E76;&#x4E0D;&#x6BD4;&#x4F20;&#x7EDF;&#x7684;SOA&#x5927;&#x3002;&#x7F16;&#x6392;&#x7B80;&#x5355;&#x5730;&#x627F;&#x8BA4;&#x5E76;&#x66B4;&#x9732;&#x4E86;&#x7CFB;&#x7EDF;&#x7684;&#x539F;&#x6709;&#x7684;&#x590D;&#x6742;&#x6027;&#x3002;&#x518D;&#x6B21;&#xFF0C;&#x8FD9;&#x79CD;&#x8F6C;&#x53D8;&#x662F;&#x4E3A;&#x4E86;&#x652F;&#x6301;&#x4ECE;&#x4E91;&#x539F;&#x751F;&#x67B6;&#x6784;&#x4E2D;&#x5BFB;&#x6C42;&#x901F;&#x5EA6;&#x6240;&#x9700;&#x7684;&#x81EA;&#x6CBB;&#x3002;&#x56E2;&#x961F;&#x80FD;&#x591F;&#x9002;&#x5E94;&#x4E0D;&#x65AD;&#x53D8;&#x5316;&#x7684;&#x73AF;&#x5883;&#xFF0C;&#x800C;&#x65E0;&#x9700;&#x627F;&#x62C5;&#x4E0E;&#x5176;&#x4ED6;&#x56E2;&#x961F;&#x534F;&#x8C03;&#x7684;&#x5F00;&#x9500;&#xFF0C;&#x5E76;&#x907F;&#x514D;&#x4E86;&#x5728;&#x96C6;&#x4E2D;&#x7BA1;&#x7406;&#x7684;ESB&#x4E2D;&#x534F;&#x8C03;&#x53D8;&#x66F4;&#x6240;&#x9020;&#x6210;&#x7684;&#x5F00;&#x9500;&#x3002; </p>
<footer class="page-footer"><span class="copyright"><p><a href="https://gw.alipayobjects.com/mdn/site_comm/afts/img/A*HA0uRIfs6UIAAAAAAAAAAABjARQnAQ" data-lightbox="2fd927ee-fa64-4eca-8ed5-6bd72b573a3c" target="_blank">&#x70B9;&#x51FB;&#x5173;&#x6CE8;&#x3010;&#x4E91;&#x539F;&#x751F;&#x5E94;&#x7528;&#x67B6;&#x6784;&#x3011;&#x516C;&#x4F17;&#x53F7;&#x56DE;&#x590D;&#x3010;&#x52A0;&#x7FA4;&#x3011;&#x52A0;&#x5165;&#x5B66;&#x4E60;&#x7FA4;</a> | <a href="https://jimmysong.io/jobs/" target="_blank">&#x52A0;&#x5165;&#x8682;&#x8681;&#x91D1;&#x670D;&#x91D1;&#x878D;&#x79D1;&#x6280;&#xFF0C;&#x6784;&#x5EFA;&#x91D1;&#x878D;&#x7EA7;&#x4E91;&#x539F;&#x751F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;</a></p>Copyright &#xA9; <a href="https://jimmysong.io" target="_blank">jimmysong.io</a> 2017-2019 all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification"> Updated at 
2019-01-02 16:06:24
</span></footer></body></html>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="organizational-change.html" class="navigation navigation-prev " aria-label="Previous page: 2.2 组织变革">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="summary.html" class="navigation navigation-next " aria-label="Next page: 2.4 本章小结">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"2.3 技术变革","level":"1.3.3","depth":2,"next":{"title":"2.4 本章小结","level":"1.3.4","depth":2,"path":"chapter2/summary.md","ref":"chapter2/summary.md","articles":[]},"previous":{"title":"2.2 组织变革","level":"1.3.2","depth":2,"path":"chapter2/organizational-change.md","ref":"chapter2/organizational-change.md","articles":[]},"dir":"ltr"},"config":{"plugins":["github","codesnippet","splitter","page-toc-button","image-captions","editlink","back-to-top-button","-lunr","-search","search-plus","github-buttons@2.1.0","favicon","tbfed-pagefooter@^0.0.1","3-ba","ga","lightbox"],"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"<p><a href=https://gw.alipayobjects.com/mdn/site_comm/afts/img/A*HA0uRIfs6UIAAAAAAAAAAABjARQnAQ data-lightbox=2fd927ee-fa64-4eca-8ed5-6bd72b573a3c>点击关注【云原生应用架构】公众号回复【加群】加入学习群</a> | <a href=https://jimmysong.io/jobs/>加入蚂蚁金服金融科技，构建金融级云原生基础设施</a></p>Copyright © <a href=https://jimmysong.io>jimmysong.io</a> 2017-2019","modify_label":" Updated at ","modify_format":"YYYY-MM-DD HH:mm:ss"},"github":{"url":"https://github.com/rootsongjc/migrating-to-cloud-native-application-architectures"},"editlink":{"label":"编辑本页","multilingual":false,"base":"https://github.com/rootsongjc/migrating-to-cloud-native-application-architectures/tree/master/"},"splitter":{},"codesnippet":{},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"favicon":{"shortcut":"images/favicon.ico","bookmark":"images/favicon.ico"},"lightbox":{"jquery":true},"page-toc-button":{},"back-to-top-button":{},"github-buttons":{"repo":"rootsongjc/migrating-to-cloud-native-application-architectures","types":["star"],"size":"small"},"3-ba":{"configuration":"auto","token":"11f7d254cfa4e0ca44b175c66d379ecc"},"ga":{"configuration":"auto","token":"UA-93485976-1"},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"showLevel":false,"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"}},"search-plus":{},"image-captions":{"caption":"图片 - _CAPTION_","variable_name":"_pictures"}},"theme":"default","author":"Jimmy Song","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{"_pictures":[{"backlink":"chapter3/distributed-systems-recipes.html#fig1.4.2.1","level":"1.4.2","list_caption":"Figure: Spring Cloud Config Server","alt":"Spring Cloud Config Server","nro":1,"url":"../images/figure-3-1.jpg","index":1,"caption_template":"图片 - _CAPTION_","label":"Spring Cloud Config Server","attributes":{},"skip":false,"key":"1.4.2.1"},{"backlink":"chapter3/distributed-systems-recipes.html#fig1.4.2.2","level":"1.4.2","list_caption":"Figure: Example 3-1","alt":"Example 3-1","nro":2,"url":"../images/example-3-1.jpg","index":2,"caption_template":"图片 - _CAPTION_","label":"Example 3-1","attributes":{},"skip":false,"key":"1.4.2.2"},{"backlink":"chapter3/distributed-systems-recipes.html#fig1.4.2.3","level":"1.4.2","list_caption":"Figure: Example 3-2","alt":"Example 3-2","nro":3,"url":"../images/example-3-2.jpg","index":3,"caption_template":"图片 - _CAPTION_","label":"Example 3-2","attributes":{},"skip":false,"key":"1.4.2.3"},{"backlink":"chapter3/distributed-systems-recipes.html#fig1.4.2.4","level":"1.4.2","list_caption":"Figure: Figure 3-3","alt":"Figure 3-3","nro":4,"url":"../images/figure-3-3.jpg","index":4,"caption_template":"图片 - _CAPTION_","label":"Figure 3-3","attributes":{},"skip":false,"key":"1.4.2.4"},{"backlink":"chapter3/distributed-systems-recipes.html#fig1.4.2.5","level":"1.4.2","list_caption":"Figure: Example 3-3","alt":"Example 3-3","nro":5,"url":"../images/example-3-3.jpg","index":5,"caption_template":"图片 - _CAPTION_","label":"Example 3-3","attributes":{},"skip":false,"key":"1.4.2.5"},{"backlink":"chapter3/distributed-systems-recipes.html#fig1.4.2.6","level":"1.4.2","list_caption":"Figure: example-3-4","alt":"example-3-4","nro":6,"url":"../images/example-3-4.jpg","index":6,"caption_template":"图片 - _CAPTION_","label":"example-3-4","attributes":{},"skip":false,"key":"1.4.2.6"},{"backlink":"chapter3/distributed-systems-recipes.html#fig1.4.2.7","level":"1.4.2","list_caption":"Figure: Figure 3-4","alt":"Figure 3-4","nro":7,"url":"../images/figure-3-4.jpg","index":7,"caption_template":"图片 - _CAPTION_","label":"Figure 3-4","attributes":{},"skip":false,"key":"1.4.2.7"},{"backlink":"chapter3/distributed-systems-recipes.html#fig1.4.2.8","level":"1.4.2","list_caption":"Figure: Example 3-5-1","alt":"Example 3-5-1","nro":8,"url":"../images/example-3-5-1.jpg","index":8,"caption_template":"图片 - _CAPTION_","label":"Example 3-5-1","attributes":{},"skip":false,"key":"1.4.2.8"},{"backlink":"chapter3/distributed-systems-recipes.html#fig1.4.2.9","level":"1.4.2","list_caption":"Figure: Example-3-5-2","alt":"Example-3-5-2","nro":9,"url":"../images/example-3-5-2.jpg","index":9,"caption_template":"图片 - _CAPTION_","label":"Example-3-5-2","attributes":{},"skip":false,"key":"1.4.2.9"},{"backlink":"chapter3/distributed-systems-recipes.html#fig1.4.2.10","level":"1.4.2","list_caption":"Figure: Example 3-6","alt":"Example 3-6","nro":10,"url":"../images/example-3-6.jpg","index":10,"caption_template":"图片 - _CAPTION_","label":"Example 3-6","attributes":{},"skip":false,"key":"1.4.2.10"},{"backlink":"chapter3/distributed-systems-recipes.html#fig1.4.2.11","level":"1.4.2","list_caption":"Figure: Figure 3-5","alt":"Figure 3-5","nro":11,"url":"../images/figure-3-5.jpg","index":11,"caption_template":"图片 - _CAPTION_","label":"Figure 3-5","attributes":{},"skip":false,"key":"1.4.2.11"},{"backlink":"chapter3/distributed-systems-recipes.html#fig1.4.2.12","level":"1.4.2","list_caption":"Figure: Example 3-7","alt":"Example 3-7","nro":12,"url":"../images/example-3-7.jpg","index":12,"caption_template":"图片 - _CAPTION_","label":"Example 3-7","attributes":{},"skip":false,"key":"1.4.2.12"},{"backlink":"chapter3/distributed-systems-recipes.html#fig1.4.2.13","level":"1.4.2","list_caption":"Figure: Example 3-8","alt":"Example 3-8","nro":13,"url":"../images/example-3-8.jpg","index":13,"caption_template":"图片 - _CAPTION_","label":"Example 3-8","attributes":{},"skip":false,"key":"1.4.2.13"},{"backlink":"chapter3/distributed-systems-recipes.html#fig1.4.2.14","level":"1.4.2","list_caption":"Figure: Figure 3-7","alt":"Figure 3-7","nro":14,"url":"../images/figure-3-7.jpg","index":14,"caption_template":"图片 - _CAPTION_","label":"Figure 3-7","attributes":{},"skip":false,"key":"1.4.2.14"},{"backlink":"chapter3/distributed-systems-recipes.html#fig1.4.2.15","level":"1.4.2","list_caption":"Figure: Example 3-9","alt":"Example 3-9","nro":15,"url":"../images/example-3-9.jpg","index":15,"caption_template":"图片 - _CAPTION_","label":"Example 3-9","attributes":{},"skip":false,"key":"1.4.2.15"},{"backlink":"chapter3/distributed-systems-recipes.html#fig1.4.2.16","level":"1.4.2","list_caption":"Figure: figure 3-10","alt":"figure 3-10","nro":16,"url":"../images/example-3-10.jpg","index":16,"caption_template":"图片 - _CAPTION_","label":"figure 3-10","attributes":{},"skip":false,"key":"1.4.2.16"}]},"title":"迁移到云原生应用架构","language":"zh-hans","links":{"sidebar":{"Cloud Native Python（Python云原生） - 使用Python和React构建云原生应用":"https://jimmysong.io/posts/cloud-native-python","ServiceMesher社区":"http://www.servicemesher.com","SOFAMesh - 基于Istio的大规模服务网格解决方案":"https://github.com/alipay/sofa-mesh","Cloud Native Java（云原生Java）-  Spring Boot、Spring Cloud与Cloud Foundry弹性系统设计":"https://jimmysong.io/posts/cloud-native-java","SOFAMosn - Golang版的高性能Service Mesh Sidecar代理":"https://github.com/alipay/sofa-mosn","Awesome Service Mesh":"http://www.servicemesher.com/awesome-servicemesh","Istio Handbook - Istio服务网格进阶实战":"https://jimmysong.io/istio-handbook","Jimmy Song":"https://jimmysong.io","Awesome Cloud Native":"https://jimmysong.io/awesome-cloud-native","Cloud Native Go - 基于Go和React的web云原生应用构建指南":"https://jimmysong.io/posts/cloud-native-go"}},"gitbook":"*","description":"Migrating to Cloud Native Application Architectures 中文版"},"file":{"path":"chapter2/technical-change.md","mtime":"2019-01-02T08:06:24.059Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-10-12T04:01:17.495Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-page-toc-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-editlink/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-plus/jquery.mark.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-plus/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-3-ba/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-ga/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lightbox/jquery.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lightbox/lightbox.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

