
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>3.1 分解原架构 · 迁移到云原生应用架构</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="Jimmy Song">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-toc-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search-plus/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-lightbox/lightbox.min.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="distributed-systems-recipes.html" />
    
    
    <link rel="prev" href="migration-cookbook.html" />
    

    
        <link rel="shortcut icon" href='../images/favicon.ico' type="image/x-icon">
    
    
        <link rel="bookmark" href='../images/favicon.ico' type="image/x-icon">
    
    
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"repo":"rootsongjc/migrating-to-cloud-native-application-architectures","types":["star"],"size":"small"};
    </script>

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://jimmysong.io" target="_blank" class="custom-link">回到首页</a>
        </li>
    
        
        <li>
            <a href="https://cloudnative.to" target="_blank" class="custom-link">云原生社区</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../chapter1/the-rise-of-cloud-native.html">
            
                <a href="../chapter1/the-rise-of-cloud-native.html">
            
                    
                    1. 云原生的崛起
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../chapter1/why-cloud-native-application-architectures.html">
            
                <a href="../chapter1/why-cloud-native-application-architectures.html">
            
                    
                    1.1 为何使用云原生应用架构？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="../chapter1/defining-cloud-native-architectures.html">
            
                <a href="../chapter1/defining-cloud-native-architectures.html">
            
                    
                    1.2 云原生架构的定义
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="../chapter1/summary.html">
            
                <a href="../chapter1/summary.html">
            
                    
                    1.3 本章小结
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../chapter2/changes-needed.html">
            
                <a href="../chapter2/changes-needed.html">
            
                    
                    2. 在变革中前行
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../chapter2/cultural-change.html">
            
                <a href="../chapter2/cultural-change.html">
            
                    
                    2.1 文化变革
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../chapter2/organizational-change.html">
            
                <a href="../chapter2/organizational-change.html">
            
                    
                    2.2 组织变革
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="../chapter2/technical-change.html">
            
                <a href="../chapter2/technical-change.html">
            
                    
                    2.3 技术变革
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="../chapter2/summary.html">
            
                <a href="../chapter2/summary.html">
            
                    
                    2.4 本章小结
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="migration-cookbook.html">
            
                <a href="migration-cookbook.html">
            
                    
                    3. 迁移指南
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.4.1" data-path="decomposition-recipes.html">
            
                <a href="decomposition-recipes.html">
            
                    
                    3.1 分解原架构
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="distributed-systems-recipes.html">
            
                <a href="distributed-systems-recipes.html">
            
                    
                    3.2 使用分布式系统
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="summary.html">
            
                <a href="summary.html">
            
                    
                    3.3 本章小结
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >3.1 分解原架构</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div class="search-plus" id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <html><head></head><body><h1 id="&#x5206;&#x89E3;&#x539F;&#x67B6;&#x6784;">&#x5206;&#x89E3;&#x539F;&#x67B6;&#x6784;</h1>
<p>&#x5728;&#x548C;&#x5BA2;&#x6237;&#x8BA8;&#x8BBA;&#x5206;&#x89E3;&#x6570;&#x636E;&#x3001;&#x670D;&#x52A1;&#x548C;&#x56E2;&#x961F;&#x540E;&#xFF0C;&#x5BA2;&#x6237;&#x7ECF;&#x5E38;&#x5411;&#x6211;&#x63D0;&#x51FA;&#x8FD9;&#x6837;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x201C;&#x592A;&#x68D2;&#x4E86;&#xFF01;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x8981;&#x600E;&#x6837;&#x5B9E;&#x73B0;&#x5462;&#xFF1F;&#x201D;&#x8FD9;&#x662F;&#x4E2A;&#x597D;&#x95EE;&#x9898;&#x3002;&#x5982;&#x4F55;&#x62C6;&#x5206;&#x5DF2;&#x6709;&#x7684;&#x5355;&#x4F53;&#x5E94;&#x7528;&#x5E76;&#x628A;&#x4ED6;&#x4EEC;&#x8FC1;&#x79FB;&#x4E0A;&#x4E91;&#x5462;&#xFF1F;</p>
<p>&#x4E8B;&#x5B9E;&#x8BC1;&#x660E;&#xFF0C;&#x6211;&#x5DF2;&#x7ECF;&#x770B;&#x5230;&#x4E86;&#x5F88;&#x591A;&#x6210;&#x529F;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x4F7F;&#x7528;&#x589E;&#x91CF;&#x8FC1;&#x79FB;&#x8FD9;&#x79CD;&#x76F8;&#x5F53;&#x53EF;&#x590D;&#x5236;&#x7684;&#x6A21;&#x5F0F;&#xFF0C;&#x6211;&#x73B0;&#x5728;&#x5411;&#x6211;&#x6240;&#x6709;&#x7684;&#x5BA2;&#x6237;&#x63A8;&#x8350;&#x8FD9;&#x79CD;&#x6A21;&#x5F0F;&#x3002;SoundCloud&#x548C;Karma&#x5C31;&#x662F;&#x516C;&#x5F00;&#x7684;&#x4F8B;&#x5B50;&#x3002;</p>
<p>&#x672C;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x8BB2;&#x89E3;&#x5982;&#x4F55;&#x4E00;&#x6B65;&#x6B65;&#x5730;&#x5C06;&#x5355;&#x4F53;&#x670D;&#x52A1;&#x5206;&#x89E3;&#x5E76;&#x5C06;&#x5B83;&#x4EEC;&#x8FC1;&#x79FB;&#x5230;&#x4E91;&#x4E0A;&#x3002;</p>
<h2 id="&#x65B0;&#x529F;&#x80FD;&#x4F7F;&#x7528;&#x5FAE;&#x670D;&#x52A1;&#x5F62;&#x5F0F;">&#x65B0;&#x529F;&#x80FD;&#x4F7F;&#x7528;&#x5FAE;&#x670D;&#x52A1;&#x5F62;&#x5F0F;</h2>
<p>&#x60A8;&#x53EF;&#x80FD;&#x611F;&#x5230;&#x5F88;&#x60CA;&#x5947;&#xFF0C;&#x7B2C;&#x4E00;&#x6B65;&#x4E0D;&#x662F;&#x5206;&#x89E3;&#x5355;&#x4F53;&#x5E94;&#x7528;&#x3002;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x60A8;&#x4F9D;&#x7136;&#x8981;&#x5728;&#x5355;&#x4F53;&#x5E94;&#x7528;&#x4E2D;&#x6784;&#x5EFA;&#x670D;&#x52A1;&#x3002; &#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x5982;&#x679C;&#x60A8;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x65B0;&#x7684;&#x529F;&#x80FD;&#x6765;&#x6784;&#x5EFA;&#xFF0C;&#x90A3;&#x4E48;&#x60A8;&#x751A;&#x81F3;&#x4E0D;&#x5E94;&#x8BE5;&#x8003;&#x8651;&#x8FD9;&#x4E2A;&#x5206;&#x89E3;&#x3002;&#xFF08;&#x9274;&#x4E8E;&#x6211;&#x4EEC;&#x7684;&#x4E3B;&#x8981;&#x52A8;&#x673A;&#x662F;&#x901F;&#x5EA6;&#xFF0C;&#x60A8;&#x5982;&#x4F55;&#x7EF4;&#x6301;&#x539F;&#x72B6;&#x8FD8;&#x80FD;&#x83B7;&#x53D6;&#x901F;&#x5EA6;&#x5462;&#xFF1F;&#xFF09;</p>
<blockquote>
<p>&#x56E2;&#x961F;&#x51B3;&#x5B9A;&#xFF0C;&#x5904;&#x7406;&#x67B6;&#x6784;&#x53D8;&#x5316;&#x7684;&#x6700;&#x4F73;&#x65B9;&#x6CD5;&#x4E0D;&#x662F;&#x7ACB;&#x5373;&#x5206;&#x89E3;Mothership&#x67B6;&#x6784;&#xFF0C;&#x800C;&#x662F;&#x4E0D;&#x6DFB;&#x52A0;&#x4EFB;&#x4F55;&#x65B0;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x6211;&#x4EEC;&#x6240;&#x6709;&#x7684;&#x65B0;&#x529F;&#x80FD;&#x4EE5;&#x5FAE;&#x670D;&#x52A1;&#x5F62;&#x5F0F;&#x6784;&#x5EFA;&#x2026;</p>
<p>&#x2014;&#x2014;Phil Calcado, SoundCloud</p>
</blockquote>
<p>&#x6240;&#x4EE5;&#x4E0D;&#x8981;&#x7EE7;&#x7EED;&#x518D;&#x5411;&#x5355;&#x4F53;&#x5E94;&#x7528;&#x4E2D;&#x589E;&#x52A0;&#x4EE3;&#x7801;&#xFF0C;&#x5C06;&#x6240;&#x6709;&#x7684;&#x65B0;&#x529F;&#x80FD;&#x4EE5;&#x5FAE;&#x670D;&#x52A1;&#x7684;&#x5F62;&#x5F0F;&#x6784;&#x5EFA;&#x3002;&#x8FD9;&#x662F;&#x7B2C;&#x4E00;&#x6B65;&#x5C31;&#x8981;&#x8003;&#x8651;&#x597D;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x4ECE;&#x5934;&#x5F00;&#x59CB;&#x6784;&#x67B6;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x6BD4;&#x5206;&#x89E3;&#x4E00;&#x4E2A;&#x5355;&#x4F53;&#x5E94;&#x7528;&#x5E76;&#x63D0;&#x51FA;&#x670D;&#x52A1;&#x51FA;&#x6765;&#x5BB9;&#x6613;&#x548C;&#x5FEB;&#x901F;&#x7684;&#x591A;&#x3002;</p>
<p>&#x7136;&#x800C;&#x6709;&#x4E00;&#x70B9;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#xFF0C;&#x5C31;&#x662F;&#x65B0;&#x6784;&#x5EFA;&#x7684;&#x5FAE;&#x670D;&#x52A1;&#x9700;&#x8981;&#x4E0E;&#x5DF2;&#x6709;&#x7684;&#x5355;&#x4F53;&#x5E94;&#x7528;&#x901A;&#x4FE1;&#x624D;&#x80FD;&#x5B8C;&#x6210;&#x5DE5;&#x4F5C;&#xFF0C;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x600E;&#x4E48;&#x89E3;&#x51B3;&#xFF1F;</p>
<h2 id="&#x9694;&#x79BB;&#x5C42;">&#x9694;&#x79BB;&#x5C42;</h2>
<blockquote>
<p>&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x5927;&#x90E8;&#x5206;&#x7684;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x90FD;&#x662F;&#x57FA;&#x4E8E;Rails&#x7684;&#x5355;&#x4F53;&#x5E94;&#x7528;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x7684;&#x5FAE;&#x670D;&#x52A1;&#x57FA;&#x672C;&#x4E5F;&#x8981;&#x8DDF;&#x5B83;&#x4EEC;&#x901A;&#x4FE1;&#x3002;</p>
<p>&#x2014;&#x2014;Phil Calcado, SoundCloud</p>
</blockquote>
<p>Eric Evans&#xFF08;Addison-Wesley&#xFF09;&#x7684;&#x9886;&#x57DF;&#x9A71;&#x52A8;&#x8BBE;&#x8BA1;&#xFF08;DDD&#xFF09;&#x8BA8;&#x8BBA;&#x4E86;&#x9694;&#x79BB;&#x5C42;&#x7684;&#x601D;&#x60F3;&#x3002; &#x5176;&#x76EE;&#x7684;&#x662F;&#x5141;&#x8BB8;&#x4E24;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;&#x96C6;&#x6210;&#xFF0C;&#x800C;&#x4E0D;&#x5141;&#x8BB8;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x7834;&#x574F;&#x53E6;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x3002; &#x5F53;&#x60A8;&#x5C06;&#x65B0;&#x529F;&#x80FD;&#x96C6;&#x6210;&#x5230;&#x5FAE;&#x670D;&#x52A1;&#x4E2D;&#x65F6;&#xFF0C;&#x4E0D;&#x5E0C;&#x671B;&#x8FD9;&#x4E9B;&#x65B0;&#x670D;&#x52A1;&#x4E0E;&#x6574;&#x4F53;&#x7684;&#x7D27;&#x5BC6;&#x7ED3;&#x5408;&#xFF0C;&#x8BA9;&#x4ED6;&#x4EEC;&#x6DF1;&#x5165;&#x4E86;&#x89E3;&#x6574;&#x4F53;&#x7684;&#x5185;&#x90E8;&#x7ED3;&#x6784;&#x3002; &#x9694;&#x79BB;&#x5C42;&#x662F;&#x521B;&#x5EFA;API&#x534F;&#x8BAE;&#x7684;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x4F7F;&#x5F97;&#x6574;&#x4F53;&#x67B6;&#x6784;&#x770B;&#x8D77;&#x6765;&#x50CF;&#x5176;&#x4ED6;&#x5FAE;&#x670D;&#x52A1;&#x3002;</p>
<p>Evans&#x5C06;&#x9694;&#x79BB;&#x5C42;&#x7684;&#x5B9E;&#x65BD;&#x5212;&#x5206;&#x4E3A;&#x4E09;&#x4E2A;&#x5B50;&#x6A21;&#x5757;&#xFF0C;&#x524D;&#x4E24;&#x4E2A;&#x4EE3;&#x8868;&#x7740;&#x7ECF;&#x5178;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x3002;</p>
<p>&#xFF08;&#x6765;&#x81EA;Gamma&#x7B49;&#x4EBA;&#xFF0C;Design Patterns&#xFF1A;Elements of Reusable Object-Oriented So ware [Addison Wesley]&#xFF09;&#xFF1A;</p>
<p><strong>&#x8868;&#x73B0;&#x5C42;</strong></p>
<p>&#x8868;&#x73B0;&#x5C42;&#x7684;&#x76EE;&#x7684;&#x662F;&#x4E3A;&#x4E86;&#x7B80;&#x5316;&#x4E0E;&#x5355;&#x4F53;&#x5E94;&#x7528;&#x63A5;&#x53E3;&#x96C6;&#x6210;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x5355;&#x4F53;&#x5E94;&#x7528;&#x8BBE;&#x8BA1;&#x4E4B;&#x521D;&#x5F88;&#x53EF;&#x80FD;&#x6CA1;&#x6709;&#x8003;&#x8651;&#x8FD9;&#x4E2A;&#x96C6;&#x6210;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x5F15;&#x5165;&#x4E86;&#x8868;&#x73B0;&#x5C42;&#x6765;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x5B83;&#x6CA1;&#x6709;&#x6539;&#x53D8;&#x5355;&#x4F53;&#x5E94;&#x7528;&#x7684;&#x6A21;&#x578B;&#xFF0C;&#x8FD9;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x6CE8;&#x610F;&#x4E0D;&#x8981;&#x5C06;&#x8F6C;&#x6362;&#x548C;&#x96C6;&#x6210;&#x95EE;&#x9898;&#x8026;&#x5408;&#x5230;&#x4E00;&#x8D77;&#x3002;</p>
<p><strong>&#x9002;&#x914D;&#x5668;</strong></p>
<p>&#x6211;&#x4EEC;&#x7528;&#x9002;&#x914D;&#x5668;&#x6765;&#x5B9A;&#x4E49;service&#xFF0C;&#x7528;&#x6765;&#x63D0;&#x4F9B;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x7684;&#x65B0;&#x529F;&#x80FD;&#x3002;&#x5B83;&#x77E5;&#x9053;&#x5982;&#x4F55;&#x83B7;&#x53D6;&#x7CFB;&#x7EDF;&#x8BF7;&#x6C42;&#x5E76;&#x4F7F;&#x7528;&#x534F;&#x8BAE;&#x5C06;&#x8BF7;&#x6C42;&#x53D1;&#x9001;&#x7ED9;&#x5355;&#x4F53;&#x5E94;&#x7528;&#x7684;&#x8868;&#x5C42;&#x3002;</p>
<p><strong>&#x8F6C;&#x6362;&#x5668;</strong></p>
<p>&#x8F6C;&#x6362;&#x5668;&#x7684;&#x804C;&#x8D23;&#x662F;&#x5728;&#x5355;&#x4F53;&#x5E94;&#x7528;&#x4E0E;&#x65B0;&#x7684;&#x5FAE;&#x670D;&#x52A1;&#x4E4B;&#x95F4;&#x8FDB;&#x884C;&#x8BF7;&#x6C42;&#x548C;&#x54CD;&#x5E94;&#x7684;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x8F6C;&#x6362;&#x3002;</p>
<p>&#x8FD9;&#x4E09;&#x4E2A;&#x677E;&#x8026;&#x5408;&#x7684;&#x7EC4;&#x4EF6;&#x89E3;&#x51B3;&#x4E86;&#x4EE5;&#x4E0B;&#x4E09;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;</p>
<ol>
<li>&#x7CFB;&#x7EDF;&#x96C6;&#x6210;</li>
<li>&#x534F;&#x8BAE;&#x8F6C;&#x6362;</li>
<li>&#x6A21;&#x578B;&#x8F6C;&#x6362;</li>
</ol>
<p>&#x5269;&#x4E0B;&#x7684;&#x662F;&#x901A;&#x4FE1;&#x94FE;&#x8DEF;&#x7684;&#x4F4D;&#x7F6E;&#x3002;&#x5728;DDD&#x4E2D;&#xFF0C;Evans&#x8BA8;&#x8BBA;&#x4E86;&#x4E24;&#x79CD;&#x9009;&#x62E9;&#x3002;&#x5F53;&#x60A8;&#x65E0;&#x6CD5;&#x8BBF;&#x95EE;&#x6216;&#x66F4;&#x6539;&#x9057;&#x7559;&#x7CFB;&#x7EDF;&#x65F6;&#xFF0C;&#x7B2C;&#x4E00;&#xFF0C;&#x5C06;&#x7CFB;&#x7EDF;&#x7684;&#x8868;&#x73B0;&#x5C42;&#x8BBE;&#x7F6E;&#x4E3A;&#x4E3B;&#x8981;&#x529F;&#x80FD;&#x3002;&#x6211;&#x4EEC;&#x7684;&#x91CD;&#x70B9;&#x5728;&#x4E8E;&#x6211;&#x4EEC;&#x63A7;&#x5236;&#x7684;&#x6574;&#x4F53;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x5C06;&#x503E;&#x5411;&#x4E8E;Evans&#x7684;&#x7B2C;&#x4E8C;&#x4E2A;&#x5EFA;&#x8BAE;&#xFF0C;&#x9002;&#x914D;&#x5668;&#x5230;&#x8868;&#x73B0;&#x5C42;&#x3002;&#x4F7F;&#x7528;&#x8FD9;&#x79CD;&#x66FF;&#x4EE3;&#x65B9;&#x6CD5;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x8868;&#x73B0;&#x5C42;&#x6784;&#x7B51;&#x5230;&#x5355;&#x4F53;&#x4E2D;&#xFF0C;&#x5141;&#x8BB8;&#x5728;&#x9002;&#x914D;&#x5668;&#x548C;&#x8868;&#x73B0;&#x5C42;&#x4E4B;&#x95F4;&#x8FDB;&#x884C;&#x901A;&#x4FE1;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x4E3A;&#x6B64;&#x4E13;&#x95E8;&#x6784;&#x5EFA;&#x7684;&#x7EC4;&#x4EF6;&#x4E4B;&#x95F4;&#x521B;&#x5EFA;&#x8FDE;&#x63A5;&#x66F4;&#x5BB9;&#x6613;&#x3002;</p>
<p>&#x6700;&#x540E;&#xFF0C;&#x8981;&#x6CE8;&#x610F;&#x9694;&#x79BB;&#x5C42;&#x53EF;&#x4EE5;&#x4FC3;&#x8FDB;&#x53CC;&#x5411;&#x901A;&#x4FE1;&#x3002; &#x6B63;&#x5982;&#x6211;&#x4EEC;&#x65B0;&#x7684;&#x5FAE;&#x670D;&#x52A1;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x4E0E;&#x6574;&#x4F53;&#x8FDB;&#x884C;&#x901A;&#x4FE1;&#x4EE5;&#x5B8C;&#x6210;&#x5DE5;&#x4F5C;&#x4E00;&#x6837;&#xFF0C;&#x53CD;&#x4E4B;&#x4EA6;&#x7136;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5F53;&#x6211;&#x4EEC;&#x8FDB;&#x5165;&#x4E0B;&#x4E00;&#x9636;&#x6BB5;&#x65F6;&#x3002;</p>
<h2 id="&#x627C;&#x6740;&#x5355;&#x4F53;&#x5E94;&#x7528;">&#x627C;&#x6740;&#x5355;&#x4F53;&#x5E94;&#x7528;</h2>
<blockquote>
<p>&#x5728;&#x67B6;&#x6784;&#x8C03;&#x6574;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x56E2;&#x961F;&#x53EF;&#x4EE5;&#x5728;&#x66F4;&#x52A0;&#x7075;&#x6D3B;&#x7684;&#x73AF;&#x5883;&#x4E2D;&#x81EA;&#x7531;&#x6784;&#x5EFA;&#x65B0;&#x529F;&#x80FD;&#x548C;&#x589E;&#x5F3A;&#x529F;&#x80FD;&#x3002; &#x7136;&#x800C;&#xFF0C;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x95EE;&#x9898;&#x4ECD;&#x7136;&#x5B58;&#x5728;&#xFF1A;&#x6211;&#x4EEC;&#x5982;&#x4F55;&#x4ECE;&#x540D;&#x4E3A;Mothership&#x7684;&#x5355;&#x4F53;Rails&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x63D0;&#x53D6;&#x529F;&#x80FD;&#xFF1F;</p>
<p>&#x2014;&#x2014;Pilil Calcado&#xFF0C;SoundCloud</p>
</blockquote>
<p>&#x6211;&#x4ECE;Martin Fowler&#x7684;&#x9898;&#x4E3A;&#x201C;&#x627C;&#x6740;&#x5E94;&#x7528;&#x201D;&#x7684;&#x6587;&#x7AE0;&#x4E2D;&#x501F;&#x7528;&#x4E86;&#x201C;&#x627C;&#x6740;&#x5DE8;&#x77F3;&#x201D;&#x7684;&#x60F3;&#x6CD5;&#x3002; &#x5728;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x4E2D;&#xFF0C;Fowler&#x89E3;&#x91CA;&#x4E86;&#x9010;&#x6E10;&#x521B;&#x9020;&#x201C;&#x56F4;&#x7ED5;&#x65E7;&#x7CFB;&#x7EDF;&#x8FB9;&#x7F18;&#x7684;&#x65B0;&#x7CFB;&#x7EDF;&#xFF0C;&#x8BA9;&#x5B83;&#x51E0;&#x5E74;&#x6765;&#x6162;&#x6162;&#x589E;&#x957F;&#xFF0C;&#x76F4;&#x5230;&#x65E7;&#x7CFB;&#x7EDF;&#x88AB;&#x627C;&#x6740;&#x201D;&#x7684;&#x60F3;&#x6CD5;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x540C;&#x6837;&#x9002;&#x7528;&#x4E8E;&#x6211;&#x4EEC;&#x3002;&#x901A;&#x8FC7;&#x63D0;&#x53D6;&#x7684;&#x5FAE;&#x670D;&#x52A1;&#x548C;&#x5176;&#x4ED6;&#x9694;&#x79BB;&#x5C42;&#x7684;&#x7EC4;&#x5408;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x56F4;&#x7ED5;&#x73B0;&#x6709;&#x5355;&#x4F53;&#x7684;&#x8FB9;&#x7F18;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x4E91;&#x539F;&#x751F;&#x7CFB;&#x7EDF;&#x3002;</p>
<p>&#x4E24;&#x4E2A;&#x6807;&#x51C6;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x9009;&#x62E9;&#x8981;&#x63D0;&#x53D6;&#x54EA;&#x4E9B;&#x7EC4;&#x4EF6;&#xFF1A;</p>
<ol>
<li>SoundCloud&#x6307;&#x51FA;&#x4E86;&#x7B2C;&#x4E00;&#x4E2A;&#x6807;&#x51C6;&#xFF1A;&#x8BC6;&#x522B;&#x5355;&#x4F53;&#x4E2D;&#x7684;&#x6709;&#x754C;&#x4E0A;&#x4E0B;&#x6587;&#x3002;&#x5982;&#x679C;&#x60A8;&#x56DE;&#x60F3;&#x8D77;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x8BA8;&#x8BBA;&#x6709;&#x9650;&#x4E0A;&#x4E0B;&#x6587;&#xFF0C;&#x5B83;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x5185;&#x90E8;&#x4E00;&#x81F4;&#x7684;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x3002;&#x6211;&#x4EEC;&#x7684;&#x5355;&#x4F53;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x6781;&#x6709;&#x53EF;&#x80FD;&#x4E0D;&#x662F;&#x5185;&#x90E8;&#x4E00;&#x81F4;&#x7684;&#x3002;&#x73B0;&#x5728;&#x662F;&#x5F00;&#x59CB;&#x8BC6;&#x522B;&#x5B50;&#x6A21;&#x578B;&#x7684;&#x65F6;&#x5019;&#x4E86;&#xFF0C;&#x91CC;&#x9762;&#x6709;&#x6211;&#x4EEC;&#x8981;&#x63D0;&#x53D6;&#x7684;&#x5019;&#x9009;&#x8005;&#x3002;</li>
<li>&#x7B2C;&#x4E8C;&#x4E2A;&#x6807;&#x51C6;&#x662F;&#x4F18;&#x5148;&#x8003;&#x8651;&#x7684;&#xFF1A;&#x5728;&#x4F17;&#x591A;&#x7684;&#x5019;&#x9009;&#x8005;&#x4E2D;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x9996;&#x5148;&#x63D0;&#x53D6;&#x54EA;&#x4E00;&#x4E2A;&#x5462;&#xFF1F;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x56DE;&#x987E;&#x4E00;&#x4E0B;&#x8FC1;&#x79FB;&#x5230;&#x4E91;&#x539F;&#x751F;&#x67B6;&#x6784;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x539F;&#x56E0;&#xFF1A;&#x521B;&#x65B0;&#x901F;&#x5EA6;&#x3002;&#x4EC0;&#x4E48;&#x5019;&#x9009;&#x5FAE;&#x670D;&#x52A1;&#x5C06;&#x6700;&#x53D7;&#x76CA;&#x4E8E;&#x521B;&#x65B0;&#x901F;&#x5EA6;&#xFF1F;&#x6211;&#x4EEC;&#x663E;&#x7136;&#x5E0C;&#x671B;&#x9009;&#x62E9;&#x90A3;&#x4E9B;&#x6B63;&#x5728;&#x6539;&#x53D8;&#x6211;&#x4EEC;&#x5F53;&#x524D;&#x4E1A;&#x52A1;&#x9700;&#x6C42;&#x7684;&#x670D;&#x52A1;&#x3002;&#x770B;&#x770B;&#x5355;&#x4F53;&#x5E94;&#x7528;&#x7684;&#x79EF;&#x538B;&#x3002;&#x786E;&#x5B9A;&#x9700;&#x8981;&#x66F4;&#x6539;&#x7684;&#x4EE3;&#x7801;&#x7684;&#x533A;&#x57DF;&#xFF0C;&#x4EE5;&#x4FBF;&#x63D0;&#x4EA4;&#x66F4;&#x6539;&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x8FDB;&#x884C;&#x6240;&#x9700;&#x66F4;&#x6539;&#x4E4B;&#x524D;&#x63D0;&#x53D6;&#x9002;&#x5F53;&#x7684;&#x6709;&#x754C;&#x4E0A;&#x4E0B;&#x6587;&#x3002;</li>
</ol>
<h2 id="&#x6F5C;&#x5728;&#x7684;&#x7ED3;&#x675F;&#x72B6;&#x6001;">&#x6F5C;&#x5728;&#x7684;&#x7ED3;&#x675F;&#x72B6;&#x6001;</h2>
<p>&#x6211;&#x4EEC;&#x600E;&#x4E48;&#x77E5;&#x9053;&#x4F55;&#x65F6;&#x7ED3;&#x675F;&#xFF1F;&#x4E0B;&#x9762;&#x6709;&#x4E24;&#x4E2A;&#x57FA;&#x672C;&#x7684;&#x7ED3;&#x675F;&#x72B6;&#x6001;&#xFF1A;</p>
<ol>
<li>&#x5355;&#x4F53;&#x67B6;&#x6784;&#x5DF2;&#x7ECF;&#x88AB;&#x5B8C;&#x5168;&#x627C;&#x6740;&#x3002;&#x6240;&#x6709;&#x7684;&#x6709;&#x754C;&#x4E0A;&#x4E0B;&#x6587;&#x90FD;&#x88AB;&#x63D0;&#x53D6;&#x4E3A;&#x5FAE;&#x670D;&#x52A1;&#x3002;&#x6700;&#x540E;&#x4E00;&#x6B65;&#x662F;&#x786E;&#x5B9A;&#x6D88;&#x9664;&#x4E0D;&#x518D;&#x9700;&#x8981;&#x9694;&#x79BB;&#x5C42;&#x7684;&#x673A;&#x4F1A;&#x3002;</li>
<li>&#x5355;&#x4F53;&#x67B6;&#x6784;&#x88AB;&#x627C;&#x6740;&#x5230;&#x4E86;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x70B9;&#xFF1A;&#x989D;&#x5916;&#x670D;&#x52A1;&#x63D0;&#x53D6;&#x7684;&#x6210;&#x672C;&#x8D85;&#x8FC7;&#x5FC5;&#x8981;&#x5F00;&#x53D1;&#x52AA;&#x529B;&#x7684;&#x56DE;&#x62A5;&#x3002; &#x5355;&#x4F53;&#x7684;&#x4E00;&#x4E9B;&#x90E8;&#x5206;&#x53EF;&#x80FD;&#x76F8;&#x5F53;&#x7A33;&#x5B9A;&#x2014;&#x2014;&#x5B83;&#x4EEC;&#x51E0;&#x5E74;&#x6765;&#x90FD;&#x6CA1;&#x6709;&#x6539;&#x53D8;&#xFF0C;&#x8FD8;&#x662F;&#x4E00;&#x76F4;&#x90FD;&#x5728;&#x8FD0;&#x884C;&#x5F97;&#x597D;&#x597D;&#x7684;&#x3002;&#x8FC1;&#x79FB;&#x8FD9;&#x4E9B;&#x90E8;&#x5206;&#x53EF;&#x80FD;&#x6CA1;&#x6709;&#x592A;&#x5927;&#x7684;&#x4EF7;&#x503C;&#xFF0C;&#x7EF4;&#x6301;&#x5FC5;&#x8981;&#x7684;&#x9694;&#x79BB;&#x5C42;&#x4E0E;&#x5176;&#x96C6;&#x6210;&#x7684;&#x6210;&#x672C;&#x8DB3;&#x591F;&#x4F4E;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x957F;&#x671F;&#x8D1F;&#x62C5;&#x3002; </li>
</ol>
<footer class="page-footer"><span class="copyright">Copyright &#xA9; 2017-2020 | Distributed under <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/deed.zh" target="_blank">CC BY 4.0</a> | <a href="https://jimmysong.io" target="_blank">jimmysong.io</a> all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification"> Updated at 
2019-10-13 20:18:37
</span></footer></body></html>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="migration-cookbook.html" class="navigation navigation-prev " aria-label="Previous page: 3. 迁移指南">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="distributed-systems-recipes.html" class="navigation navigation-next " aria-label="Next page: 3.2 使用分布式系统">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"3.1 分解原架构","level":"1.4.1","depth":2,"next":{"title":"3.2 使用分布式系统","level":"1.4.2","depth":2,"path":"chapter3/distributed-systems-recipes.md","ref":"chapter3/distributed-systems-recipes.md","articles":[]},"previous":{"title":"3. 迁移指南","level":"1.4","depth":1,"path":"chapter3/migration-cookbook.md","ref":"chapter3/migration-cookbook.md","articles":[{"title":"3.1 分解原架构","level":"1.4.1","depth":2,"path":"chapter3/decomposition-recipes.md","ref":"chapter3/decomposition-recipes.md","articles":[]},{"title":"3.2 使用分布式系统","level":"1.4.2","depth":2,"path":"chapter3/distributed-systems-recipes.md","ref":"chapter3/distributed-systems-recipes.md","articles":[]},{"title":"3.3 本章小结","level":"1.4.3","depth":2,"path":"chapter3/summary.md","ref":"chapter3/summary.md","articles":[]}]},"dir":"ltr"},"config":{"plugins":["github","codesnippet","splitter","page-toc-button","editlink","back-to-top-button","-lunr","-search","search-plus","github-buttons@2.1.0","favicon","tbfed-pagefooter@^0.0.1","3-ba","ga","lightbox"],"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright © 2017-2020 | Distributed under <a href=https://creativecommons.org/licenses/by-nc-sa/4.0/deed.zh>CC BY 4.0</a> | <a href=https://jimmysong.io>jimmysong.io</a>","modify_label":" Updated at ","modify_format":"YYYY-MM-DD HH:mm:ss"},"github":{"url":"https://github.com/rootsongjc/migrating-to-cloud-native-application-architectures"},"editlink":{"label":"编辑本页","multilingual":false,"base":"https://github.com/rootsongjc/migrating-to-cloud-native-application-architectures/tree/master/"},"splitter":{},"codesnippet":{},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"favicon":{"shortcut":"images/favicon.ico","bookmark":"images/favicon.ico"},"lightbox":{"jquery":true},"page-toc-button":{},"back-to-top-button":{},"github-buttons":{"repo":"rootsongjc/migrating-to-cloud-native-application-architectures","types":["star"],"size":"small"},"3-ba":{"configuration":"auto","token":"11f7d254cfa4e0ca44b175c66d379ecc"},"ga":{"configuration":"auto","token":"UA-93485976-1"},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"showLevel":false,"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"}},"search-plus":{}},"theme":"default","author":"Jimmy Song","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"迁移到云原生应用架构","language":"zh-hans","links":{"sidebar":{"回到首页":"https://jimmysong.io","云原生社区":"https://cloudnative.to"}},"gitbook":"*","description":"Migrating to Cloud Native Application Architectures 中文版"},"file":{"path":"chapter3/decomposition-recipes.md","mtime":"2019-10-13T12:18:37.562Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-07-20T06:32:29.420Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-page-toc-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-editlink/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-plus/jquery.mark.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-plus/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-3-ba/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-ga/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lightbox/jquery.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lightbox/lightbox.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

