
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>1.1 为何使用云原生应用架构？ · 迁移到云原生应用架构</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="Jimmy Song">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-toc-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search-plus/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-lightbox/css/lightbox.min.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="defining-cloud-native-architectures.html" />
    
    
    <link rel="prev" href="the-rise-of-cloud-native.html" />
    

    
        <link rel="shortcut icon" href='../images/favicon.ico' type="image/x-icon">
    
    
        <link rel="bookmark" href='../images/favicon.ico' type="image/x-icon">
    
    
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"repo":"rootsongjc/migrating-to-cloud-native-application-architectures","types":["star"],"size":"small"};
    </script>

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://jimmysong.io" target="_blank" class="custom-link">回到首页</a>
        </li>
    
        
        <li>
            <a href="https://cloudnative.to" target="_blank" class="custom-link">云原生社区</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="the-rise-of-cloud-native.html">
            
                <a href="the-rise-of-cloud-native.html">
            
                    
                    1. 云原生的崛起
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.2.1" data-path="why-cloud-native-application-architectures.html">
            
                <a href="why-cloud-native-application-architectures.html">
            
                    
                    1.1 为何使用云原生应用架构？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="defining-cloud-native-architectures.html">
            
                <a href="defining-cloud-native-architectures.html">
            
                    
                    1.2 云原生架构的定义
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="summary.html">
            
                <a href="summary.html">
            
                    
                    1.3 本章小结
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../chapter2/changes-needed.html">
            
                <a href="../chapter2/changes-needed.html">
            
                    
                    2. 在变革中前行
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../chapter2/cultural-change.html">
            
                <a href="../chapter2/cultural-change.html">
            
                    
                    2.1 文化变革
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../chapter2/organizational-change.html">
            
                <a href="../chapter2/organizational-change.html">
            
                    
                    2.2 组织变革
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="../chapter2/technical-change.html">
            
                <a href="../chapter2/technical-change.html">
            
                    
                    2.3 技术变革
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="../chapter2/summary.html">
            
                <a href="../chapter2/summary.html">
            
                    
                    2.4 本章小结
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../chapter3/migration-cookbook.html">
            
                <a href="../chapter3/migration-cookbook.html">
            
                    
                    3. 迁移指南
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="../chapter3/decomposition-recipes.html">
            
                <a href="../chapter3/decomposition-recipes.html">
            
                    
                    3.1 分解原架构
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="../chapter3/distributed-systems-recipes.html">
            
                <a href="../chapter3/distributed-systems-recipes.html">
            
                    
                    3.2 使用分布式系统
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="../chapter3/summary.html">
            
                <a href="../chapter3/summary.html">
            
                    
                    3.3 本章小结
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >1.1 为何使用云原生应用架构？</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div class="search-plus" id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x4E3A;&#x4F55;&#x4F7F;&#x7528;&#x4E91;&#x539F;&#x751F;&#x5E94;&#x7528;&#x67B6;&#x6784;">&#x4E3A;&#x4F55;&#x4F7F;&#x7528;&#x4E91;&#x539F;&#x751F;&#x5E94;&#x7528;&#x67B6;&#x6784;</h1>
<p>&#x9996;&#x5148;&#x6211;&#x4EEC;&#x6765;&#x9610;&#x8FF0;&#x4E0B;&#x5C06;&#x5E94;&#x7528;&#x8FC1;&#x79FB;&#x5230;&#x4E91;&#x539F;&#x751F;&#x67B6;&#x6784;&#x7684;&#x52A8;&#x673A;&#x3002;</p>
<h2 id="&#x901F;&#x5EA6;">&#x901F;&#x5EA6;</h2>
<p>&#x5929;&#x4E0B;&#x6B66;&#x529F;&#xFF0C;&#x552F;&#x5FEB;&#x4E0D;&#x7834;&#xFF0C;&#x5E02;&#x573A;&#x7ADE;&#x4E89;&#x4EA6;&#x662F;&#x5982;&#x6B64;&#x3002;&#x60F3;&#x8C61;&#x4E00;&#x4E0B;&#xFF0C;&#x80FD;&#x591F;&#x5FEB;&#x901F;&#x521B;&#x65B0;&#x3001;&#x5B9E;&#x9A8C;&#x5E76;&#x4EA4;&#x4ED8;&#x8F6F;&#x4EF6;&#x7684;&#x4F01;&#x4E1A;&#xFF0C;&#x4E0E;&#x4F7F;&#x7528;&#x4F20;&#x7EDF;&#x8F6F;&#x4EF6;&#x4EA4;&#x4ED8;&#x6A21;&#x5F0F;&#x7684;&#x4F01;&#x4E1A;&#xFF0C;&#x8C01;&#x5C06;&#x5728;&#x5E02;&#x573A;&#x7ADE;&#x4E89;&#x4E2D;&#x80DC;&#x51FA;&#x5462;&#xFF1F;</p>
<p>&#x5728;&#x4F20;&#x7EDF;&#x4F01;&#x4E1A;&#x4E2D;&#xFF0C;&#x4E3A;&#x5E94;&#x7528;&#x63D0;&#x4F9B;&#x73AF;&#x5883;&#x548C;&#x90E8;&#x7F72;&#x65B0;&#x7248;&#x672C;&#x82B1;&#x8D39;&#x7684;&#x65F6;&#x95F4;&#x901A;&#x5E38;&#x4EE5;&#x5929;&#x3001;&#x5468;&#x6216;&#x6708;&#x6765;&#x8BA1;&#x7B97;&#x3002;&#x8FD9;&#x79CD;&#x901F;&#x5EA6;&#x4E25;&#x91CD;&#x9650;&#x5236;&#x4E86;&#x6BCF;&#x4E2A;&#x53D1;&#x884C;&#x7248;&#x53EF;&#x4EE5;&#x627F;&#x62C5;&#x7684;&#x98CE;&#x9669;&#xFF0C;&#x56E0;&#x4E3A;&#x4FEE;&#x590D;&#x8FD9;&#x4E9B;&#x9519;&#x8BEF;&#x5F80;&#x5F80;&#x8DDF;&#x53D1;&#x884C;&#x4E00;&#x4E2A;&#x65B0;&#x7248;&#x672C;&#x6709;&#x5DEE;&#x4E0D;&#x591A;&#x7684;&#x8017;&#x65F6;&#x3002;</p>
<p>&#x4E92;&#x8054;&#x7F51;&#x516C;&#x53F8;&#x7ECF;&#x5E38;&#x63D0;&#x5230;&#x5B83;&#x4EEC;&#x6BCF;&#x5929;&#x51E0;&#x767E;&#x6B21;&#x53D1;&#x5E03;&#x7684;&#x5B9E;&#x8DF5;&#x3002;&#x4E3A;&#x4EC0;&#x4E48;&#x9891;&#x7E41;&#x53D1;&#x5E03;&#x5982;&#x6B64;&#x91CD;&#x8981;&#xFF1F;&#x5982;&#x679C;&#x4F60;&#x53EF;&#x4EE5;&#x6BCF;&#x5929;&#x5B9E;&#x73B0;&#x51E0;&#x767E;&#x6B21;&#x53D1;&#x5E03;&#xFF0C;&#x4F60;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x51E0;&#x4E4E;&#x7ACB;&#x5373;&#x4ECE;&#x9519;&#x8BEF;&#x7684;&#x7248;&#x672C;&#x6062;&#x590D;&#x8FC7;&#x6765;&#x3002;&#x5982;&#x679C;&#x4F60;&#x53EF;&#x4EE5;&#x7ACB;&#x5373;&#x4ECE;&#x9519;&#x8BEF;&#x4E2D;&#x6062;&#x590D;&#x8FC7;&#x6765;&#xFF0C;&#x4F60;&#x5C31;&#x80FD;&#x591F;&#x627F;&#x53D7;&#x66F4;&#x591A;&#x7684;&#x98CE;&#x9669;&#x3002;&#x5982;&#x679C;&#x4F60;&#x53EF;&#x4EE5;&#x627F;&#x53D7;&#x66F4;&#x591A;&#x7684;&#x98CE;&#x9669;&#xFF0C;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x505A;&#x66F4;&#x75AF;&#x72C2;&#x7684;&#x8BD5;&#x9A8C;&#x2014;&#x2014;&#x8FD9;&#x4E9B;&#x8BD5;&#x9A8C;&#x7ED3;&#x679C;&#x53EF;&#x80FD;&#x4F1A;&#x6210;&#x4E3A;&#x4F60;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x7ADE;&#x4E89;&#x4F18;&#x52BF;&#x3002;</p>
<p>&#x57FA;&#x4E8E;&#x4E91;&#x57FA;&#x7840;&#x8BBE;&#x7F6E;&#x7684;&#x5F39;&#x6027;&#x548C;&#x81EA;&#x670D;&#x52A1;&#x7684;&#x7279;&#x6027;&#x5929;&#x751F;&#x5C31;&#x9002;&#x5E94;&#x4E8E;&#x8FD9;&#x79CD;&#x5DE5;&#x4F5C;&#x65B9;&#x5F0F;&#x3002;&#x901A;&#x8FC7;&#x8C03;&#x7528;&#x4E91;&#x670D;&#x52A1;API&#x6765;&#x63D0;&#x4F9B;&#x65B0;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x73AF;&#x5883;&#x6BD4;&#x57FA;&#x4E8E;&#x8868;&#x5355;&#x7684;&#x624B;&#x52A8;&#x8FC7;&#x7A0B;&#x8981;&#x5FEB;&#x51E0;&#x4E2A;&#x6570;&#x91CF;&#x7EA7;&#x3002;&#x7136;&#x540E;&#x901A;&#x8FC7;&#x53E6;&#x4E00;&#x4E2A;API&#x8C03;&#x7528;&#x5C06;&#x4EE3;&#x7801;&#x90E8;&#x7F72;&#x5230;&#x65B0;&#x7684;&#x73AF;&#x5883;&#x4E2D;&#x3002;&#x5C06;&#x81EA;&#x670D;&#x52A1;&#x548C;hook&#x6DFB;&#x52A0;&#x5230;&#x56E2;&#x961F;&#x7684;CI/CD&#x670D;&#x52A1;&#x5668;&#x73AF;&#x5883;&#x4E2D;&#x8FDB;&#x4E00;&#x6B65;&#x52A0;&#x5FEB;&#x4E86;&#x901F;&#x5EA6;&#x3002;&#x73B0;&#x5728;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x56DE;&#x7B54;&#x7CBE;&#x76CA;&#x5927;&#x5E08;Mary Poppendick&#x63D0;&#x51FA;&#x7684;&#x95EE;&#x9898;&#x4E86;&#x2014;&#x2014;&#x201C;&#x5982;&#x679C;&#x53EA;&#x662F;&#x6539;&#x53D8;&#x4E86;&#x5E94;&#x7528;&#x7684;&#x4E00;&#x884C;&#x4EE3;&#x7801;&#xFF0C;&#x60A8;&#x7684;&#x7EC4;&#x7EC7;&#x9700;&#x8981;&#x591A;&#x957F;&#x65F6;&#x95F4;&#x624D;&#x80FD;&#x628A;&#x5E94;&#x7528;&#x90E8;&#x7F72;&#x5230;&#x7EBF;&#x4E0A;&#xFF1F;&#x201C;&#x7B54;&#x6848;&#x662F;&#x51E0;&#x5206;&#x949F;&#x6216;&#x51E0;&#x79D2;&#x949F;&#x3002;</p>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x5927;&#x80C6;&#x60F3;&#x8C61; &#x4E00;&#x4E0B;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x8FBE;&#x5230;&#x8FD9;&#x6837;&#x7684;&#x901F;&#x5EA6;&#xFF0C;&#x4F60;&#x7684;&#x56E2;&#x961F;&#x3001;&#x4F60;&#x7684;&#x4E1A;&#x52A1;&#x53EF;&#x4EE5;&#x505A;&#x54EA;&#x4E9B;&#x4E8B;&#x60C5;&#x5462;&#xFF1F;</p>
<h2 id="&#x5B89;&#x5168;">&#x5B89;&#x5168;</h2>
<p>&#x5149;&#x662F;&#x901F;&#x5EA6;&#x5FEB;&#x8FD8;&#x662F;&#x4E0D;&#x591F;&#x7684;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5F00;&#x8F66;&#x662F;&#x4E00;&#x5F00;&#x59CB;&#x5C31;&#x628A;&#x6CB9;&#x95E8;&#x8E29;&#x5230;&#x5E95;&#xFF0C;&#x4F60;&#x5C06;&#x56E0;&#x6B64;&#x53D1;&#x751F;&#x4E8B;&#x6545;&#x800C;&#x4ED8;&#x51FA;&#x60E8;&#x75DB;&#x7684;&#x4EE3;&#x4EF7;&#xFF08;&#x6709;&#x65F6;&#x751A;&#x81F3;&#x662F;&#x81F4;&#x547D;&#x7684;&#xFF09;&#xFF01;&#x4E0D;&#x540C;&#x7684;&#x4EA4;&#x901A;&#x65B9;&#x5F0F;&#x5982;&#x98DE;&#x673A;&#x548C;&#x7279;&#x5FEB;&#x5217;&#x8F66;&#x90FD;&#x4F1A;&#x517C;&#x987E;&#x901F;&#x5EA6;&#x548C;&#x5B89;&#x5168;&#x6027;&#x3002;&#x4E91;&#x539F;&#x751F;&#x5E94;&#x7528;&#x67B6;&#x6784;&#x5728;&#x5FEB;&#x901F;&#x53D8;&#x52A8;&#x7684;&#x9700;&#x6C42;&#x3001;&#x7A33;&#x5B9A;&#x6027;&#x3001;&#x53EF;&#x7528;&#x6027;&#x548C;&#x8010;&#x4E45;&#x6027;&#x4E4B;&#x95F4;&#x5BFB;&#x6C42;&#x5E73;&#x8861;&#x3002;&#x8FD9;&#x662F;&#x53EF;&#x80FD;&#x7684;&#x800C;&#x4E14;&#x975E;&#x5E38;&#x6709;&#x5FC5;&#x8981;&#x540C;&#x65F6;&#x5B9E;&#x73B0;&#x7684;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x524D;&#x9762;&#x5DF2;&#x7ECF;&#x63D0;&#x5230;&#x8FC7;&#xFF0C;&#x4E91;&#x539F;&#x751F;&#x5E94;&#x7528;&#x67B6;&#x6784;&#x53EF;&#x4EE5;&#x8BA9;&#x6211;&#x4EEC;&#x8FC5;&#x901F;&#x5730;&#x4ECE;&#x9519;&#x8BEF;&#x4E2D;&#x6062;&#x590D;&#x3002;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x8C08;&#x8BBA;&#x5982;&#x4F55;&#x9884;&#x9632;&#x9519;&#x8BEF;&#xFF0C;&#x800C;&#x5728;&#x4F01;&#x4E1A;&#x91CC;&#x5F80;&#x5F80;&#x5728;&#x8FD9;&#x4E00;&#x70B9;&#x4E0A;&#x82B1;&#x8D39;&#x4E86;&#x5927;&#x91CF;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x5728;&#x8FFD;&#x5BFB;&#x901F;&#x5EA6;&#x7684;&#x8DEF;&#x4E0A;&#xFF0C;&#x5927;&#x800C;&#x5168;&#x7684;&#x524D;&#x7AEF;&#x5347;&#x7EA7;&#xFF0C;&#x8BE6;&#x5C3D;&#x7684;&#x6587;&#x6863;&#xFF0C;&#x67B6;&#x6784;&#x590D;&#x6838;&#x59D4;&#x5458;&#x4F1A;&#x548C;&#x6F2B;&#x957F;&#x7684;&#x56DE;&#x5F52;&#x6D4B;&#x8BD5;&#x5468;&#x671F;&#x5728;&#x4E00;&#x6B21;&#x6B21;&#x6210;&#x4E3A;&#x6211;&#x4EEC;&#x7684;&#x7ECA;&#x811A;&#x77F3;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x4E4B;&#x6240;&#x4EE5;&#x8FD9;&#x6837;&#x505A;&#x90FD;&#x662F;&#x51FA;&#x4E8E;&#x597D;&#x610F;&#x3002;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x505A;&#x6CD5;&#x90FD;&#x4E0D;&#x80FD;&#x63D0;&#x4F9B;&#x4E00;&#x81F4;&#x53EF;&#x8861;&#x91CF;&#x7684;&#x751F;&#x4EA7;&#x7F3A;&#x9677;&#x6539;&#x5584;&#x5EA6;&#x91CF;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x5982;&#x4F55;&#x624D;&#x80FD;&#x505A;&#x5230;&#x5373;&#x5B89;&#x5168;&#x53C8;&#x5FEB;&#x901F;&#x5462;&#xFF1F;</p>
<p><strong>&#x53EF;&#x89C6;&#x5316;</strong></p>
<p>&#x6211;&#x4EEC;&#x7684;&#x67B6;&#x6784;&#x5FC5;&#x987B;&#x4E3A;&#x6211;&#x4EEC;&#x63D0;&#x4F9B;&#x5FC5;&#x8981;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x4EE5;&#x4FBF;&#x53EF;&#x4EE5;&#x5728;&#x53D1;&#x751F;&#x6545;&#x969C;&#x65F6;&#x770B;&#x5230;&#x5B83;&#x3002;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x89C2;&#x6D4B;&#x4E00;&#x5207;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x201C;&#x54EA;&#x4E9B;&#x662F;&#x6B63;&#x5E38;&#x201D;&#x7684;&#x6982;&#x51B5;&#xFF0C;&#x68C0;&#x6D4B;&#x4E0E;&#x6807;&#x51C6;&#x60C5;&#x51B5;&#x7684;&#x504F;&#x5DEE;&#xFF08;&#x5305;&#x62EC;&#x7EDD;&#x5BF9;&#x503C;&#x548C;&#x53D8;&#x5316;&#x7387;&#xFF09;&#xFF0C;&#x5E76;&#x786E;&#x5B9A;&#x54EA;&#x4E9B;&#x7EC4;&#x4EF6;&#x5BFC;&#x81F4;&#x4E86;&#x8FD9;&#x4E9B;&#x504F;&#x5DEE;&#x3002;&#x529F;&#x80FD;&#x4E30;&#x5BCC;&#x7684;&#x6307;&#x6807;&#x3001;&#x76D1;&#x63A7;&#x3001;&#x8B66;&#x62A5;&#x3001;&#x6570;&#x636E;&#x53EF;&#x89C6;&#x5316;&#x6846;&#x67B6;&#x548C;&#x5DE5;&#x5177;&#x662F;&#x6240;&#x6709;&#x4E91;&#x539F;&#x751F;&#x5E94;&#x7528;&#x67B6;&#x6784;&#x7684;&#x6838;&#x5FC3;&#x3002;</p>
<p><strong>&#x6545;&#x969C;&#x9694;&#x79BB;</strong></p>
<p>&#x4E3A;&#x4E86;&#x9650;&#x5236;&#x4E0E;&#x6545;&#x969C;&#x5E26;&#x6765;&#x7684;&#x98CE;&#x9669;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x9650;&#x5236;&#x53EF;&#x80FD;&#x53D7;&#x5230;&#x6545;&#x969C;&#x5F71;&#x54CD;&#x7684;&#x7EC4;&#x4EF6;&#x6216;&#x529F;&#x80FD;&#x7684;&#x8303;&#x56F4;&#x3002;&#x5982;&#x679C;&#x6BCF;&#x6B21;&#x4E9A;&#x9A6C;&#x900A;&#x7684;&#x63A8;&#x8350;&#x5F15;&#x64CE;&#x6302;&#x6389;&#x540E;&#x4EBA;&#x4EEC;&#x5C31;&#x4E0D;&#x80FD;&#x518D;&#x5728;&#x4E9A;&#x9A6C;&#x900A;&#x4E0A;&#x4E70;&#x4EA7;&#x54C1;&#xFF0C;&#x90A3;&#x5C06;&#x662F;&#x707E;&#x96BE;&#x6027;&#x7684;&#x3002;&#x5355;&#x4F53;&#x67B6;&#x6784;&#x901A;&#x5E38;&#x5C31;&#x662F;&#x8FD9;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x6545;&#x969C;&#x6A21;&#x5F0F;&#x3002;&#x4E91;&#x539F;&#x751F;&#x5E94;&#x7528;&#x67B6;&#x6784;&#x901A;&#x5E38;&#x4F7F;&#x7528;&#x5FAE;&#x670D;&#x52A1;&#x3002;&#x901A;&#x8FC7;&#x5C06;&#x7CFB;&#x7EDF;&#x62C6;&#x89E3;&#x4E3A;&#x5FAE;&#x670D;&#x52A1;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x5FAE;&#x670D;&#x52A1;&#x7684;&#x6545;&#x969C;&#x8303;&#x56F4;&#x9650;&#x5236;&#x5728;&#x8FD9;&#x4E2A;&#x5FAE;&#x670D;&#x52A1;&#x4E0A;&#xFF0C;&#x4F46;&#x8FD8;&#x9700;&#x8981;&#x7ED3;&#x5408;&#x5BB9;&#x9519;&#x624D;&#x80FD;&#x5B9E;&#x73B0;&#x8FD9;&#x4E00;&#x70B9;&#x3002;</p>
<p><strong>&#x5BB9;&#x9519;</strong></p>
<p>&#x4EC5;&#x4EC5;&#x5C06;&#x7CFB;&#x7EDF;&#x62C6;&#x89E3;&#x4E3A;&#x53EF;&#x4EE5;&#x72EC;&#x7ACB;&#x90E8;&#x7F72;&#x7684;&#x5FAE;&#x670D;&#x52A1;&#x8FD8;&#x662F;&#x4E0D;&#x591F;&#x7684;&#xFF1B;&#x8FD8;&#x9700;&#x8981;&#x9632;&#x6B62;&#x51FA;&#x73B0;&#x9519;&#x8BEF;&#x7684;&#x7EC4;&#x4EF6;&#x5C06;&#x9519;&#x8BEF;&#x4F20;&#x9012;&#x5B83;&#x6240;&#x4F9D;&#x8D56;&#x7684;&#x7EC4;&#x4EF6;&#x4E0A;&#x800C;&#x9020;&#x6210;&#x7EA7;&#x8054;&#x6545;&#x969C;&#x3002;Mike Nygard &#x5728;&#x4ED6;&#x7684;&#x300A;Release It! - Pragmatic Programmers&#x300B;&#x4E00;&#x4E66;&#x4E2D;&#x63CF;&#x8FF0;&#x4E86;&#x4E00;&#x4E9B;&#x5BB9;&#x9519;&#x6A21;&#x578B;&#xFF0C;&#x6700;&#x53D7;&#x6B22;&#x8FCE;&#x7684;&#x662F;<strong>&#x65AD;&#x8DEF;&#x5668;</strong>&#x3002;&#x8F6F;&#x4EF6;&#x65AD;&#x8DEF;&#x5668;&#x7684;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#x5C31;&#x7C7B;&#x4F3C;&#x4E8E;&#x7535;&#x5B50;&#x65AD;&#x8DEF;&#x5668;&#xFF08;&#x4FDD;&#x9669;&#x4E1D;&#xFF09;&#xFF1A;&#x65AD;&#x5F00;&#x5B83;&#x6240;&#x4FDD;&#x62A4;&#x7684;&#x7EC4;&#x4EF6;&#x4E0E;&#x6545;&#x969C;&#x7CFB;&#x7EDF;&#x4E4B;&#x95F4;&#x7684;&#x56DE;&#x8DEF;&#x4EE5;&#x9632;&#x6B62;&#x7EA7;&#x8054;&#x6545;&#x969C;&#x3002;&#x5B83;&#x8FD8;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x4F18;&#x96C5;&#x7684;&#x56DE;&#x9000;&#x884C;&#x4E3A;&#xFF0C;&#x6BD4;&#x5982;&#x56DE;&#x8DEF;&#x65AD;&#x5F00;&#x7684;&#x65F6;&#x5019;&#x63D0;&#x4F9B;&#x4E00;&#x7EC4;&#x9ED8;&#x8BA4;&#x7684;&#x4EA7;&#x54C1;&#x63A8;&#x8350;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x201C;&#x5BB9;&#x9519;&#x201D;&#x4E00;&#x8282;&#x8BE6;&#x7EC6;&#x8BA8;&#x8BBA;&#x8BE5;&#x6A21;&#x578B;&#x3002;</p>
<p><strong>&#x81EA;&#x52A8;&#x6062;&#x590D;</strong></p>
<p>&#x51ED;&#x501F;&#x53EF;&#x89C6;&#x5316;&#x3001;&#x6545;&#x969C;&#x9694;&#x79BB;&#x548C;&#x5BB9;&#x9519;&#x80FD;&#x529B;&#xFF0C;&#x6211;&#x4EEC;&#x62E5;&#x6709;&#x786E;&#x5B9A;&#x6545;&#x969C;&#x6240;&#x9700;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x4ECE;&#x6545;&#x969C;&#x4E2D;&#x6062;&#x590D;&#xFF0C;&#x5E76;&#x5728;&#x8FDB;&#x884C;&#x9519;&#x8BEF;&#x68C0;&#x6D4B;&#x548C;&#x6545;&#x969C;&#x6062;&#x590D;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x4E3A;&#x5BA2;&#x6237;&#x63D0;&#x4F9B;&#x5408;&#x7406;&#x7684;&#x670D;&#x52A1;&#x6C34;&#x5E73;&#x3002;&#x4E00;&#x4E9B;&#x6545;&#x969C;&#x5F88;&#x5BB9;&#x6613;&#x8BC6;&#x522B;&#xFF1A;&#x5B83;&#x4EEC;&#x5728;&#x6BCF;&#x6B21;&#x53D1;&#x751F;&#x65F6;&#x5448;&#x73B0;&#x51FA;&#x76F8;&#x540C;&#x7684;&#x6613;&#x4E8E;&#x68C0;&#x6D4B;&#x7684;&#x6A21;&#x5F0F;&#x3002;&#x4EE5;&#x670D;&#x52A1;&#x5065;&#x5EB7;&#x68C0;&#x67E5;&#x4E3A;&#x4F8B;&#xFF0C;&#x7ED3;&#x679C;&#x53EA;&#x6709;&#x4E24;&#x4E2A;&#xFF1A;&#x5065;&#x5EB7;&#x6216;&#x4E0D;&#x5065;&#x5EB7;&#xFF0C;up&#x6216;down&#x3002;&#x5F88;&#x591A;&#x65F6;&#x5019;&#xFF0C;&#x6BCF;&#x6B21;&#x9047;&#x5230;&#x8FD9;&#x6837;&#x7684;&#x6545;&#x969C;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x90FD;&#x4F1A;&#x91C7;&#x53D6;&#x76F8;&#x540C;&#x7684;&#x884C;&#x52A8;&#x3002;&#x5728;&#x5065;&#x5EB7;&#x68C0;&#x67E5;&#x5931;&#x8D25;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x53EA;&#x9700;&#x91CD;&#x65B0;&#x542F;&#x52A8;&#x6216;&#x91CD;&#x65B0;&#x90E8;&#x7F72;&#x76F8;&#x5173;&#x670D;&#x52A1;&#x3002;&#x4E91;&#x539F;&#x751F;&#x5E94;&#x7528;&#x67B6;&#x6784;&#x4E0D;&#x8981;&#x5F53;&#x5E94;&#x7528;&#x5728;&#x8FD9;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#x65E0;&#x9700;&#x624B;&#x52A8;&#x5E72;&#x9884;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x4ED6;&#x4EEC;&#x4F1A;&#x81EA;&#x52A8;&#x68C0;&#x6D4B;&#x548C;&#x6062;&#x590D;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x4ED6;&#x4EEC;&#x7ED9;&#x7535;&#x8111;&#x88C5;&#x4E0A;&#x4E86;&#x5BFB;&#x547C;&#x673A;&#x800C;&#x4E0D;&#x662F;&#x4EBA;&#x3002;</p>
<h2 id="&#x5F39;&#x6027;&#x6269;&#x5C55;">&#x5F39;&#x6027;&#x6269;&#x5C55;</h2>
<p>&#x968F;&#x7740;&#x9700;&#x6C42;&#x7684;&#x589E;&#x52A0;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x6269;&#x5927;&#x670D;&#x52A1;&#x80FD;&#x529B;&#x3002;&#x8FC7;&#x53BB;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x5782;&#x76F4;&#x6269;&#x5C55;&#x6765;&#x5904;&#x7406;&#x66F4;&#x591A;&#x7684;&#x9700;&#x6C42;&#xFF1A;&#x8D2D;&#x4E70;&#x4E86;&#x66F4;&#x5F3A;&#x608D;&#x7684;&#x670D;&#x52A1;&#x5668;&#x3002;&#x6211;&#x4EEC;&#x6700;&#x7EC8;&#x5B9E;&#x73B0;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x76EE;&#x6807;&#xFF0C;&#x4F46;&#x662F;&#x6B65;&#x4F10;&#x592A;&#x6162;&#xFF0C;&#x5E76;&#x4E14;&#x4EA7;&#x751F;&#x4E86;&#x66F4;&#x591A;&#x7684;&#x82B1;&#x8D39;&#x3002;&#x8FD9;&#x5BFC;&#x81F4;&#x4E86;&#x57FA;&#x4E8E;&#x9AD8;&#x5CF0;&#x4F7F;&#x7528;&#x9884;&#x6D4B;&#x7684;&#x5BB9;&#x91CF;&#x89C4;&#x5212;&#x3002;&#x6211;&#x4EEC;&#x4F1A;&#x95EE;&#x201D;&#x8FD9;&#x9879;&#x670D;&#x52A1;&#x9700;&#x8981;&#x591A;&#x5927;&#x7684;&#x8BA1;&#x7B97;&#x80FD;&#x529B;&#xFF1F;&#x201D;&#x7136;&#x540E;&#x8D2D;&#x4E70;&#x8DB3;&#x591F;&#x7684;&#x786C;&#x4EF6;&#x6765;&#x6EE1;&#x8DB3;&#x8FD9;&#x4E2A;&#x8981;&#x6C42;&#x3002;&#x5F88;&#x591A;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x4F9D;&#x7136;&#x4F1A;&#x5224;&#x65AD;&#x9519;&#x8BEF;&#xFF0C;&#x4F1A;&#x5728;&#x5982;&#x9ED1;&#x8272;&#x661F;&#x671F;&#x4E94;&#x8FD9;&#x7C7B;&#x4E8B;&#x4EF6;&#x4E2D;&#x6253;&#x7834;&#x6211;&#x4EEC;&#x7684;&#x53EF;&#x7528;&#x5BB9;&#x91CF;&#x89C4;&#x5212;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x66F4;&#x591A;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4F1A;&#x9047;&#x5230;&#x6570;&#x4EE5;&#x767E;&#x8BA1;&#x7684;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x5B83;&#x4EEC;&#x7684;CPU&#x90FD;&#x662F;&#x7A7A;&#x95F2;&#x7684;&#xFF0C;&#x8FD9;&#x4F1A;&#x8BA9;&#x8D44;&#x6E90;&#x4F7F;&#x7528;&#x7387;&#x6307;&#x6807;&#x5F88;&#x96BE;&#x770B;&#x3002;</p>
<p>&#x521B;&#x65B0;&#x578B;&#x7684;&#x516C;&#x53F8;&#x901A;&#x8FC7;&#x4EE5;&#x4E0B;&#x4E24;&#x4E2A;&#x5F00;&#x521B;&#x6027;&#x7684;&#x4E3E;&#x63AA;&#x6765;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;</p>
<ul>
<li><p>&#x5B83;&#x4EEC;&#x4E0D;&#x518D;&#x7EE7;&#x7EED;&#x8D2D;&#x4E70;&#x66F4;&#x5927;&#x578B;&#x7684;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x53D6;&#x800C;&#x4EE3;&#x4E4B;&#x7684;&#x662F;&#x7528;&#x5927;&#x91CF;&#x7684;&#x66F4;&#x4FBF;&#x5B9C;&#x673A;&#x5668;&#x6765;&#x6C34;&#x5E73;&#x6269;&#x5C55;&#x5E94;&#x7528;&#x5B9E;&#x4F8B;&#x3002;&#x8FD9;&#x4E9B;&#x673A;&#x5668;&#x66F4;&#x5BB9;&#x6613;&#x83B7;&#x5F97;&#xFF0C;&#x5E76;&#x4E14;&#x80FD;&#x591F;&#x5FEB;&#x901F;&#x90E8;&#x7F72;&#x3002;</p>
</li>
<li><p>&#x901A;&#x8FC7;&#x5C06;&#x5927;&#x578B;&#x670D;&#x52A1;&#x5668;&#x865A;&#x62DF;&#x5316;&#x6210;&#x51E0;&#x4E2A;&#x8F83;&#x5C0F;&#x7684;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x5E76;&#x5411;&#x5176;&#x90E8;&#x7F72;&#x591A;&#x4E2A;&#x9694;&#x79BB;&#x7684;&#x5DE5;&#x4F5C;&#x8D1F;&#x8F7D;&#x6765;&#x6539;&#x5584;&#x73B0;&#x6709;&#x5927;&#x578B;&#x670D;&#x52A1;&#x5668;&#x7684;&#x8D44;&#x6E90;&#x5229;&#x7528;&#x7387;&#x3002;</p>
</li>
</ul>
<p>&#x968F;&#x7740;&#x50CF;&#x4E9A;&#x9A6C;&#x900A;AWS&#x8FD9;&#x6837;&#x7684;&#x516C;&#x6709;&#x4E91;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x51FA;&#x73B0;&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x4E3E;&#x63AA;&#x878D;&#x5408;&#x4E86;&#x8D77;&#x6765;&#x3002;&#x865A;&#x62DF;&#x5316;&#x5DE5;&#x4F5C;&#x88AB;&#x59D4;&#x6258;&#x7ED9;&#x4E91;&#x63D0;&#x4F9B;&#x5546;&#xFF0C;&#x6D88;&#x8D39;&#x8005;&#x53EA;&#x9700;&#x8981;&#x5173;&#x6CE8;&#x5728;&#x5927;&#x91CF;&#x7684;&#x4E91;&#x670D;&#x52A1;&#x5668;&#x5B9E;&#x4F8B;&#x6A2A;&#x5411;&#x6269;&#x5C55;&#x5B83;&#x4EEC;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5B9E;&#x4F8B;&#x3002;&#x6700;&#x8FD1;&#xFF0C;&#x4F5C;&#x4E3A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x90E8;&#x7F72;&#x7684;&#x5355;&#x5143;&#xFF0C;&#x53D1;&#x751F;&#x4E86;&#x53E6;&#x4E00;&#x4E2A;&#x8F6C;&#x53D8;&#xFF0C;&#x4ECE;&#x865A;&#x62DF;&#x673A;&#x8F6C;&#x79FB;&#x5230;&#x4E86;&#x5BB9;&#x5668;&#x3002;</p>
<p>&#x7531;&#x4E8E;&#x516C;&#x53F8;&#x4E0D;&#x518D;&#x9700;&#x8981;&#x5927;&#x91CF;&#x542F;&#x52A8;&#x8D44;&#x91D1;&#x6765;&#x90E8;&#x7F72;&#x8F6F;&#x4EF6;&#xFF0C;&#x6240;&#x4EE5;&#x5411;&#x4E91;&#x7684;&#x8F6C;&#x53D8;&#x6253;&#x5F00;&#x4E86;&#x66F4;&#x591A;&#x521B;&#x65B0;&#x4E4B;&#x95E8;&#x3002;&#x6B63;&#x5728;&#x8FDB;&#x884C;&#x7684;&#x7EF4;&#x62A4;&#x8FD8;&#x9700;&#x8981;&#x8F83;&#x5C11;&#x7684;&#x8D44;&#x672C;&#x6295;&#x5165;&#xFF0C;&#x5E76;&#x4E14;&#x901A;&#x8FC7;API&#x8FDB;&#x884C;&#x914D;&#x7F6E;&#x4E0D;&#x4EC5;&#x53EF;&#x4EE5;&#x63D0;&#x9AD8;&#x521D;&#x59CB;&#x90E8;&#x7F72;&#x7684;&#x901F;&#x5EA6;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x6700;&#x5927;&#x9650;&#x5EA6;&#x5730;&#x63D0;&#x9AD8;&#x6211;&#x4EEC;&#x5E94;&#x5BF9;&#x9700;&#x6C42;&#x53D8;&#x5316;&#x7684;&#x901F;&#x5EA6;&#x3002;</p>
<p>&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x597D;&#x5904;&#x90FD;&#x5E26;&#x6709;&#x6210;&#x672C;&#x3002;&#x76F8;&#x8F83;&#x4E8E;&#x5782;&#x76F4;&#x6269;&#x5C55;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x652F;&#x6301;&#x6C34;&#x5E73;&#x6269;&#x5C55;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x67B6;&#x6784;&#x5FC5;&#x987B;&#x4E0D;&#x540C;&#x3002;&#x4E91;&#x7684;&#x5F39;&#x6027;&#x8981;&#x6C42;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x72B6;&#x6001;&#x77ED;&#x6682;&#x6027;&#x3002;&#x6211;&#x4EEC;&#x4E0D;&#x4EC5;&#x53EF;&#x4EE5;&#x5FEB;&#x901F;&#x521B;&#x5EFA;&#x65B0;&#x7684;&#x5E94;&#x7528;&#x5B9E;&#x4F8B;&#xFF1B;&#x6211;&#x4EEC;&#x4E5F;&#x5FC5;&#x987B;&#x80FD;&#x591F;&#x5FEB;&#x901F;&#x3001;&#x5B89;&#x5168;&#x5730;&#x5904;&#x7F6E;&#x5B83;&#x4EEC;&#x3002;&#x8FD9;&#x79CD;&#x9700;&#x6C42;&#x662F;&#x72B6;&#x6001;&#x7BA1;&#x7406;&#x7684;&#x95EE;&#x9898;&#xFF1A;&#x4E00;&#x6B21;&#x6027;&#x4E0E;&#x6301;&#x4E45;&#x6027;&#x5982;&#x4F55;&#x4E92;&#x76F8;&#x5F71;&#x54CD;&#xFF1F;&#x5728;&#x5927;&#x591A;&#x6570;&#x5782;&#x76F4;&#x67B6;&#x6784;&#x4E2D;&#x91C7;&#x7528;&#x7684;&#x8BF8;&#x5982;&#x805A;&#x7C7B;&#x4F1A;&#x8BDD;&#x548C;&#x5171;&#x4EAB;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x4F20;&#x7EDF;&#x65B9;&#x6CD5;&#x5E76;&#x4E0D;&#x80FD;&#x5F88;&#x597D;&#x5730;&#x652F;&#x6301;&#x6C34;&#x5E73;&#x6269;&#x5C55;&#x3002;</p>
<p>&#x4E91;&#x539F;&#x751F;&#x5E94;&#x7528;&#x67B6;&#x6784;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x6807;&#x5FD7;&#x662F;&#x5C06;&#x72B6;&#x6001;&#x5916;&#x90E8;&#x5316;&#x5230;&#x5185;&#x5B58;&#x6570;&#x636E;&#x7F51;&#x683C;&#x3001;&#x7F13;&#x5B58;&#x548C;&#x6301;&#x4E45;&#x5BF9;&#x8C61;&#x5B58;&#x50A8;&#xFF0C;&#x540C;&#x65F6;&#x4FDD;&#x6301;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5B9E;&#x4F8B;&#x672C;&#x8EAB;&#x57FA;&#x672C;&#x4E0A;&#x662F;&#x65E0;&#x72B6;&#x6001;&#x7684;&#x3002;&#x65E0;&#x72B6;&#x6001;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x5FEB;&#x901F;&#x521B;&#x5EFA;&#x548C;&#x9500;&#x6BC1;&#xFF0C;&#x4EE5;&#x53CA;&#x9644;&#x52A0;&#x5230;&#x5916;&#x90E8;&#x72B6;&#x6001;&#x7BA1;&#x7406;&#x5668;&#x548C;&#x8131;&#x79BB;&#x5916;&#x90E8;&#x72B6;&#x6001;&#x7BA1;&#x7406;&#x5668;&#xFF0C;&#x589E;&#x5F3A;&#x6211;&#x4EEC;&#x54CD;&#x5E94;&#x9700;&#x6C42;&#x53D8;&#x5316;&#x7684;&#x80FD;&#x529B;&#x3002;&#x5F53;&#x7136;&#x8FD9;&#x4E5F;&#x9700;&#x8981;&#x5916;&#x90E8;&#x72B6;&#x6001;&#x7BA1;&#x7406;&#x5668;&#x81EA;&#x5DF1;&#x6765;&#x6269;&#x5C55;&#x3002;&#x5927;&#x591A;&#x6570;&#x4E91;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x63D0;&#x4F9B;&#x5546;&#x5DF2;&#x7ECF;&#x8BA4;&#x8BC6;&#x5230;&#x8FD9;&#x4E00;&#x5FC5;&#x8981;&#x6027;&#xFF0C;&#x5E76;&#x63D0;&#x4F9B;&#x4E86;&#x8FD9;&#x7C7B;&#x670D;&#x52A1;&#x7684;&#x5065;&#x5EB7;&#x7BA1;&#x7406;&#x3002;</p>
<h2 id="&#x79FB;&#x52A8;&#x5E94;&#x7528;&#x548C;&#x5BA2;&#x6237;&#x7AEF;&#x591A;&#x6837;&#x6027;">&#x79FB;&#x52A8;&#x5E94;&#x7528;&#x548C;&#x5BA2;&#x6237;&#x7AEF;&#x591A;&#x6837;&#x6027;</h2>
<p>2014&#x5E74;1&#x6708;&#xFF0C;&#x7F8E;&#x56FD;&#x79FB;&#x52A8;&#x8BBE;&#x5907;&#x5360;&#x4E92;&#x8054;&#x7F51;&#x4F7F;&#x7528;&#x91CF;&#x7684;55&#xFF05;&#x3002;&#x4E13;&#x95E8;&#x9488;&#x5BF9;&#x684C;&#x9762;&#x7528;&#x6237;&#x800C;&#x5F00;&#x53D1;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x65F6;&#x4EE3;&#x5DF2;&#x7ECF;&#x8FC7;&#x53BB;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x5047;&#x8BBE;&#x7528;&#x6237;&#x88C5;&#x5728;&#x53E3;&#x888B;&#x91CC;&#x5230;&#x5904;&#x6563;&#x6B65;&#x7684;&#x662F;&#x8D85;&#x7EA7;&#x8BA1;&#x7B97;&#x673A;&#x3002;&#x8FD9;&#x5BF9;&#x6211;&#x4EEC;&#x7684;&#x5E94;&#x7528;&#x67B6;&#x6784;&#x6709;&#x5F88;&#x5927;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x56E0;&#x4E3A;&#x6307;&#x6570;&#x7EA7;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x968F;&#x65F6;&#x968F;&#x5730;&#x4E0E;&#x6211;&#x4EEC;&#x7684;&#x7CFB;&#x7EDF;&#x8FDB;&#x884C;&#x4EA4;&#x4E92;&#x3002;</p>
<p>&#x4EE5;&#x67E5;&#x770B;&#x94F6;&#x884C;&#x8D26;&#x6237;&#x4F59;&#x989D;&#x4E3A;&#x4F8B;&#x3002;&#x8FD9;&#x9879;&#x4EFB;&#x52A1;&#x8FC7;&#x53BB;&#x662F;&#x901A;&#x8FC7;&#x62E8;&#x6253;&#x94F6;&#x884C;&#x7684;&#x547C;&#x53EB;&#x4E2D;&#x5FC3;&#xFF0C;&#x524D;&#x5F80;ATM&#xFF0C;&#x6216;&#x8005;&#x5728;&#x94F6;&#x884C;&#x7684;&#x4E00;&#x4E2A;&#x5206;&#x652F;&#x673A;&#x6784;&#x7684;&#x5411;&#x67DC;&#x5458;&#x8BF7;&#x6C42;&#x5B8C;&#x6210;&#x7684;&#x3002;&#x8FD9;&#x4E9B;&#x5BA2;&#x6237;&#x4E92;&#x52A8;&#x6A21;&#x5F0F;&#x5728;&#x4EFB;&#x4F55;&#x65F6;&#x95F4;&#x5185;&#xFF0C;&#x90FD;&#x4F1A;&#x5BF9;&#x94F6;&#x884C;&#x4E3A;&#x5E95;&#x5C42;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x63D0;&#x51FA;&#x65B0;&#x9700;&#x6C42;&#x4EA7;&#x751F;&#x6781;&#x5927;&#x7684;&#x9650;&#x5236;&#x3002;</p>
<p>&#x8FC1;&#x79FB;&#x5230;&#x7F51;&#x4E0A;&#x94F6;&#x884C;&#x5BFC;&#x81F4;&#x8BBF;&#x95EE;&#x91CF;&#x7684;&#x4E0A;&#x5347;&#xFF0C;&#x4F46;&#x5E76;&#x6CA1;&#x6709;&#x4ECE;&#x6839;&#x672C;&#x4E0A;&#x6539;&#x53D8;&#x4EA4;&#x4E92;&#x6A21;&#x5F0F;&#x3002;&#x60A8;&#x4ECD;&#x7136;&#x5FC5;&#x987B;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x7EC8;&#x7AEF;&#x4E0A;&#x4E0E;&#x7CFB;&#x7EDF;&#x8FDB;&#x884C;&#x4EA4;&#x4E92;&#xFF0C;&#x8FD9;&#x4ECD;&#x7136;&#x663E;&#x8457;&#x9650;&#x5236;&#x4E86;&#x9700;&#x6C42;&#x3002;&#x6B63;&#x5982;&#x6211;&#x7684;&#x540C;&#x4E8B;Andrew Clay Shafer&#x7ECF;&#x5E38;&#x8BF4;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x201C;&#x6211;&#x4EEC;&#x53E3;&#x888B;&#x91CC;&#x6B63;&#x5E26;&#x7740;&#x8D85;&#x7EA7;&#x8BA1;&#x7B97;&#x673A;&#x5230;&#x5904;&#x6E38;&#x8D70;&#x201D;&#xFF0C;&#x6211;&#x4EEC;&#x5F00;&#x59CB;&#x5BF9;&#x8FD9;&#x4E9B;&#x7CFB;&#x7EDF;&#x5E26;&#x6765;&#x5F88;&#x5927;&#x8D1F;&#x8F7D;&#x3002;&#x73B0;&#x5728;&#xFF0C;&#x6210;&#x5343;&#x4E0A;&#x4E07;&#x7684;&#x5BA2;&#x6237;&#x53EF;&#x4EE5;&#x968F;&#x65F6;&#x968F;&#x5730;&#x4E0E;&#x94F6;&#x884C;&#x7CFB;&#x7EDF;&#x8FDB;&#x884C;&#x4E92;&#x52A8;&#x3002; &#x4E00;&#x4F4D;&#x94F6;&#x884C;&#x884C;&#x653F;&#x4EBA;&#x5458;&#x8868;&#x793A;&#xFF0C;&#x5728;&#x53D1;&#x85AA;&#x65E5;&#xFF0C;&#x5BA2;&#x6237;&#x4F1A;&#x6BCF;&#x9694;&#x51E0;&#x5206;&#x949F;&#x68C0;&#x67E5;&#x4E00;&#x6B21;&#x4F59;&#x989D;&#x3002; &#x9057;&#x7559;&#x7684;&#x94F6;&#x884C;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x6839;&#x672C;&#x65E0;&#x6CD5;&#x6EE1;&#x8DB3;&#x8FD9;&#x79CD;&#x9700;&#x6C42;&#xFF0C;&#x800C;&#x4E91;&#x539F;&#x751F;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x5374;&#x53EF;&#x4EE5;&#x3002;</p>
<p>&#x79FB;&#x52A8;&#x5E73;&#x53F0;&#x7684;&#x5DE8;&#x5927;&#x5DEE;&#x5F02;&#x4E5F;&#x5BF9;&#x5E94;&#x7528;&#x67B6;&#x6784;&#x63D0;&#x51FA;&#x4E86;&#x8981;&#x6C42;&#x3002;&#x5BA2;&#x6237;&#x968F;&#x65F6;&#x90FD;&#x53EF;&#x80FD;&#x4E0E;&#x591A;&#x4E2A;&#x4E0D;&#x540C;&#x4F9B;&#x5E94;&#x5546;&#x751F;&#x4EA7;&#x7684;&#x8BBE;&#x5907;&#xFF0C;&#x8FD0;&#x884C;&#x591A;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5E73;&#x53F0;&#xFF0C;&#x8FD0;&#x884C;&#x591A;&#x4E2A;&#x7248;&#x672C;&#x7684;&#x76F8;&#x540C;&#x64CD;&#x4F5C;&#x5E73;&#x53F0;&#x4EE5;&#x53CA;&#x4E0D;&#x540C;&#x7C7B;&#x522B;&#x7684;&#x8BBE;&#x5907;&#xFF08;&#x4F8B;&#x5982;&#x624B;&#x673A;&#x4E0E;&#x5E73;&#x677F;&#x7535;&#x8111;&#xFF09;&#x8FDB;&#x884C;&#x4EA4;&#x4E92;&#x3002; &#x8FD9;&#x4E0D;&#x4EC5;&#x5BF9;&#x79FB;&#x52A8;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#xFF0C;&#x8FD8;&#x5BF9;&#x540E;&#x7AEF;&#x670D;&#x52A1;&#x7684;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x9020;&#x6210;&#x4E86;&#x5404;&#x79CD;&#x9650;&#x5236;&#x3002;</p>
<p>&#x79FB;&#x52A8;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x901A;&#x5E38;&#x5FC5;&#x987B;&#x4E0E;&#x591A;&#x4E2A;&#x4F20;&#x7EDF;&#x7CFB;&#x7EDF;&#x4EE5;&#x53CA;&#x4E91;&#x539F;&#x751F;&#x5E94;&#x7528;&#x67B6;&#x6784;&#x4E2D;&#x7684;&#x591A;&#x4E2A;&#x5FAE;&#x670D;&#x52A1;&#x8FDB;&#x884C;&#x4EA4;&#x4E92;&#x3002;&#x8FD9;&#x4E9B;&#x670D;&#x52A1;&#x65E0;&#x6CD5;&#x8BBE;&#x8BA1;&#x6210;&#x652F;&#x6301;&#x5BA2;&#x6237;&#x4F7F;&#x7528;&#x7684;&#x5404;&#x79CD;&#x5404;&#x6837;&#x79FB;&#x52A8;&#x5E73;&#x53F0;&#x7684;&#x72EC;&#x7279;&#x9700;&#x6C42;&#x3002;&#x5F3A;&#x8FEB;&#x5B9E;&#x73B0;&#x8FD9;&#x4E9B;&#x4E0D;&#x540C;&#x7684;&#x670D;&#x52A1;&#xFF0C;&#x4E3A;&#x79FB;&#x52A8;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4E0A;&#x5E26;&#x6765;&#x4E86;&#x8D1F;&#x62C5;&#xFF0C;&#x589E;&#x52A0;&#x4E86;&#x5E94;&#x7528;&#x8BBF;&#x95EE;&#x5EF6;&#x8FDF;&#x548C;&#x7F51;&#x7EDC;&#x8BBF;&#x95EE;&#x9891;&#x7387;&#xFF0C;&#x5BFC;&#x81F4;&#x5E94;&#x7528;&#x54CD;&#x5E94;&#x6162;&#x3001;&#x8017;&#x7535;&#x91CF;&#x9AD8;&#xFF0C;&#x6700;&#x7EC8;&#x5BFC;&#x81F4;&#x7528;&#x6237;&#x5220;&#x9664;&#x60A8;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x4E91;&#x539F;&#x751F;&#x5E94;&#x7528;&#x67B6;&#x6784;&#x8FD8;&#x901A;&#x8FC7;&#x8BF8;&#x5982;API&#x7F51;&#x5173;&#x4E4B;&#x7C7B;&#x7684;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x6765;&#x652F;&#x6301;&#x79FB;&#x52A8;&#x4F18;&#x5148;&#x5F00;&#x53D1;&#x7684;&#x6982;&#x5FF5;&#xFF0C;API&#x7F51;&#x5173;&#x5C06;&#x670D;&#x52A1;&#x805A;&#x5408;&#x8D1F;&#x62C5;&#x8F6C;&#x79FB;&#x56DE;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x3002;</p>
<footer class="page-footer"><span class="copyright">Copyright &#xA9; 2017-2021 | Distributed under <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/deed.zh" target="_blank">CC BY 4.0</a> | <a href="https://jimmysong.io" target="_blank">jimmysong.io</a> all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification"> Updated at 
2021-10-08 02:25:00
</span></footer>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="the-rise-of-cloud-native.html" class="navigation navigation-prev " aria-label="Previous page: 1. 云原生的崛起">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="defining-cloud-native-architectures.html" class="navigation navigation-next " aria-label="Next page: 1.2 云原生架构的定义">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"1.1 为何使用云原生应用架构？","level":"1.2.1","depth":2,"next":{"title":"1.2 云原生架构的定义","level":"1.2.2","depth":2,"path":"chapter1/defining-cloud-native-architectures.md","ref":"chapter1/defining-cloud-native-architectures.md","articles":[]},"previous":{"title":"1. 云原生的崛起","level":"1.2","depth":1,"path":"chapter1/the-rise-of-cloud-native.md","ref":"chapter1/the-rise-of-cloud-native.md","articles":[{"title":"1.1 为何使用云原生应用架构？","level":"1.2.1","depth":2,"path":"chapter1/why-cloud-native-application-architectures.md","ref":"chapter1/why-cloud-native-application-architectures.md","articles":[]},{"title":"1.2 云原生架构的定义","level":"1.2.2","depth":2,"path":"chapter1/defining-cloud-native-architectures.md","ref":"chapter1/defining-cloud-native-architectures.md","articles":[]},{"title":"1.3 本章小结","level":"1.2.3","depth":2,"path":"chapter1/summary.md","ref":"chapter1/summary.md","articles":[]}]},"dir":"ltr"},"config":{"plugins":["github","codesnippet","splitter","page-toc-button","editlink","back-to-top-button","-lunr","-search","search-plus","github-buttons@2.1.0","favicon","tbfed-pagefooter@^0.0.1","3-ba","ga","lightbox"],"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright © 2017-2021 | Distributed under <a href=https://creativecommons.org/licenses/by-nc-sa/4.0/deed.zh>CC BY 4.0</a> | <a href=https://jimmysong.io>jimmysong.io</a>","modify_label":" Updated at ","modify_format":"YYYY-MM-DD HH:mm:ss"},"github":{"url":"https://github.com/rootsongjc/migrating-to-cloud-native-application-architectures"},"editlink":{"label":"编辑本页","multilingual":false,"base":"https://github.com/rootsongjc/migrating-to-cloud-native-application-architectures/tree/master/"},"splitter":{},"codesnippet":{},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"favicon":{"shortcut":"images/favicon.ico","bookmark":"images/favicon.ico"},"lightbox":{"jquery":true,"sameUuid":false},"page-toc-button":{},"back-to-top-button":{},"github-buttons":{"repo":"rootsongjc/migrating-to-cloud-native-application-architectures","types":["star"],"size":"small"},"3-ba":{"configuration":"auto","token":"11f7d254cfa4e0ca44b175c66d379ecc"},"ga":{"configuration":"auto","token":"UA-93485976-1"},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"showLevel":false,"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"}},"search-plus":{}},"theme":"default","author":"Jimmy Song","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"迁移到云原生应用架构","language":"zh-hans","links":{"sidebar":{"回到首页":"https://jimmysong.io","云原生社区":"https://cloudnative.to"}},"gitbook":"*","description":"Migrating to Cloud Native Application Architectures 中文版"},"file":{"path":"chapter1/why-cloud-native-application-architectures.md","mtime":"2021-10-08T02:25:00.955Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-10-08T02:25:24.518Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-page-toc-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-editlink/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-plus/jquery.mark.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-plus/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-3-ba/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-ga/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lightbox/js/lightbox.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

